{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "5e Rolltables",
  "description": "Prompt generated entities from ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n| d100 Roll | Mishap Due to a Critical Failure on a Melee Attack |\n|---------- |----------------------------------------------------- |\n| 1-2        | Your attack misses and instead you strike a nearby object, damaging your weapon. You must make a d20 roll to determine the extent of damage. |\n| 3-4        | Due to your terrible miscalculation, you drop your weapon. It lands 1d6 feet away from you. |\n| 5-6        | You lose your balance, becoming prone. For your next turn, you will need to spend half your movement to stand back up. |\n| 7-8        | You accidentally hit yourself when swinging your weapon too hard. Roll weapon damage against yourself. |\n| 9-10      | Your grip on your weapon loosens and you throw it away by mistake. The weapon lands 2d6 feet away in a random direction. |\n| 11-12    | Instead of your enemy, you strike an ally nearby. Roll damage for your ally. |\n| 13-14    | Your attack rebounds off an object, hitting you instead. The Dungeon Master rolls your weapon's damage against you. |\n| 15-16    | You misstep and fall, losing half your movement on your next turn. |\n| 17-18    | You stumble into a hostile creature, providing it an opportunity to make an attack of opportunity. |\n| 19-20    | You significantly expose your defense, every attack roll against you has advantage for the next round. |\n| 21-22    | You miss your target so widely, you lose sight of another opponent for one round. |\n| 23-24    | You spin uncontrollably after your attack and end up facing the wrong direction. |\n| 25-26    | Your weapon becomes lodged in a nearby object. You must spend your next action to free it. |\n| 27-28    | Your attack opens a gap in your defense, leaving you with -2 AC until your next turn. |\n| 29-30    | You stumble, moving 1d6 feetaway from your original position. |\n| 31-32    | You throw your weapon accidentally during your attack, causing your ally to be disarmed. |\n| 33-34    | You fail to control your weapon's swing and it leaves your hand, landing 1d6 feet away from you in a random direction. |\n| 35-36    | Due to a careless mistake, you leave yourself open. Your opponent has advantage on their next attack roll against you. |\n| 37-38    | You fall prone, providing a chance for your enemies to take an attack of opportunity. |\n| 39-40    | You accidentally hit your leg with your weapon. Take damage equal to half your weapon's damage. |\n| 41-50   | Your attack inadvertently damages your weapon (-1 to attack and damage rolls until repaired). |\n| 51-60   | You lose your footing and fall, becoming prone. |\n| 61-70   | You accidentally knock your weapon against a hard surface, causing a noticeable dent. |\n| 71-80   | You overexert yourself and take 1 level of exhaustion. |\n| 81-90   | You misjudge your attack, leaving an opening. The next attack roll against you has advantage. |\n| 91-100 | You slip and trigger a trap within 5 feet of you, if there is any. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Melee"
    },
    {
      "rawText": "## Ranged\r\n| d100 | Critical Failure Result |\n|------|----------------------------|\n| 1    | Your bowstring snaps, rendering the weapon unusable until it is repaired. |\n| 2    | Your thrown weapon slips, landing at your feet instead of at your target. |\n| 3    | Your missile veers wildly, hitting an unintended target. Reroll attack against ally in range, take lowest roll. |\n| 4    | A strong gust of wind deflects your projectile, causing it to miss completely. |\n| 5    | Your attack ricochets and hits a nearby object, potentially causing a distraction or other unexpected result. |\n| 6    | Your grip slips, jarring your aim. Your target gains a significant advantage on their next attack or action. |\n| 7    | Your ammunition is faulty, exploding upon being fired or thrown. Take 1d6 damage. |\n| 8    | You pull too hard on your slingshot, causing it to snap and hit you in the face. Stunned for 1 round. |\n| 9    | You miscalculate the arc of your thrown weapon, hitting a non-combatant or a harmless object. |\n| 10   | Your crossbow misfires, launching the bolt directly upwards. Spend next round avoiding incoming bolt. |\n| 11-20 | Your attack simply misses your target. |\n| 21-30 | Your awkward attack leaves you unbalanced, decreasing your AC by 2 until your next turn. |\n| 31-40 | The force of your release leaves you with a minor injury. Take 1 point of damage.  |\n| 41-50 | Your shot is so off mark, it seems to hit nothing at all. |\n| 51-60 | You trip as you throw, ending prone and causing the attack to miss. |\n| 61-70 | Your concentration falters, causing you to misread the wind. Your next ranged attack is at disadvantage. |\n| 71-80 | Your poor aim results in your thrown weapon being lost. |\n| 81-90 | An unfortunate twist in your release causes the weapon to hit you instead. Take your own attack damage. |\n| 91-99 | Your arrow/bolt/stone goes off course, potentially triggering a trap or causing a rockslide. |\n| 100   | The universe seems against you. Not only does your attack miss, but your weapon breaks, rendering it unusable until repaired. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| Roll (d100) | Mishap |\n|-------------|-------------------------------------------------------------------|\n| 1           | Your magic backfires, you take the maximum possible damage.       |\n| 2           | Your arcane energies wildly swing releasing a loud bang causing temporary deafness in a 10ft radius.|\n| 3           | Your hands are badly singed, making it hard to cast spells requiring somatic components until you receive healing.|\n| 4           | The magic spirals out of control creating a sinkhole beneath you.|\n| 5           | The spell fails but the magical energy is not wasted and instead targets a random ally.|\n| 6           | In focusing your magic, you didn't notice an immediate environmental hazard, causing you to trip and fall.|\n| 7           | Your magic rebounds, causing you to be levitated uncontrollably for the next minute.|\n| 8           | The spell's energy transfers into an inanimate object nearby causing it to animate and turn hostile.|\n| 9           | Your arcane symbol or focus becomes extremely hot, inflicting burns and dropping it might cause a fire.|\n| 10          | An arcane disruption causes you to lose the understanding of your next highest spell slot.           |\n| 11          | The failed spell has drained you, you gain a level of exhaustion.|\n| 12          | Your abilities are brought into question by your allies, suffering disadvantage on charisma checks when dealing with them.|\n| 13          | The magical feedback makes you lose your sense of direction for an hour.| \n| 14          | You inadvertently tear a small hole in the plane causing a minor elemental to be summoned and it is not happy about it.|\n| 15          | The wasted magic causes vibrant and visible arcane tattoos to appear on your skin. They are permanent.|\n| 16-20       |  A mysterious arcane backlash causes you to forget the botched spell until you finish a long rest.|\n| 21-25       | Arcane energies escape and illuminate you making it hard to hide as you shed bright light in a 10ft radius.|\n| 26-30       | You accidentally teleport some of your belongings to an unknown location.|\n| 31-35       | You fall unconscious due to magical exhaustion and wake up after 1d4 hours.|\n| 36-40       | Magic feedback causes a minor wild magic surge from the Sorcerer’s Wild Magic table.|\n| 41-45       | You become magically bound to the place you're standing on, unable to move away for 1d4 hours.|\n| 46-50       | A string of bad luck affects you granting advantage to the very next attack against you.|\n| 51-55       | The magical mishap shatters your confidence. You have disadvantage on spell attack rolls for an hour.|\n| 56-60       | The spell inverts its purpose (healing hurts, fire cools, etc.) as determined by the GM.|\n| 61-65       | The failed spell causes an object in your vicinity to become magically enchanted with a useless or troubling property.|\n| 66-70       | You can't help but speak in rhyme for the next hour.|\n| 71-75       | The earsplitting pop of displaced air deafens you for 1d6 minutes.|\n| 76-80       | The lost magic manifests as 3d10 gold pieces that shower around you, potentially causing suspicion.|\n| 81-85       | You are unable to control your magic fully, unexpectedly casting a different spell from your list.|\n| 86-90       | The miscast spell causes you to perceive everyone as a threat causing you to become frightened.|\n| 91-95       | You lose the ability to speak any language but gibberish for 1d4 hours due to the arcane mishap.|\n| 96-99       | The miscast cracks your arcane focus (if used) rendering it unusable.|\n| 100         | An unexpected surge of power turns the failed spell into a much more powerful version, hitting both allies and enemies in its path.|\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Kehra | A wanderer who sings the songs of the wind, has silver-grey plumage with sharp eyes |\n| 2          | Cawren | A flighty prankster, his plumage is a vibrant red and gold |\n| 3          | Izurre | A contemplative aarakocra with azure plumage, often seen carving intricate designs into stones |\n| 4          | N'kri | Slightly gold tinted, firm in her dedication to nature and protection |\n| 5          | Thraaak | A solitary hawk-like aarakocra of dark brown plumage, speaks rarely |\n| 6          | Zikkee | An elder with speckles of gray on her plumage, a great storyteller |\n| 7          | Rrai | Young and impulsive with bright green plumage, she is full of energy |\n| 8          | S'iki | A calm scholar with snowy-white plumage who respectfully keeps his distance |\n| 9          | Kinnn | An agile scout with marbled black and white feathers, always alert |\n| 10         | Yarkuu | A fiery leader with spark-like red splashes on her plumage |\n| 11         | Tuktek | A grey-feathered aarakocra, always seen with scrolls of wisdom around him |\n| 12         | V'rii | A golden plumage with deeply focused eyes, she is a patient hunter |\n| 13         | Nen're | A slim aarakocra with iridescent feathers and a mesmerizing voice |\n| 14         | Pirruk | A bulky aarakocra of mixed grey and blue plumage, fierce in defense |\n| 15         | Quaqqa | An endearing figure with plush white plumage, always ready to share a kindness |\n| 16         | Xuurza | A veteran scout with copper. Known for his vast knowledge of terrain and tactics |\n| 17         | Eek'ri | Plump and jovial, with purple and teal blended plumage, best cook in the tribe |\n| 18         | Ska'ka | A watchful guard with ash-gray feathers, rarely seen without her spear |\n| 19         | Zizook | Dark green plumage, master of wind whispers. He can sense changes in the weather before they hit |\n| 20         | Riki'ku | Multicolored plumage shimmering in sunlight. Skillful jeweler |\n| ...        | ... | ... |\n| 100        | K'vii | A revered elder with ancient white plumage. Known for her wisdom and diplomatic skills |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n| ---| --- | --- |\n| 1 | Abdiel | Stern protector with glowing eyes and a hint of golden wings fading into the mist. |\n| 2 | Seraphina | Dauntless lady with silver hair and a steady gaze, wreathed in a soft heavenly glow. |\n| 3 | Uriel | Tall, hawk-faced individual with radiant eyes imploring for righteous action. |\n| 4 | Zephrine | Elegantly poised lady with a nimbus of golden light, indicative of her celestial lineage. |\n| 5 | Nathaniel | Youthful, valiant figure with a subtle aura of power and gentle, golden wings. |\n| 6 | Evangeline | Serene woman with long silver hair and intense, silver eyes reflecting exceptional insight. |\n| 7 | Michael | Robust, armored man his eyes revealing a starry night sky, fingers tingling with divine energy. |\n| 8 | Ariel | Vigilant, stolid figure with a gently pulsating halo and a glowing longsword. |\n| 9 | Ramiel | Intensely focused individual, his radiant visage hinting a strong bond with the divine. |\n| 10 | Gabriel | Striking personage with metallic skin and eyes glowing with an otherworldly blue light. |\n| 11 | Jophiel | Hauntingly graceful figure, draped in flowing robes that reflect cosmic energies. |\n| 12 | Cassiel | Stoic personality with an otherworldly aura and faintly radiant eyes. |\n| 13 | Selaphiel | Strikingly honest personality with mild wings that shimmer softly in daylight. |\n| 14 | Zuriel | Unyielding and indomitable, he emanates a steady radiance from his brightly shining eyes. |\n| 15 | Raziel | Intimidating warrior possessing a calm, tranquil gaze and divine, burning aura. |\n| 16 | Irad | Ethereal beauty, with soft glowing skin and an aura generating a soothing warmth. |\n| 17 | Arariel | A radiant scholar adorned with a halo of gossamer light, carries an air of wisdom. |\n| 18 | Azrael | Edgy persona, a halo subtly glowing despite the somber expressions; synonymous with fierce justice. |\n| 19 | Metatron | Brawny figure with an aura of authority; eyes shimmering intensely with divine energies. |\n| 20 | Haniel | A person of keen intellect, the wisdom of ages reflected in tranquil, glowing eyes. |\n| 21 | Bethor | Noble warrior with radiant wings, steel grey eyes hinting at immense power. |\n| 22 | Leliel | Ferocious individual emanating a protective aura, subtle light flickering around sword edges. |\n| 23 | Puriel | Serene and insightful, her glowing gaze speaks of boundless patience and understanding. |\n| 24 | Rhamiel | Introspective figure glowing with a serene aura, reflecting a divine connection. |\n| 25 | Jeremiel | Stoic with eyes gleaming with celestial energy, represents rectitude and resilience. |\n| ... | ... | ... |\n| 100 | Raguel | Silent observer, shine in his eyes and a commanding aura indicate enormous celestial power. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n|Dice Value|Name|Description|\n|---|---|---|\n|1|Hackagle|This bugbear is covered in rough, unkempt fur and has an enormous battle-axe slung over his shoulder.|\n|2|Crumgnar|Standing tall, this bugbear is covered in armor crafted from bones and carries a staff adorned with a raven's skull.|\n|3|Brotusk|An elder Bugbear with a long, white mane. His scars are testament to many battles fought.|\n|4|Snarle Fangbite|This bugbear has sharp extended canines, and his hands have deep bite marks.|\n|5|Krumog|This burly bugbear has a stern look on face and a rawhide whip at his belt.|\n|6|Grothak|A seemingly blind bugbear, who’s actuality proficient in hearing and smell, carries a large quarterstaff.|\n|7|Jorn Rumbledrum|This bugbear carries a rusted old war drum, enchanting his tribe with rhythmic war songs.|\n|8|Rugak|A beastmaster bugbear with multiple pet worgs, has a heavily scarred face.|\n|9|Grug Blacktoe|This bugbear has charred toes, result of stepping into a magical fire trap, carries an immolating spear.|\n|10|Gorg Knotwhisker|This bugbear has knotted and tangled whiskers, teases enemies with swinging spiked chain.|\n|11|Nargab|A shadowy bugbear rogue, proficient with darts from the shadows.|\n|12|Thughrum|A bugbear who is a cult fanatic, raises undead skeletons to support his tribe.|\n|13|Racknarr|A heavily tattooed bugbear with a grudge against humanoid creatures.|\n|14|Rotgrum Woundlicker|This bugbear has unhealthy habit of licking his wounds, carries an acid-etched blade.|\n|15|Grulmok|A weathered bugbear ranger who commands respect from his pack.|\n|16|Shrak Gutspiller|This bugbear delights in disemboweling his victims and carries a cursed dagger.|\n|17|Maglub|Maglub is agile for a bugbear with sinister looking longbow.|\n|18|Burgor|This mighty bugbear stands a head taller than his kin and swings a massive flail.|\n|19|Krog|A bugbear with sparkling Saphire eyes has mastered the art of illusion magic.|\n|20|Gark|A grizzled veteran bugbear, carries a shield made from giant scorpion carapace.|\n|...|...|...|\n|100|Zog|Zog is a bugbear chief standing taller than his kin, armed with a spiked, oversized, greatclub.|\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n| Dice Value | Name | Description |\n|:---:|:---:|:---:|\n| 1 | Vilthris | Sharp features, grey eyes that never seem to focus, and dark hair kept in a tight bun. Prefers dark, loose clothing.\n| 2 | Shiral | Clean-cut, with steel grey eyes and blonde hair neatly pulled back. They prefer clothing with cleverly designed hidden pockets.\n| 3 | Venn | Ornate silver hair accessories in meticulously arranged hair, piercing violet eyes, always seen in meticulous attire. \n| 4 | Misun | Plain look with deep-set dark eyes and dark hair. Prefers practical, unadorned clothing.\n| 5 | Dechire | Pale skin, silver eyes, always seen with a strange, old artifact. \n| 6 | Menon | Bald, with prominent tattoo markings and hawk-like eyes. They dress in tunics of rich colors.\n| 7 | Altran | Long dark hair, worrisome look, green changing to blue eyes. Prefers functional clothing.\n| 8 | Selith | Sharp eyes of ever-changing color, alabaster skin with an aura of elegance. Prefers luxurious clothing and jewelry.\n| 9 | Niiven | Understated appearance; sharp, scrutinizing eyes that can be disconcerting. Casual attire. \n| 10 | Ricter | Broad and tall, dark hair, with a long scar across their face. Often dons sturdy, armored outfits. \n| 11 | Gornost | Weathered skin, hollow cheeks, rigid posture, and eyes that have seen too much. Wears simple, worn-out clothing.\n| 12 | Calor | A well-muscled body, hair as black as night, and grey eyes. Adorned in fitting leather attire.\n| 13 | Baelis | Slender yet strong build, short-cropped hair, and untrusting cold eyes. Always in practical, combat-ready attire.\n| 14 | Ferrin | Broad-built, long dark hair, brown eyes, that show a spark of kindness. Prefers reinforced comfortable attire.\n| 15 | Tanish | Lean and tall, with bright eyes that frequently change color. Prefers flowing, decorative clothing.\n| 16 | Nimir | Mousy hair, timid posture, and nervous eyes. Often seen in oversized, worn-out clothing.\n| 17 | Eldir | Short hair, eyes that seem to look right through you, always dressed in formal attire.\n| 18 | Lacen | Strong jawline, short hair, and determined eyes. Typically seen in ornate, heavily embroidered clothing.\n| 19 | Malenduis | Crafty, moss green eyes under tousled hair. Prefers bohemian style clothing.\n| 20 | Henno | Short and stout, features outlined with sharp tattoos. Usually seen in traditional, tribal-like clothing.\n| 21 - 100 |*Roll again thrice, merge different features from results.*| - |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1-2 | Morghul | An ancient and powerful red dragon, known for his fiery temper and destructive rampages. |\n| 3-4 | Sylphire | A cunning and deceitful green dragon, often deceives adventurers into her deadly traps. |\n| 5-6 | Obsidan | A black dragon who dwells in swampy areas, feared for his corrosive breath and methodical hunting tactics. |\n| 7-8 | Voxis | A master manipulator, a blue dragon with enigmatic charm and chilling electrocuting breath. |\n| 9-10 | Ethereal | A majestic silver dragon, known for her benevolent nature and unearthly shimmering scales. |\n| 11-12 | Ghaldracon | A stern and merciless iron dragon, commands an army of mountainous dwarves at his beck. |\n| 13-14 | Solitary | A golden dragon of wisdom, prefers solitude and engages in meditative states of understanding. |\n| 15-16 | Nocturnis | A shadow dragon cloaked in darkness, his presence is marked by an eerie sense of cold nothingness. |\n| 17-18 | Elyslandra | An exotic and noble brass dragon, shares riddles and wisdom to the chosen few. |\n| 19-20 | Thundrax | A bronze dragon known for his electrifying temperament and fierce loyalty to his claimed land. |\n| 21-22 | Xenochrest | An elusive crystal dragon, renowned for its mysterious and esoteric knowledge of unseen realms. |\n| 23-24 | Frostbane | A dangerous white dragon, feared for his chilling breath and total dominance over icy terrains. |\n| 25-26 | Vortexus | A storm dragon who controls formidable weather power, often seen preceding disastrous events. |\n| 27-28 | Glacienne | An ice dragon known for her frosty demeanor and influential control over creatures of cold habitats. |\n| 29-30 | Ashenflame | A volatile pyroclastic dragon, notoriously known for creating immense destruction with his explosive fits. |\n| 31-32 | Seraphina | A radiant and peaceful moonstone dragon, engulfs those in need with healing light from her scales. |\n| 33-34 | Kronos | An unstoppable force, an adamantite dragon of supreme strength commanding time and space. |\n| 35-36 | Whirlwing | A temperamental copper dragon, perplexes its foes with its whimsical gusts of wind. |\n| 37-38 | Dreadfang | A fearsome necrotic dragon, emanates a field of despair and dread inducing necrosis in living beings. |\n| 39-40 | Glimmerveil | An ethereal astral dragon, intertwines with cosmic entities, displaying illusions of celestial phenomena. |\n| 41-42 | Radix | An earth dragon known for its imperturbable nature and an unwavering bond with the terrestrial energy. |\n| 43-44 | Tempest | A driven wind dragon, commands turbulent aerial currents aiming for ultimate control of the skies. |\n| 45-46 | Netherqueen | A dreaded void dragon, consumes all magic within her vicinity, leaving behind a emptiness. |\n| 47-48 | Veinbeard | A rustic cobalt dragon, dwells underground nurturing a special bond with gem-bearing creatures. |\n| 49-50 | Solstice | A revered sun dragon, embodies the warmth and life-enhancing power of the sun. |\n| 51-52 | Typhoonis | A fierce sea dragon, holds sovereign rule over the creatures and storms of the ocean. |\n| 53-54 | Crux | An imposing granite dragon, embodies the raw power and stability of stone. |\n| 55-56 | Blightclaw | The foul and toxically potent plague dragon, his signature decay-inducing toxicity taints land and life alike. |\n| 57-58 | Trance | A mystical dream dragon, influences the dreams and nightmares of sleeping creatures. |\n| 59-60 | Deeprend | An abyssal dragon, known for his haunting presence deep in the oceanic trenches. |\n| 61-100 | [Name] | A veritable [Color/Dragon Breed] dragon, with characteristics in line with their species' nature. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n|1| Korinn | A Dragonborn of white scales with piercing blue eyes. They're a known historian specializing in ancient ruins. |\n|2| Thava | Thava is a black-scaled Dragonborn with studded armor and an unwavering devotion to the cause of justice. |\n|3| Ehkahk | A skilled blacksmith of green dragon heritage known for crafting weapons of extraordinary quality. |\n|4| Ghesh | An enigmatic Dragonborn of blue scales, cleric and a gifted healer. |\n|5| Ezirr | A Dragonborn ranger of red dragon ancestry with sun-weathered scales and a stoic demeanor. |\n|6| Rasqa | A rogue Dragonborn who trades in secrets, has silver scales that contrast sharply with their dark cloak. |\n|7| Qhari | A gold-scaled dragonborn wizard obsessed with recovering lost arcane knowledge. |\n|8| Balasar | A bronze Dragonborn paladin, of unwavering loyalty and shining armor. |\n|9| Zariel | A copper Dragonborn, renowned bard known for their epic poems and songs across the land. |\n|10| Kava | A white Dragonborn, a trader known for their uncanny ability to sense profitable deals. |\n|11| Kreytzen | A seasoned Dragonborn warrior of black scales, known for his strength and strategic prowess on the battlefield. |\n|12| Mindartis | A silver Dragonborn monk, respected for their discipline and pursuit of enlightenment. |\n|13| Jhank | A Dragonborn of green scales, agile and swift, known as an expert scout. |\n|14| Ysyria | A Mage of blue scales who spends most of her time in secluded study. |\n|15| Torinn | A stoic Dragonborn of red scales, who guards a small village with steadfast commitment. |\n|16| HexFang | A silver Dragonborn rogue with a smoky past and a razor-sharp wit. |\n|17| Baalrith | A gold Dragonborn sorcerer, known for his eccentricity and uncontrolled bursts of magic. |\n|18| Quarethon | A bronze Dragonborn paladin, protector of a sacred shrine who never wavers in his duty. |\n|19| Ssylarin | A copper Dragonborn with a golden voice; a traveling troubadour with a penchant for storytelling. |\n|20| Irnyrith | A white Dragonborn artificer who creates complex inventions out of the most basic materials. |\n|...| ... | ... |\n|100| Rhothomir | An ancient Dragonborn of gold scales, an oracle, his eyes radiating mystical energy. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n| Dice Value | Name | Description |\n| ----------- | ----------- | ----------- |\n| 1 | Veerith Har'oloth | An older drow with an aura of self-importance. Dresses in ornate robes. |\n| 2 | Ysolde Auvryath | A battle-scarred veteran, tough and taciturn. |\n| 3 | Arnos Kenafin | A drow scholar with prismatic spectacles perched on his nose. |\n| 4 | Sidara Vlo'Urden | An untrustworthy figure, cloaked in shadows and secrecy. |\n| 5 | Serico Melrae'Vasa | A boisterous bard with a dark sense of humor. |\n| 6 | Mordrith T'orgh | A quiet figure, constantly scrutinizing their surroundings. |\n| 7 | Narath Teken'ghym | A drow druid with a strangely serene demeanor. |\n| 8 | Kaelthys Faen Tlabbar | An ambitious drow sorcerer with a powerful aura. |\n| 9 | Leosil Mizzr'yin | A twitchy individual with a nervous tic and nervous attitude. |\n| 10 | Relna Tlabbar  | A charismatic rogue, smooth talking and shifty. |\n| 11 | Veldrin Zeq'nor | An athletic ranger, suspicious of outsiders. |\n| 12 | Rizzen N'a'svv | A wise elder drow, with long, white hair and aged features. |\n| 13 | Khellendros Mourn | An intimidating drow warrior, covered in old, faded scars. |\n| 14 | Zedarr T'sarran | A sly and cunning individual with a beguiling smile. |\n| 15 | Yvonnel Bet'ruel | A young and naive drow, still learning their place in the world. |\n| 16 | Lualyrr Xiltyn | A quiet and thoughtful individual, with a love for books. |\n| 17 | Faenrae Le'fein | A charismatic individual, always at the center of attention. |\n| 18 | Tagaun Duskryn | A stoic and gruff individual, seemingly unaffected by hardships. |\n| 19 | Khaless Godeep | A quiet drow with a mysterious past. |\n| 20 | Zael'Zebrael | A noble drow, looking down their nose at those they consider beneath them. |\n| 21-100 | *Roll again or choose one of the above* | *Same as corresponding name* |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Agark | A stout duergar with piercing red eyes and a long braided beard. Proficient miner. |\n| 2 | Bhaal | Grizzled veteran, scarred and terse. Reveres discipline above all else. |\n| 3 | Caldur | Proud blacksmith, embellishes his armor with intricate designs and runes. |\n| 4 | Drak | Cold and calculating traitor. Known to betray his own for the right price. |\n| 5 | Eberk | Hardened tavern keeper. Bearded, heavyset, and extraordinarily tough. |\n| 6 | Fargrim | Cynical merchant, trades exquisite dark iron artifacts. |\n| 7 | Gimal | Reclusive duergar druid. Known to tame the deadliest underdark creatures. |\n| 8 | Hael | Master trap maker. Untrusting and highly meticulous. |\n| 9 | Ilde | Chieftain's daughter. Smart and beautiful. Struggles against her controlled destiny. |\n| 10 | Jardur | Ambitious leader. Ruthless in his quest for power and control. |\n| 11 | Kegar | Expert poison maker. Minces few words, communicates primarily through trade. |\n| 12 | Largor | Burly, ink-covered duergar. Renowned as a wise and ancient sage. |\n| 13 | Mord | Vinemaker. Crafts potent brews, both soothing or deadly. |\n| 14 | Narg | Outcast. Renegade duergar on the run for crimes against his people. |\n| 15 | Odhran | Uncanny pickpocket. Lives in the shadows, steals unguarded treasures. |\n| 16 | Pyrrus | Fire-scorched alchemist. Crafts explosive concoctions with volatile temperament to match. |\n| 17 | Queldur | Weapon master at the forge. Designs deadly and exotic weapons. |\n| 18 | Rurik | Ex-slave. Understands the underdark from a life of hardship. |\n| 19 | Syndur | Mysterious assassin. Cold-hearted and singularly focused on his targets. |\n| 20 | Turgon | Expert gemcutter. Crafts intricate designs, gaining the respect of his people. |\n| 21-100 | Varun | A silent and secretive duergar scout known for being ruthless and efficient. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Borin Granitebeard | Elderly dwarf, white haired, a respected blacksmith. |\n| 2 | Faldar Forgehammer | Young dwarf, ambitious, aspiring armorer. |\n| 3 | Thargun Axebearer | Middle-aged soldier, decorated veteran, honorable. |\n| 4 | Gormur Ironvein | Stern dwarf sage, knowledgeable in ancient dwarven lore. |\n| 5 | Dugmarr Flintfoot | Dwarf merchant, specializes in rare gems and minerals. |\n| 6 | Hulgar Steelbraid | Dwarf scout, rough-looking, stealthy, skilled tracker. |\n| 7 | Dhargun Earthmantle | Dwarf cleric, deeply religious, serves the god of the forge. |\n| 8 | Brundar Brassbeard | Dwarf bard, loud, loves to tell epic tales. |\n| 9 | Tholgrin Stoneshield | Dwarf guard, dedicated, takes his job very seriously. |\n| 10 | Norur Goldhand | Wealthy dwarf, mine owner, influential in local politics. |\n| 11 | Ulfgar Ironeye | Dwarf pirate, gruff, known for metal eyepatch. |\n| 12 | Tharain Hardrock | Dwarf geologist, has uncanny ability to find valuable minerals. |\n| 13 | Baldin Copperhand | Dwarf coppersmith, dedicated to perfecting his craft. |\n| 14 | Thorgrim Gravelgut | Dwarf cook, famous for rock stew. |\n| 15 | Nurain Pebbleback | Dwarven healer, uses rare minerals to aid in his treatment. |\n| 16 | Dhorin Boulderbeard | Retired adventurer, grizzled, has numerous trophies. |\n| 17 | Aldor Brickfist | Dwarf mason, responsible for many important building structures. |\n| 18 | Tharindra Shalesong | Female dwarf poet, her songs echo the deep. |\n| 19 | Kora Battlehammer | Dwarf protector, respected in the clan for her bravery. |\n| 20 | Garnet  Markermaker | Dwarf prospector, always has a knack for where to dig next. |\n|...|...|...|\n| 100 | Korhudir Deepdelver | Elderly historian, famous for chronicling the history of his people. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Elrohir | A solemn elven scout with silver hair and piercing blue eyes, known for his exceptional archery skills. |\n| 2          | Saelihn | A tall, slender elf with long golden hair and a serene demeanor, who serves as a high-ranking advisor in the elven court. |\n| 3          | Galadriel | A regal female elf with a commanding presence and unmatched wisdom, who holds the position of Queen in an elven kingdom. |\n| 4          | Finrod | An intelligent, scholarly elf with a collection of ancient tomes and scrolls. |\n| 5          | Thranduil | A stern and imposing king who rules with an iron fist, known for his ruthless strategic decisions in battle. |\n| 6          | Arwen | A delicate and ethereal elf maiden with an air of timeless grace, often seen strumming a harp or weaving flowers into her hair. |\n| 7          | Celeborn | A stoic and silent warrior with a reputation for his calm under pressure and impressive swordsmanship. |\n| 8          | Glorfindel | A brave and heroic elf known far and wide for his courageous deeds in battle. |\n| 9          | Legolas | An adept archer with lightning-quick reflexes who always seems to have a quip ready, even in the midst of battle. |\n| 10         | Tauriel | A fearless warrior with fiery red hair who is as adept at diplomacy as she is with a sword. |\n| 11         | Haldir | A knowledgeable elf with deep understanding of the ancient lore and legends of his people. |\n| 12         | Luthien | A captivating enchantress with an ethereal voice that could soothe even the fiercest of beasts. |\n| 13         | Eöl | A skilled blacksmith, known for crafting the finest elven weapons from rare and precious metals. |\n| 14         | Fëanor | An ambitious and driven wizard with unmatched magical ability, always eager to increase his power. |\n| 15         | Maedhros | A charismatic spokesperson for the elven community, known for his diplomacy and fair judgement. |\n| 16         | Fingolfin | A disciplined military officer with a strategic mind, honored for his courageous service in previous battles. |\n| 17         | Erestor | A quiet and reserved elder, highly respected for his wisdom and counsel in the elven council. |\n| 18         | Caranthir | A proud and seasoned warrior, renowned for his striking blue eyes and the large scar across his face. |\n| 19         | Lórien | A gentle and compassionate healer with a deep understanding of elven herbs and potions. |\n| 20         | Nellas | An agile and nimble elf who is more comfortable in the treetops than on the ground, serving as the community's primary scout. |\n| 21-100     | (Continue as above) | |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n| Dice Value  | Name  | Description |\n|---|---|---|\n| 1  |Aerannis   | A tall and athletic Air Genasi with flowing white hair that seems constantly moved by an invisible wind.  |\n| 2  | Belashyrra  | An Earth Genasi with greenish-brown, rough skin, resembling a walking boulder. |\n| 3  | Caelum  | A young Air Genasi with silver-blue skin and eyes that look like the clear summer sky. |\n| 4  | Dolgrin  | A robust Earth Genasi with skin as tough and gray as stone, endowed with immense physical strength. |\n| 5  | Erebos  | A Water Genasi with azure skin and long hair that flows like a calm river. |\n| 6  | Filauria  | A vibrant Earth Genasi with emerald green hair that appears to grow tiny flowers occasionally. |\n| 7  | Ghenni  | A Fire Genasi with hair that flutters like flames. His temper is as fiery as the element he was born from. |\n| 8  | Halycon  | A reserved Air Genasi with a voice as soft and enchanting as the rustle of leaves in the wind. |\n| 9  | Iroas  | Fire Genasi known for his volatile temper and fiery, fearsome red-orange hair that crackles and pops like a bonfire. |\n| 10 | Jhessant  | Earth Genasi with a kind heart and skin that resembles a tree's bark, echoing her bond with nature. |\n| 11 | Keldorn  | Water Genasi who speaks with a soothing voice that reminds listeners of a gently flowing creek. His skin is of a deep blue color. |\n| 12 | Lhazaar  | An Earth Genasi with skin of sandy brown color. His eyes sparkle like hidden gems, matching his merry character. |\n| 13 | Mylan  | Fire Genasi with eyes that always seem to smolder. His presence could be easily intimidating. |\n| 14 | Nenar  | Air Genasi who always carries the scent of rain. Her laughter sounds like the howling wind. |\n| 15 | Orym  | Water Genasi who moves with the grace of a calm sea but battles with the ferocity of a storm. |\n| ... | ...  | ... |\n| 100 | Zypher | An Air Genasi with eyes the color of a stormy sky that whispers of her tempestuous spirit. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| Dice Value | Name           | Description                                                                                |\n|------------|----------------|-------------------------------------------------------------------------------------------|\n| 1          | Thimble Brighteyes | A meticulously clean gnome with a well-trimmed beard and striking blue eyes.               |\n| 2          | Zipper Steamcrank | An engineer and tinkerer of gadgets, always seen in oil-stained clothes and goggles.      |\n| 3          | Lexi Hardhat     | A determined gnome with a muscular build, primarily works in construction.                |\n| 4          | Locket Gearlock   | Maker of intricate clockwork toys, wears ornate jewelry of her own making.                |\n| 5          | Fizzo Fiddlesticks | A gnome bard known for his agile fingers on the lute, has a contagious laugh.           |\n| 6          | Netti Nutbolt     | A cautious and reserved gnome, well-known for her skill in trap-making.                   |\n| 7          | Rispen Twillwire | A gnome with a perpetually inquisitive nature, known for his extensive library.           |\n| 8          | Penny Gearspan    | Renowned for her breathtaking visual art installations, often involving clockwork birds.  |\n| 9          | Amble Ironchip  | A physically imposing gnome with an even larger personality, a blacksmith by trade.       |\n| 10         | Klick Springgear | Calm and meticulous, enjoys the company of his countless clockwork creatures.             |\n| 11         | Winnie Widgetwhizz | A gnome alchemist, energetic and absent-minded with a shock of frazzled hair.           |\n| 12         | Gimble Cogtwist   | A gnome with remarkable agility, acrobat and lock-picker of notable repute.              |\n| 13         | Tibbs Copperknob  | A grandiose gnome merchant known for his extravagant attire.                             |\n| 14         | Hassie Rumblegear  | A hardy gnome always accompanied by her pet mechanical dog.                              |\n| 15         | Griggs Pinwhistle  | A gnome of few words, operates a local tavern with a vast collection of brews.           |\n| 16         | Jinks Flitfly     | A mischievous and quick gnome, infamous local pickpocket.                                |\n| 17         | Flori Thunderpipes | A gnome inventor known for her loud, explosive devices and larger-than-life goggles.      |\n| 18         | Pogo Kettlewhisk  | A talented gnome chef who creates magical pastries that are both delicious and eccentric. |\n| 19         | Bellis Clanksprocket | A stern gnome, runs the city watch with an iron fist.                                  |\n| 20         | Sprocket Quickstring | A deft gnome ranger, mysterious and agile.                                              |\n| ...        | ...                | ...                                                                                      |\n| 99         | Boddynock Muddleport | A gnome sailor and cartographer, navigator of sea and sky.                             |\n| 100        | Rikki Bobblecork   | A gnome who specializes in the art of potion brewing and herbalism.                      |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Grub Snatcher | His bald head glistening in the torchlight, Grub commands respect with territorial squabbles. |\n| 2 | Muck Digger | Hollow-eyed but clever, Muck is known for scrounging and finding hidden things. |\n| 3 | Skulk Finder | Shorter than most, Skulk's keen sense of smell often leads the tribe to fresh game. |\n| 4 | Stink Chaser | Oddly charming for a goblin, Stink has a charismatic effect on his fellow tribesmen. |\n| 5 | Scrap Nibbler | An elderly goblin covered in scars, Scrap's wisdom dominates tribe decisions. |\n| 6 | Grit Shaker | With nimble fingers, Grit leads the tribe in crafting and maintenance. |\n| 7 | Dreg Wader | Known for his culinary efforts, Dreg often directs the team in gathering and cooking. |\n| 8 | Runt Dodger | The youngest of the tribe, Runt's quick reflexes often get him out of trouble. |\n| 9 | Sludge Slurper | Oddly quiet, Sludge's knack for stealth and evasion is often used for reconnaissance. |\n| 10 | Screech Echoer | Screech presents a frightening, painted face, often leading assaults for the tribe. |\n| ... | ... | ... |\n| 89 | Bile Pucker | An ever-coughing goblin, Bile is left alone for his tendency to spread diseases. |\n| 90 | Slop Handler | Known best for his janitorial efforts, Slop usually has a rag in his hands. |\n| 91 | Whelp Crier | This goblin covets shiny things and often goes out for nighttime raids. |\n| 92 | Slum Dweller | A wiry veteran of many battles, Slum is often turned to for tactical advice. |\n| 93 | Filth Crumbler | The reclusive Filth rarely leaves his hole, often spotted tinkering with contraptions. |\n| 94 | Crud Muncher | This chunky goblin with a big grin is known for his ability to eat anything. |\n| 95 | Grit Gobbler | Known for his calloused hands and unyielding resolve, Grit forges weapons for the tribe. |\n| 96 | Rubbler Jogger | This tireless goblin works at maintaining the defenses of the goblin settlement. |\n| 97 | Scum Babbler | The tribe scribe, Scum, records every event with his ornate shorthand. |\n| 98 | Brine Scrubber | Brine keeps the tribe clean and disease-free with his daily rounds. |\n| 99 | Snot Shaker | Snot provides medical assistance to the tribe with her gathered herbs and moss. |\n| 100 | Grime Sifter | An expert miner, Grime leads the way in excavation and tunneling. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n```\n| Dice Value | Name          | Description                                              |\n|------------|---------------|----------------------------------------------------------|\n| 1          | Aukan         | Stern Goliath musclebound healer with protective nature  |\n| 2          | Ilikan        | Calm Goliath warrior always ready for the next battle    |\n| 3          | Thotham       | Disciplined Goliath scout with a keen eye for danger     |\n| 4          | Pabom         | Stoic Goliath mage driven by the pursuit of knowledge    |\n| 5          | Vimak         | Large Goliath blacksmith with remarkable strength        |\n| 6          | Gae-Al        | Silent Goliath ranger respected for tracking skills      |\n| 7          | Aukan-Thotham | Goliath warrior noted for tactical brilliance in combat  |\n| 8          | Eglath        | Goliath chieftain known for his wisdom and leadership    |\n| 9          | Lo-Kag        | Veteran Goliath guard with countless tales of past wars  |\n| 10         | Kavaki        | Determined Goliath rogue known for his cunning strategies|\n| ...        | ...           | ...                                                      |\n| 91         | Uthal         | Goliath tribal elder respected for experience and wisdom |\n| 92         | Kavaki-Vimak  | Goliath scholar engrossed in ancient tribal histories    |\n| 93         | Gauthak       | Goliath warrior who lets his actions speak for him       |\n| 94         | Korath        | Resolute Goliath warden charged with guarding sacred sites|\n| 95         | Korga         | Goliath huntress known for her skill at stalking prey    |\n| 96         | Eglath-Gauthak| Wise Goliath shaman deeply in touch with the spirits     |\n| 97         | Vimak-Lagak   | Goliath bard who tells stories of his people's strength  |\n| 98         | Thotham-Gauthak| Honored Goliath champion, undefeated in tribal duels     |\n| 99         | Ilaith        | Enigmatic Goliath druid who walks in tune with nature    |\n|100         | Goliath-Pahom | Legendary Goliath hero still spoken of in awe            |\n```\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Alaric Windrider | A half-elf ranger, tanned from long hours tracking wildlife and hunting game. His eyes reflect the greenery he spends so much time in. |\n| 2 | Althea Moonshadow | An elusive half-elf rogue with a nimble hand. Her trusty short sword has gotten her out of more than one tricky situation. |\n| 3 | Hadriel Snowmantle | A half-elf cleric with deep faith and unwavering dedication. His friends rely on him in tough times. |\n| 4 | Elaria Nightwhisper | A half-elf sorceress, who draws her powers from a magical bloodline. Her eyes, a dazzling mix of gold and emerald, hint at her arcane prowess. |\n| 5 | Thantalir Swiftfoot | A half-elf bard, skilled with the lute and harp. His songs charm crowds and his words, his foes. |\n| 6 | Erevan Starflower | A half-elf paladin, renowned for his bravery in battle. His gleaming armor is a testament to his nobility. |\n| 7 | Caelthalas Hawksong | A half-elf wizard, whose spells are as smooth and precise as the hawk in flight. |\n| 8 | Caldorien Songsteel | A half-elf fighter, cunning and relentless on the battlefield. His sharp blade reflects his sharper wit. |\n| 9 | Nuala Evenwood | A serene half-elf druid in tune with nature. The delicate balance of the forest reflects in her actions. |\n| 10 | Ieleen Sunwhisper | A cheerful half-elf warlock, bound by a pact with a celestial patron. Her demeanor belies her arcane power. |\n| ... | ... | ... |\n| 100 | Faelynn Starhart | A fiercely independent half-elf monk, who trains relentlessly. Her dedication is unmatched and her heart, unwavering. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Grom | A stern, grizzled warrior who has seen too many battles. |\n| 2          | Urgosh | A blacksmith keen on his craft, always hammering away. |\n| 3          | Kagra | An imposing shaman with an air of primal energy around her. |\n| 4          | Ragog | A rogue, skilled in stealth and deception. |\n| 5          | Murok | Possesses a brute strength and is feared in local wrestling circles. |\n| 6          | Thura | A clever and tactical-minded mercenary. |\n| 7          | Borgar | A stoic and unmovable guard, unwavering in his duty. |\n| 8          | Fomog | A rugged hunter, unmatched in tracking and survival. |\n| 9          | Krusk | A bard, unconventional yet talented in both song and story. |\n| 10         | Hurog | A seasoned veteran, calm and collected in the face of danger. |\n| 11         | Yagra | A herbalist who has a connection with nature and its gifts. |\n| 12         | Vargu | A half-orc monk who seeks enlightenment and harmony. |\n| 13         | Gort | An intimidating bouncer for the local tavern. |\n| 14         | Brug | A sailor who has navigated treacherous seas and lived to tell the tale. |\n| 15         | Sharg | A ranger whose arrows find their mark unerringly. |\n| 16         | Urug | A lumberjack who toils away tirelessly, axe in hand. |\n| 17         | Gragha | A stern-faced matron who upholds family and tradition. |\n| 18         | Thog | A weary traveller with many tales to share. |\n| 19         | Mogarr | A stoic half-orc who has taken up the ways of the cleric. |\n| 20         | Karg | A wild barbarian with a fierce spirit and a warrior's heart. |\n| ...        | ...  | ...         |\n| 100        | Ugror | A wise elder who commands respect and imparts wisdom. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n| Dice Value | Name             | Description                                                                           |\n|------------|------------------|---------------------------------------------------------------------------------------|\n| 1          | Lidda Grainfoot  | Stoic Halfling merchant with a knack for numbers and a passion for fair trading.      |\n| 2          | Roscoe Thatch    | Disciplined soldier, known for his strategic mind and unwavering loyalty.             |\n| 3          | Peren Nailo      | Mysterious ranger who seems to know every nook and cranny of the wilderness.          |\n| 4          | Cora Hornwood    | Resourceful thief. She is small in size but has a spirit too mighty to contain.       |\n| 5          | Milo Burrow      | Masterful chef who can create delicious meals from the simplest of ingredients.       |\n| 6          | Lily Underhill   | Skilled herbalist who makes the finest medicinal potions in town.                     |\n| 7          | Tuck of Westmarch| Sturdy stonemason, responsible for some of the most durable buildings around.         |\n| 8          | Ivy Greenbottle  | Meticulous librarian, keeper of vast knowledge and age-old halfling lore.             |\n| 9          | Pippin Applefoot | Reserved potter renowned for his delicate and intricate designs.                      |\n| 10         | Ferris Evenwood  | Insightful cleric who provides wisdom and spiritual guidance to his fellows.          |\n| 11         | Dora Bramblefoot | Serious architect, every detail of her work is precise and perfect.                   |\n| 12         | Bilbo Willowroot | Quick-witted bard who uses humor to lighten even the grimmest of situations.          |\n| 13         | Ella Copperkettle| Influential town councilmember renowned for her sound judgement and diplomacy.         |\n| 14         | Cedric Barleybeard| Skilled blacksmith who is quiet and reserved but always reliable.                     |\n| 15         | Nerida Stout     | Fierce protector of the town and its people, always ready for battle.                 |\n| 16         | Faelar Silverleaf| Calm and composed silversmith with impeccable craftsmanship.                           |\n| 17         | Miri Shortcloak  | Strict but fair teacher who is devoted to educating the village's youth.              |\n| 18         | Theo Swifthand   | Mysterious rogue with an unknown past and unpredictable actions.                       |\n| 19         | Nan Puddlefoot   | Soulful artist whose paintings speak volumes about her perspectives.                   |\n| 20         | Flint Grasswind  | Dedicated healer and keeper of the town's health and wellbeing.                        |\n| 21         | Rina Softshoe    | Sharp-eyed scout and communicator, vital link across vast distances.                   |\n| 22         | Geoff Quicksilver| Lovable prankster yet serious when needed, uses his humor to connect with others.      |\n| 23         | Zinnia Goodbody  | Resolute leader, her great courage and powerful voice unite her people in tough times. |\n| 24         | Hob Shortfoot    | Pensive historian dedicated to maintaining the chronicles of his people's past.       |\n| 25         | Cadi Underbough  | Worldly trader known for her vast knowledge of goods and fair trade practices.         |\n| 26         | Ponto Smoothhands| Well-versed in town law and a cornerstone to his community's fairness.                |\n| 27         | Velma Brushgather| Farmer with the greenest of thumbs, she provides hearty meals for all.                 |\n| 28         | Bram Lightfoot   | Skilled hunter, always brings back the best game for his people.                        |\n| 29         | Kyra Brightwood  | Humble seamstress known for the most beautiful and well-crafted clothes in town.        |\n| 30         | Regis Hearth   | Wisest elder of the town, his advice is sought by all who need guidance.                 |\n| ...        | ...            | ...                                                                                     |\n| 100        | Leo Goldentoes  | Master brewer whose ales and wines are known far and wide for their delicate flavors.  |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name | Description |\n|--------|--------|--------|\n| 1 | Gorzag | Chieftain with red skin and graying hair; runs his tribe with iron discipline. |\n| 2 | Snaghur | Tracker with mottled brown skin; cunning and silent as a fox. |\n| 3 | Hrothnak | Elderly tactician with pale skin; whispers of experience and lore. |\n| 4 | Ghrol | Blacksmith with sulfurous yellow skin; creates weapons of excellent quality. |\n| 5 | Durzag | Scarred warrior with a deep red skin; symbol of bravery and resilience. |\n| 6 | Grakash | Tall scout with grey skin; swift as the wind, and just as quiet. |\n| 7 | Shrognak | Healer with green skin; provider of solace and hope among his kind. |\n| 8 | Thordak | Strategist with orange skin; his plans weave intricate webs of victory. |\n| 9 | Zurok | Archer with dark blue skin; always finds his target, no matter the distance. |\n| 10 | Vorgak | Robust leader with hardened skin; his terrifying roar can cause fear among enemies. |\n| 11 | Urznak | Sentry with brown skin; guardian of his tribe, standing as the first line of defense. |\n| 12 | Groznak | Spellcaster with red skin; a conduit of mystical energy and knowledge. |\n| 13 | Bhagur | Cook with sallow-colored skin; prepares meals that infuse warriors with energy. |\n| 14 | Hoblin | Petty thief with dark green skin; his nimble fingers pilfer goods with surprising subtlety. |\n| 15 | Skabgut | Logger with tough black skin; provides the much-needed firewood for the clan. |\n| 16 | Muzgob | Miner with rocky grey skin; toils relentlessly within the mountain's heart. |\n| 17 | Ruknik | Skald with pale orange skin; his songs uplift the spirit of the tribe. |\n| 18 | Grotbag | Tailor with amberglo skin; mends garments with precise craftsmanship. |\n| 19 | Zogrod | Elder with leathery skin; a reservoir of wisdom and traditions. |\n| 20 | Skarmak | Trapper with ash-grey skin; capable of capturing the fiercest of beasts. |\n| 21 - 100 | Repeat | For any roll of 21 or higher, repeat the above entries. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Aedan Blackwood | Wizened old sorcerer with a distinct hunch |\n| 2 | Lysandra Hawkborn | Stern female paladin in shining armor |\n| 3 | Thoren Ironfist | Scarred veteran warrior with a missing eye |\n| 4 | Elara Silverleaf | Cold, calculating female elf ranger |\n| 5 | Edgar Thorsbane | Muscular blacksmith with tattoos |\n| 6 | Octavia Swiftwind | Agile rogue with a hidden blade |\n| 7 | Roderick Shadowfoot | Elusive, bearded thief in dark attire |\n| 8 | Xanthe Lightweaver | Blind priestess with a calm demeanor |\n| 9 | Leoric Nightsong | Stern bard draped in shadowy robes |\n| 10 | Braxton Lionheart | Nobleman with a commanding presence |\n| 11 | Persephone Coldwell | Quiet, mysterious woman with icy eyes |\n| 12 | Merrick Goldbrew | Affable, rotund innkeeper with a hearty laugh |\n| 13 | Selene Waverider | Female sailor with weathered skin |\n| 14 | Marlon Grimlock | Gaunt gravekeeper that terrifies children |\n| 15 | Katrina Cobblepot | Elderly alchemist who always smells of herbs |\n| 16 | Artemis Firewind | Blunt redhead ranger who prefers solitude |\n| 17 | Fletcher Stoneguard | Dwarven jeweler with a monocle |\n| 18 | Valeria Thundermantle | Lightning-scarred mage with a tempestuous personality |\n| 19 | Abelard Oakenbarrel | Boisterous dwarven trader always looking for a deal |\n| 20 | Cressida Nightshade | Elusive, alluring herbalist with many secrets |\n| 21 | Bromley Buckleberry | Jovial halfling farmer with rosy cheeks |\n| 22 | Darrow Blackthorn | Pensive scholar in worn, ink-stained robes |\n| 23 | Evangeline Dawnbringer | Sincere cleric with calming aura |\n| 24 | Osric Stormrider | Rugged seafarer with a braided beard |\n| 25 | Hazel Starreader | Eccentric astronomer with curious eyes |\n| ... | ... | ... |\n| 100 | Zenobia Steelwhisper | Enigmatic woman in armor, a mercenary leader |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Sniv | A short, grey, clean-shaven kobold, with a nondescript tunic cladding his wiry frame. |\n| 2 | Yip | A bald, wiry kobold with a reddish hue, known for her sharp wit. |\n| 3 | Pox | A yellow-scaled kobold with spotting of green, unusually tall with a lazy eye. |\n| 4 | Snarl | A stocky, graying kobold with a jagged scar on his left cheek. |\n| 5 | Sly | A sketchy, green-eyed kobold with a knack for sleight of hand. |\n| 6 | Nip | A diminutive, wide-eyed kobold with a knack for taming dire rats. |\n| 7 | Szik | A malnourished, weary-eyed kobold, known for his adeptness with traps and locks. |\n| 8 | Wart | A pudgy, one-eyed kobold with a reputation for being surprisingly resilient in combat. |\n| 9 | Blix | A gaunt, pale kobold with a surprisingly deft touch at healing. |\n| 10 | Krill | An aloof, red-hued kobold with an unnatural affinity for fire. |\n| 11 | Vex | A curious, bespectacled kobold, known for her fascination with magical artifacts. |\n| 12 | Snype | A slender, yellow-scaled kobold, known as a keen-eyed scout. |\n| 13 | Stab | A muscular, scarred kobold, known for his surprising strength and bloodlust. |\n| 14 | Jinx | A nimble, cobalt-scaled kobold with a mischievous grin. |\n| 15 | Creech | A hulking, dwarfish-like kobold, with a reputation as a heavy drinker. |\n| 16 | Nill | A tiny, nervous kobold with an uncanny ability to remain unseen. |\n| 17 | Grack | A tall, scarred kobold known for his stern discipline and tactical acumen. |\n| 18 | Skiver | An emaciated, twitchy kobold who is uncommonly good at disappearance. |\n| 19 | Snout | A bulbous-nosed, hunched kobold with a strangely soothing voice. |\n| 20 | Jarl | A portly, jovial kobold known for his boisterous laugh and love of food. |\n| 21-100 | - | Repeat the names, but with variations in physical appearance and personality traits. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Ssz'ran | A grizzled warrior, his scales scarred from many battles. |\n| 2 | Kesk | A youthful and curious individual, eager to explore the world. |\n| 3 | Th'ssiss | A skilled hunter with a keen eye and a steady hand. |\n| 4 | Vosk | A knowledgeable shaman, filled with ancient wisdom of the tribe. |\n| 5 | Z'ssk | A quiet and introspective individual, preferring the company of books to people. |\n| 6 | Cassi | A charismatic leader, able to inspire others with rousing speeches. |\n| 7 | H'ssiss | A cunning rogue, always looking for the next big score. |\n| 8 | Grr'stti | A dependable and loyal friend, considered to be a pillar of the community. |\n| 9 | Issth | A reserved and contemplative individual, often found in deep thought. |\n| 10 | K'ssandra | An enchanting sorceress, her eyes glowing with arcane power. |\n| 11 | Shriss | A humble craftsman, known for his exquisite carvings. |\n| 12 | R'ssali | A cheerful and outgoing trader, always wheeling and dealing. |\n| 13 | Yrrisk | A brave guard, ever vigilant in his duty. |\n| 14 | Q'ssara | An enchanting bard, her tales captivating all who listen. |\n| 15 | Dur'Ssz | A battle-hardened veteran, his gaze stoic and unyielding. |\n| 16 | M'ssy | A gentle soul, always ready with a kind word and a helping hand. |\n| 17 | S'serth | A skilled herbalist, known for her remarkable healing potions. |\n| 18 | A'thiss | A maudlin drunk, drowning his sorrows at the local tavern. |\n| 19 | X'krr | An ambitious upstart, eager to prove his worth. |\n| 20 | D'ssik | An unflappable pragmatist, always ready with a plan. |\n| 21 | F'ssor | A stoic elder, bearing the weight of the tribe's expectations. |\n| 22 | J'ssok | A playful trickster, always ready with a jest or a prank. |\n| 23 | K'sesth | A thoughtful scholar, ever in search for knowledge. |\n| 24 | N'rss | A grim executioner, his gaze as cold as his heart. |\n| 25 | R'sstik | A mundane farmer, his scales sunburnt and worn. |\n| 26-50 | Repeat entries 1-25 with variation in description |\n| 51-75 | Repeat entries 1-25 with variation in description |\n| 76-100 | Repeat entries 1-25 with variation in description |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name      | Description |\n|---|-----------|------------|\n| 1 | Gruumsh   | The one-eyed orc god of storms and war. |\n| 2 | Drog      | A burly orc with an oversized battleaxe and a necklace of gnoll teeth. |\n| 3 | Olga      | Orc matriarch skilled in the ways of orcish Shamanism. |\n| 4 | Urz       | A young aggressive Orc warrior, eager to prove his prowess in battle. |\n| 5 | Turgar    | A grizzled old orc, with one good eye and plenty of battle scars. |\n| 6 | Nergath   | A reclusive orc herbalist notorious for his deadly poisons. |\n| 7 | Grushta   | A tall and lean female orc who is a skilled tracker and huntress. |\n| 8 | Zug       | A brutish orc with a reputation for quick temper and quicker fists. |\n| 9 | Rakgar    | A once fearsome orc war chief, now scarred and weary from decades of combat. |\n| 10| Oolo      | A misshapen orc, despised by his own people for his weakness. |\n| 11| Grezzt    | A massive orc warrior with four tusk-like teeth protruding from his mouth. |\n| 12| Vorg      | A wise orc shaman who can invoke the spirits of the ancestors. |\n| 13| Strakk    | A wily orc scout with a knack for stealth and ambush tactics. |\n| 14| Narg      | A crude orc blacksmith known for crafting vicious weapons. |\n| 15| Thruk     | A towering orc hunter who relishes the thrill of the chase. |\n| 16| Zark      | A low-ranking orc grunt, eager to climb the ranks of his tribe. |\n| 17| Grumbul   | An aging orc chieftain struggling to maintain control over his tribe. |\n| 18| Kragg     | A brutal orc raider known for his cruel efficiency. |\n| 19| Brug      | A slow-witted but strong orc often used as muscle by his smarter kin. |\n| 20| Lashnak   | A cunning orc thief with a reputation for disappearing into shadows. |\n\n... (The table continues up to Dice Value 100).\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n| Dice Value | Name  | Description |\n|--------------|---------|---------------------------------------------------------------------|\n| 1-2 | Zephyr | This Tiefling is the quiet type and is rarely seen without a book in their hands. Their eyes shimmer with an almost blue fire. |\n| 3-4 | Asmodea | A tall and striking female Tiefling, Asmodea has sparkling purple eyes and an aura of self-assured confidence. |\n| 5-6 | Caim | Caim has a devilish charm about him, and his crimson eyes pull you in closer. He carries a longsword on his back and a lute by his waist.  |\n| 7-8 | Astaroth | A rugged and somber Tiefling, Astaroth has seen hard times yet continues to push on with resilience and determination. |\n| 9-10 | Baal | This Tiefling has a deep and echoing voice and has an almost regal air about him, reflected in his immaculately kept silver horns. |\n| 11-12 | Lilith | Lilith is a stunning female Tiefling with glowing emerald eyes and a captivating aura. She's quick with her wit, often leaving others off balance. |\n| 13-14 | Morax | His dark hood barely conceals the glowing red eyes of Morax. He's an individual of few words and many secrets. |\n| 15-16 | Vine | Vine has an air of danger about her. There's an unpredictable light in her eyes that makes others tread carefully. |\n| 17-18 | Abaddon | An older Tiefling, Abaddon is wise and carries decades of carefully balanced experience behind their dark eyes. |\n| 19-20 | Legion | This Tiefling is endearingly clumsy, often tripping over their tail, but their bright smile and exuberance are infectious. |\n| 21-22 | Belphegor | Belphegor has a calm demeanor, often found meditating. His sinuous tail constantly moves to a rhythm only he seems to hear. |\n| 23-24 | Aamon | Small for a Tiefling, Aamon commands respect with his fiery eyes and stern demeanor. |\n| 25-26 | Armaros | A Tiefling of few words. His hand always gripping the hilt of his blade, ready to draw at a moment's notice. |\n| 27-28 | Zepar | Zepar has a quick laugh and a quicker temper. His wild hair matches his unchecked fiery passion. |\n| 29-30 | Beleth | A humble Tiefling healer, Beleth is basically seen without his herb pouch and a smile. |\n| 31-32 | Decarabia | Decarabia has a deep love for animals and can often be found surrounded by them. |\n| 33-34 | Focalor | Focalor has an odd fascination with the weather and spends most of their time studying the skies. |\n| 35-36 | Glasya-Labolas | When it comes to knowledge of magic, few can match this Tiefling. Their eyes shine with insatiable curiosity. |\n| 37-38 | Shax | Shax has a strong distrust of strangers but is fiercely loyal to those she calls friends. |\n| 39-40 | Stolas | His silver hair well-kept and his eyes sharp as a hawk's, Stolas is a man of refined tastes. |\n| 41-42 | Xaphan | Xaphan is a mirthful individual often seen playing a stringed instrument at local taverns, enchanting listeners with her melodies. |\n| 43-44 | Amy | This Tiefling's eyes conceal centuries of wisdom. Their quiet demeanor and frail form contradict their incredible magical abilities. |\n| 45-46 | Buer | Buer's gaze is intense, yet quiet and careful. They are a skilled herbalist and seldom leave their apothecary. |\n| 47-48 | Malphas | Malphas is a nimble fingered thief, and their roguish charm is infamous in the city's underworld. |\n| 49-50 | Raum | Raum is a mysterious Tiefling, draped in cloaks and shadows. He's an informant and an enigma, trading in secrets and whispers. |\n| 51-52 | Vassago | Possessed of a silver tongue, Vassago can confidently navigate the treacherous world of politics and intrigue. |\n| 53-54 | Orias | Orias is a seasoned sailor with a love for the sea. His skills in navigation are sought after by many. |\n| 55-56 | Naberius | Naberius has mastered the art of deception and uses his charm to manipulate others into doing his bidding. |\n| 57-58 | Haagenti | Haagenti is a renowned blacksmith whose weapons are considered works of art. |\n| 59-60 | Barbatos | This Tiefling is a capable knight with a strong sense of justice. |\n| 61-62 | Mammon | Connoisseur of fine things, Mammon is a merchant of exotic goods with an eye for quality. |\n| 63-64 | Marax | Strong and quiet, Marax is a farmer with a sharp intellect and a heart of gold. |\n| 65-66 | Paimon | Paimon is an advisor known for her clever stratagems and a no-nonsense attitude. |\n| 67-68 | Sabnock | A hardy wilderness guide, Sabnock knows every inch of the local wilderness. |\n| 69-70 | Valefar | Valefar is a cunning controller of dreams and nightmares, possessing a mind unlike any other. |\n| 71-72 | Eligos | Skilled in negotiation and diplomacy, Eligos is known to resolve disputes with ease. |\n| 73-74 | Leraje | Dark and brooding, Leraje is a master archer, her shot never misses. |\n| 75-76 | Alastor | A grizzled veteran soldier who commands respect from all who meet him. |\n| 77-78 | Alloces | Alloces stands tall, her blue-edged horns and azure eyes leave a lasting impression. |\n| 79-80 | Gaap | Unpredictable and wild, Gaap is a whirlwind of energy who can't resist a good party. |\n| 81-82 | Aim | With a quiet strength, Aim is a resourceful hunter, always on the prowl. |\n| 83-84 | Orobas | Orobas is an empath who always seems to understand emotions deeper than anyone else. |\n| 85-86 | Zagan | Zagan is a talented artisan known throughout the kingdom for her intricate jewelry designs. |\n| 87-88 | Purson | Known for his culinary skills, Purson is a restaurant owner with a flame-colored tail. |\n| 89-90 | Ipos | Revered by many, feared by some, Ipos is a powerful sorcerer known for his lightning-fast incantations. |\n| 91-92 | Amdusias | Amdusias has a voice that soothes the soul. His songs are a thing of beauty, and his melodies, legendary. |\n| 93-94 | Andras | Andras is a skilled fencer, always looking for a challenging duel. |\n| 95-96 | Foras | Foras has a knack for fixing things, be it a broken wagon wheel or a faulty lock. He's the go-to handyman in the community. |\n| 97-98 | Gremory | Gremory wears a constant smirk on their face. They are a clever trickster and always seem to have a prank up their sleeve. |\n| 99-100 | Murmur | Murmur, a soft-spoken scholar, has a mind full of endless lore and tales of times long past. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}