{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "5e Rolltables",
  "description": "Prompt generated entities from ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n# d20 Critical Failure Melee Attack Mishaps\n\nRoll a d20 on this table if a melee attack results in a critical failure:\n\n1. You stumble and fall prone, losing the rest of your turn.\n2. You pull a muscle and suffer a level of exhaustion.\n3. An allied creature within 5 feet takes 1d4 damage.\n4. You accidentally hit yourself, taking weapon damage.\n5. You drop your weapon and it flies 10 feet away from you.\n6. You accidentally hit a nearby object, breaking it irreparably.\n7. You step on a rusty nail, taking 1d6 damage and needing a tetanus shot.\n8. You slip in a nearby puddle, causing yourself to become restrained.\n9. Your weapon gets stuck in a nearby wall or tree, requiring an action to remove it.\n10. You accidentally provoke an opportunity attack from an adjacent enemy.\n11. You stumble into a nearby ally, pushing them back 5 feet.\n12. You hit a nearby ally in the back, dealing reduced weapon damage.\n13. You begin bleeding and must use an action to stanch the flow.\n14. You accidentally set your hair on fire, taking 1d4 burn damage.\n15. You hit yourself in the face and are blinded until the end of your next turn.\n16. You accidentally hit an environmental hazard, causing oil or water to splash everywhere.\n17. You accidentally hit an ally's familiar, causing them to become temporarily hostile.\n18. You hit an object with a lot of give, your weapon gets stuck, requiring an action to remove it.\n19. You slip in a pile of dung, becoming covered in filth and giving enemies advantage on their attacks against you.\n20. You knock yourself out, and you remain unconscious for 1d4 rounds.\r\n## Ranged\r\n1. Your bowstring snaps, rendering your bow useless.\n2. You accidentally shoot an ally, dealing them damage.\n3. Your arrow ricochets off a hard surface and hits you instead, dealing damage.\n4. You trip and fall, causing you to miss your shot completely.\n5. You forget to nock an arrow and fire an empty shot, alerting enemies to your presence.\n6. You accidentally shoot a nearby explosive barrel or object, causing an explosion and dealing damage to everyone in the area.\n7. Your arrow gets stuck in your bow, making it difficult to load and fire.\n8. You lose your grip on your weapon, causing it to fly out of your hands and land out of reach.\n9. You accidentally shoot a non-combatant, such as a civilian or animal, causing unintended harm.\n10. Your shot misses the target and strikes an object, causing a loud noise that attracts enemies to your location.\n11. The string on your bow becomes tangled or knotted, preventing you from using your weapon.\n12. You fail to properly gauge the distance to your target, causing your shot to fall short or overshoot.\n13. Your arrow misses the target and gets stuck in a nearby obstacle, such as a tree or rock.\n14. You accidentally hit an ally's weapon with your shot, knocking it out of their hand.\n15. Your arrow becomes lodged in your bowstring, forcing you to take time to remove it before you can shoot again.\n16. You accidentally hit a valuable or important object, such as a magical artifact or relic, causing damage.\n17. Your shot misses the target and strikes a different enemy that was not intended, possibly causing more harm.\n18. You accidentally shoot your arrow in the wrong direction, alerting enemies to your presence and buying them time to prepare.\n19. Your shot misses the target and hits a nearby enemy’s shield, causing them to become aware of your presence.\n20. Your arrow misses the target and becomes lodged in the ground, making it difficult to retrieve it and slowing down your party.\r\n## Arcane\r\n## d20 Mishaps due to a critical failure on an arcane attack\nRoll a d20 when a player critically fails an arcane attack and consult the following table:\n\n1. The spell backfires and affects the caster instead, roll on the Wild Magic Surge Table (PHB p. 104).\n2. The spell sputters out, leaving the target unaffected\n3. The spell rebounds and hits the nearest ally instead\n4. A teleport spell malfunction causes the caster to be randomly transported to a dangerous location nearby\n5. The caster is temporarily blinded by the arcane energy of the spell\n6. The spell creates a loud noise alerting nearby enemies to the party's presence\n7. The caster's hand becomes temporarily possessed by a malevolent spirit and begins acting against their will\n8. The spell causes the ground to shake, alerting any nearby creatures to the party's presence\n9. The spell creates a minor elemental that attacks the caster and the party before disappearing\n10. The spell fails spectacularly, causing the caster to fall prone and take 1d6 bludgeoning damage\n11. The spell creates a strong gust of wind in the opposite direction, pushing the caster backwards 10 feet and knocking them prone\n12. The caster is briefly paralyzed by the magical feedback\n13. The spell activates a trap or environmental hazard in the area\n14. The spell causes the caster to become invisible for 1d4 rounds while they try to regain control of their magic\n15. The spell creates a minor illusion that distracts the caster, granting disadvantage to their next spell attack\n16. The spell causes the caster's weapon to explode, dealing 1d10 thunder damage to themselves and anyone within 5 feet\n17. The spell creates a temporary portal to the Elemental Plane of Fire, causing a wave of heat to wash over the party\n18. The caster accidentally summons a hostile creature or monster\n19. The spell is absorbed by a nearby magical object, causing it to become enchanted or cursed\n20. The caster involuntarily polymorphs into a small animal for 1d4 rounds before regaining their normal form.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee Attack",
        "Ranged Attack",
        "Melee Attack"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables"
    },
    {
      "rawText": "## Melee\r\n# d20 Fantasy Rolltable: Mishaps due to a Critical Failure on a Melee Attack \n\nRoll a d20 and consult the following table for hilarious consequences: \n\n1. You trip and fall prone, leaving yourself open to attack for the rest of your turn. \n2. You accidentally hit your teammate standing next to your intended target for half the damage.\n3. Your weapon flies out of your hand and lands 10 feet away.\n4. You swing too hard and spin in a circle, making yourself dizzy and imposing disadvantage on your next attack. \n5. You hit yourself in the face with your own weapon, taking 1d4 damage.\n6. You accidentally hit an innocent bystander, who happens to be a powerful wizard cursing you for the rest of the day.\n7. You hit the ground too hard, causing small rocks and debris to rain down on you and those near you.\n8. You stumble, strike your head and pass out for one round.\n9. Your weapon gets stuck in a nearby object, like a wall or a tree, leaving it unusable until you make a successful DC 15 Strength check.\n10. You hit your intended target with a critical failure that lands a hilarious quip about their armor or bodily functions, causing the target to lose composure and vomit for one round. \n11. Your weapon breaks in half, leaving you with only the bottom or the top half for the rest of the fight. \n12. You miss your intended target and instead hit a nearby object, causing an avalanche or knocking down a tree.\n13. You twist your ankle during the attack, halving your movement until you finish a short rest.\n14. Your opponent counterattacks with a melee attack, dealing maximum damage.\n15. You accidentally hit yourself in a serious body part and go prone for one round.\n16. Roll twice on this table and apply both results.\n17. You hit a hidden button on your opponent's armor that transforms it into a comical costume for the remainder of the encounter, imposing disadvantage on their attack rolls due to their uncontrollable laughter.\n18. Your failed attack causes a loud noise, attracting other monsters or creatures to the vicinity.\n19. Your missed swing causes an unexpected gust of wind, pushing you 10 feet away in a random direction.\n20. You whiff so bad, you do a complete 360 spin, leaving yourself nauseous and disoriented for the rest of the fight, imposing disadvantage on all attack rolls.\r\n## Ranged\r\n# Mishaps due to a critical failure on a ranged attack\n\n1. Your bowstring snaps, whipping painfully against your exposed skin.\n2. You trip over your own feet and land on your backside, your weapon clattering uselessly away from you.\n3. Your projectile ricochets off a nearby rock and hits you in the face for 1 point of damage.\n4. Your weapon misfires, spraying you with debris and causing 2 points of damage.\n5. Your bowstring tangles, making it difficult to reload.\n6. Your arrow falls short and lands in a nearby stream, wasting one piece of ammunition.\n7. Your weapon malfunctions, causing a loud bang that startles nearby creatures.\n8. Your projectile misses so wildly that it hits a nearby ally instead, dealing 1d6 damage.\n9. Your arrow embeds itself in a nearby tree, requiring a significant amount of force to extract.\n10. You accidentally release the wrong end of your weapon, nearly knocking yourself unconscious.\n11. Your weapon overheats, causing the handle to become uncomfortably hot.\n12. Your shot goes wide, but not before crashing into a nearby bakery, ruining a tray of perfectly good pastries.\n13. Your ammunition scatters everywhere except towards your intended target.\n14. Your shot misses so badly, you're not even sure where it went.\n15. Your weapon backfires, startling you and all nearby allies.\n16. Your projectile rebounds off a nearby wall and back towards you, causing 1d4 damage.\n17. You accidentally let go of your weapon mid-swing and it goes flying off into the nearby wilderness.\n18. Your arrow gets stuck in a nearby suit of armor, rendering it effectively useless.\n19. Your shot misses by a hair's breadth, shattering a precious vase in the process.\n20. Your weapon jams, rendering it inoperable for the next round of combat.\r\n## Arcane\r\n# d20 Arcane Mishaps\n\nRoll a d20 if a character critically fails on an arcane attack. If they are not careful, the following whimsical mishaps might happen:\n\n1. The spell fizzles out in a harmless but embarrassing display of colored smoke.\n2. The caster's robes become uncomfortably tight and fail to fit, exposing their undergarments.\n3. The caster's eyes begin to glow an eerie green, making them look like a particularly spooky apparition.\n4. The spell bounces off the target and hits the caster instead, causing them to accidentally shrink to half their size.\n5. The caster's spellbook levitates into the air and flies around them, mocking them with rude gestures.\n6. The magical energy backfires - the caster grows a bushy beard or mustache made of glittering silver light.\n7. The caster suddenly switches places with their familiar, causing them to assume each other's body for the next few rounds.\n8. The magical energy rips open a small rift in the fabric of reality, allowing in a swarm of mischievous pixies that swarm around the caster.\n9. The spell rebounds off the target and hits a random object nearby, causing it to grow to enormous size.\n10. The caster finds that their tongue has inexplicably developed a taste for a certain type of dirt or grime, such as rocks or mud.\n11. A particularly impish faerie appears, dancing on the caster's wand and refusing to let them cast any more spells until they can catch her.\n12. The caster's fingers turn into green, warty tentacles, making any subsequent spellcasting impossible until they can shake them off.\n13. The spell sends the caster's arm waving wildly about, causing them to slap and strike anything within reach.\n14. The spell ricochets off a nearby surface, hitting the caster in the face and covering them in slime.\n15. The caster's shadow develops a life of its own and begins to chase and tease them until they can catch it.\n16. The spell engulfs the caster in sparkles and rainbows, impairing their vision and causing a rash of inexplicable euphoria.\n17. The spell expends so much magical energy that the caster becomes exhausted.\n18. The magical energy backfires, causing the caster to begin uncontrollably spouting random words and noises.\n19. The caster's armor turns into smoke but reforms after one hour of wear.\n20. The magical energy bursts through the ground and causes an earthquake, shaking the entire area and alerting any nearby enemies.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee Attack",
        "Ranged Attack",
        "Melee Attack",
        "Whimsical"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Whimsical"
    },
    {
      "rawText": "## Elves\r\n| **Dice Value** | **Name** | **Description** |\n|:-------------:|:--------:|:---------------:|\n|       1       |   Eira   |  A quiet elf who spends most of her time reading and exploring the forests. She can often be found collecting herbs and plants for her magical experiments. |\n|       2       |  Galadriel  |  A noble and regal elf, Galadriel is known for her beauty and grace. She is often sought after for her wisdom and guidance in matters of politics and diplomacy. |\n|       3       |   Elrohir |  A skilled warrior and expert archer, Elrohir has spent years honing his combat skills on the front lines of battles against the forces of darkness. |\n|       4       |  Arwen   |  A gentle and caring elf, Arwen is known for her kindness and compassion. She has a special talent for healing and often serves as a medic for wounded soldiers. |\n|       5       |  Legolas  |  A skilled tracker and adventurer, Legolas is always ready for the next quest or adventure. He has a quick wit and often uses humor to diffuse tense situations. |\n|       6       |  Celeborn  |  A wise and powerful elf lord, Celeborn is respected and feared by many. He is known for his strategic mind and cunning tactics in battle. |\n|       7       |   Nimrodel |  A reclusive and mysterious elf, Nimrodel lives deep in the heart of the forest. She is rumored to possess powerful magic and can be unpredictable at times. |\n|       8       |  Elladan  |  A fierce and proud elf, Elladan is often the first to charge into battle. He is known for his bravery and determination, and is a natural leader on the battlefield. |\n|       9       |   Glorfindel |  An enigmatic and charismatic elf, Glorfindel has traveled the world and seen many wonders. He is a master of diplomacy and can often negotiate peace between warring factions. |\n|       10      |  Thranduil |  A stern and uncompromising elf king, Thranduil rules over a powerful elven kingdom in the forest. He is loyal to his people and will do anything to protect them. |\n|       11      |  Aranel  | A gentle and nurturing elf, Aranel is known for her skills as a midwife and healer. She is often sought after by expectant mothers and families with young children. |\n|       12      |  Tauriel  |  A fearless warrior and skilled hunter, Tauriel is a force to be reckoned with on the battlefield. She is fiercely loyal to her comrades and will stop at nothing to protect them. |\n|       13      |   Cirdan  |  An ancient and wise elf, Cirdan has lived for thousands of years. He possesses a wealth of knowledge about the world and is respected by all who know him. |\n|       14      |   Luthien  |  A beautiful and talented elf maiden, Luthien is known for her musical skills and her ability to weave enchantments with her voice. She often travels the land, sharing her music with all who will listen. |\n|       15      |   Amroth  |  A proud and noble elf lord, Amroth is revered by his people. He has a talent for diplomacy and is often called upon to negotiate treaties between elven clans and neighboring kingdoms. |\n|       16      |   Erestor |  A studious and contemplative elf, Erestor spends most of his time in libraries and archives, studying ancient tomes and scrolls. He possesses a wealth of knowledge about magic and history. |\n|       17      |   Gwindor  |  A fierce and battle-hardened elf warrior, Gwindor has fought in many wars and battles. He is known for his courage and his ability to rally troops in times of crisis. |\n|       18      |  Thalion  |  A skilled ranger and expert tracker, Thalion has spent his life exploring the wilderness and protecting his people from threats both natural and supernatural. |\n|       19      |   Gil-galad |  A legendary and powerful elf king, Gil-galad led the elven armies against the forces of darkness during the War of the Last Alliance. He is revered by many as a hero and a legend. |\n|       20      |   Eol  |  A dark and brooding elf, Eol was banished from his people for his crimes against them. He is known for his skill as a blacksmith and his mastery of dark magic. |\r\n## Dwarves\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Torvag Ironbeard | A grizzled old dwarf with a thick, bushy beard and scars crisscrossing his face. He's missing an eye and a hand, but he more than makes up for it with his blustery demeanor. |\n| 2 | Morgrim Stonefist | A dwarf with deep-set eyes and a square jaw. He speaks in a slow, deliberate voice that carries the weight of centuries of wisdom. |\n| 3 | Greta Graniteheart | A middle-aged dwarf with a jolly demeanor and a hearty laugh. She's always ready with a tankard of ale and a story to tell. |\n| 4 | Korga Deepdelver | A dwarf with a narrow build and piercing blue eyes. She moves with a fluid grace that belies her considerable strength. |\n| 5 | Drogan Steeltoe | A dwarf with a barrel chest and a booming voice. He's never caught without a weapon in hand, and always seems to be spoiling for a fight. |\n| 6 | Thrain Fireforge | A dwarf with a shock of deep red hair and a bushy beard to match. He's quick with a joke, but deadly serious when it comes to his craftsmanship. |\n| 7 | Gundar Earthborn | A dwarf with a face like a craggy rock formation. He's slow to trust outsiders, but fiercely loyal to those he considers friends. |\n| 8 | Filda Copperbeard | A dwarf with a round, jovial face and a twinkle in her eye. She's always ready with a witty retort or a clever solution to a tricky problem. |\n| 9 | Balin Stonehelm | A dwarf with a thick, sturdy build and a perpetually furrowed brow. He takes his responsibilities seriously, and can be counted on to lend a helping hand when needed. |\n| 10 | Eitri Ironfist | A dwarf with an intense gaze and a no-nonsense demeanor. He's not one for small talk, and prefers to let his actions speak for him. |\n| 11 | Kelda Frostbeard | A dwarf with piercing blue eyes and skin as white as snow. She's as quick-witted as she is quick with a blade, and can hold her own in any situation. |\n| 12 | Orik Stonebow | A dwarf with an easy smile and a love for archery. He's as deadly with a bow as he is with a crossbow, and always seems to be in the right place at the right time. |\n| 13 | Thokk Thunderbeard | A dwarf with a thick mane of dark hair and a booming voice that echoes off the mountains. He's not afraid to speak his mind, and is always looking for a good challenge. |\n| 14 | Rurik Ironforge | A dwarf with a long, flowing beard and a deep, rumbling laugh. He's always ready to share a meal or a drink with friends, and has a soft spot for animals of all kinds. |\n| 15 | Brynja Stonehand | A dwarf with a steely gaze and a no-nonsense attitude. She doesn't suffer fools gladly, and can be counted on to keep her word no matter the cost. |\n| 16 | Drogath Ironskin | A dwarf with a rugged, weathered face and skin like leather. He's seen more battles than most, and his scars tell the story of a long, storied life. |\n| 17 | Thorin Goldhammer | A dwarf with a sharp, angular face and a head full of golden hair. He's as sharp-tongued as he is sharp-witted, and isn't afraid to speak his mind. |\n| 18 | Amara Stonecall | A dwarf with a gentle smile and a voice like honey. She's a skilled healer, and takes joy in helping those in need. |\n| 19 | Hulda Ironheart | A dwarf with a broad, muscular build and a fierce determination. She's not one for idle chatter, and can be counted on to take action when others hesitate. |\n| 20 | Gorm Steelhammer | A dwarf with a thick, bushy beard and sparkling blue eyes. He's always ready for a good time, and is never far from a mug of ale. |\r\n## Tieflings\r\n| **Dice Value** | **Name** | **Description** |\n|-------|-------|-------|\n| 1 | Caius | Caius is a male tiefling with fiery red skin and long, curled horns. He wears a flowing black cape and carries a wand adorned with gems. |\n| 2 | Nemeia | Nemeia is a female tiefling with midnight blue skin and small, curved horns. She wears a simple linen tunic and carries a satchel of alchemical ingredients. |\n| 3 | Lucian | Lucian is a male tiefling with deep purple skin and large, straight horns. He wears ornate plate armor and wields a greatsword with a black blade. |\n| 4 | Elara | Elara is a female tiefling with silvery skin and short, curved horns. She wears a hooded cloak and carries a small crossbow. |\n| 5 | Faust | Faust is a male tiefling with pale white skin and two sets of horns, curled and straight. He wears a black vest and carries a collection of grimoires. |\n| 6 | Adrastea | Adrastea is a female tiefling with golden skin and long, curved horns. She wears a tight-fitting leather suit and carries a pair of daggers. |\n| 7 | Malphas | Malphas is a male tiefling with jet black skin and small, straight horns. He wears a long, flowing robe and carries a gnarled staff. |\n| 8 | Minerva | Minerva is a female tiefling with iridescent skin and short, curved horns. She wears a white silk gown and carries a slender rapier. |\n| 9 | Alastor | Alastor is a male tiefling with ashen gray skin and long, curled horns. He wears a suit of studded leather armor and carries a hand crossbow. |\n| 10 | Thalia | Thalia is a female tiefling with rose pink skin and small, straight horns. She wears a bright red tunic and carries a lute. |\n| 11 | Diabolus | Diabolus is a male tiefling with deep crimson skin and large, curved horns. He wears a black cloak and carries a glowing red orb. |\n| 12 | Nyx | Nyx is a female tiefling with obsidian black skin and short, straight horns. She wears form-fitting leather armor and carries a pair of twin short swords. |\n| 13 | Barakiel | Barakiel is a male tiefling with slate gray skin and large, curled horns. He wears heavy chainmail and carries a large morningstar. |\n| 14 | Kaida | Kaida is a female tiefling with brass-colored skin and small, curved horns. She wears a leather corset and carries a recurve bow. |\n| 15 | Belial | Belial is a male tiefling with deep burgundy skin and long, straight horns. He wears flowing robes and carries a book of forbidden knowledge. |\n| 16 | Sariel | Sariel is a female tiefling with pearl white skin and short, straight horns. She wears a silk gown and carries a scepter adorned with a glowing crystal. |\n| 17 | Aamon | Aamon is a male tiefling with pale blue-gray skin and large, curled horns. He wears a suit of scale mail and carries a greataxe. |\n| 18 | Yara | Yara is a female tiefling with emerald green skin and small, curved horns. She wears a fur cloak and carries a battleaxe. |\n| 19 | Vassago | Vassago is a male tiefling with olive green skin and long, straight horns. He wears a hooded robe and carries a thin, wickedly sharp dagger. |\n| 20 | Lilith | Lilith is a female tiefling with pure white skin and short, curved horns. She wears a flowing black gown and carries a silver-tipped staff. |\r\n## Half-Elves\r\n| Dice Value | Name | Description |\n| ---------- | ---- | ----------- |\n| 1 | Adriel | A charismatic bard who loves to tell tall tales and make people laugh. |\n| 2 | Elara | A reserved druid who is more comfortable in the company of animals than people. |\n| 3 | Lirien | A serious ranger who takes her job of protecting the forest very seriously. |\n| 4 | Riven | A carefree rogue who loves to live life on the edge and take risks. |\n| 5 | Arin | A studious wizard who is obsessed with learning and discovering new magic. |\n| 6 | Kaelen | A curious sorcerer who is always trying new spells and experimenting with magic. |\n| 7 | Niamh | An adventurous fighter who is always looking for a new challenge. |\n| 8 | Rowan | A quiet cleric who is dedicated to healing and helping those in need. |\n| 9 | Seren | A friendly paladin who is always trying to bring out the best in people. |\n| 10 | Theron | A wise monk who has spent years studying the art of combat and meditation. |\n| 11 | Althea | An ambitious bard who dreams of performing for royalty and becoming famous. |\n| 12 | Calantha | A fierce druid who will stop at nothing to protect her home and her people. |\n| 13 | Eirik | A mysterious ranger who keeps to himself and rarely speaks. |\n| 14 | Faolan | A charming rogue who has a way with words and knows how to get what he wants. |\n| 15 | Iridessa | An eccentric wizard who is always inventing new gadgets and gizmos. |\n| 16 | Kyran | A powerful sorcerer who is feared by many for his command of arcane magic. |\n| 17 | Meira | A tough fighter who has seen her fair share of battles and emerged victorious. |\n| 18 | Orion | A devout cleric who is dedicated to serving his god and spreading his message. |\n| 19 | Selene | A righteous paladin who seeks to bring justice to the world and protect the innocent. |\n| 20 | Tristan | An honorable monk who adheres to a strict code of ethics and principles. |\r\n## Orcs\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Goggar | A large and intimidating orc with scars covering his face. He wears the skull of a bear as a helmet. |\n| 2 | Grimgor | A muscular orc who specializes in hand-to-hand combat. He boasts about his strength and is eager for a brawl. |\n| 3 | Krag | A grizzled veteran of many battles, Krag has a missing eye and a mangled hand. He is often bitter and resentful, but is still a formidable fighter. |\n| 4 | Mogh | A wise shaman who serves as a spiritual leader for the orc tribe. Mogh is respected and feared for his powerful magic. |\n| 5 | Rognar | A quiet and reserved orc who prefers to stay out of conflict. Despite his gentle nature, he is a skilled hunter and can hold his own in a fight. |\n| 6 | Skarr | An orc berserker who charges into battle with reckless abandon. He never backs down from a fight and is known for his ferocity. |\n| 7 | Uzguk | A sly and cunning orc who is always looking for an angle to exploit. He is often involved in shady deals and backroom schemes. |\n| 8 | Grommash | A young and eager orc who is determined to prove himself in battle. He is reckless and impulsive, but his enthusiasm is infectious. |\n| 9 | Thag | A massive and imposing orc who serves as the tribe's chief. He is a natural leader who commands respect and loyalty from his followers. |\n| 10 | Drogath | A scarred and weather-beaten orc who has spent his life as a mercenary. He is a skilled fighter and is always on the lookout for his next job. |\n| 11 | Urguk | A brutish and aggressive orc who enjoys nothing more than smashing things with his huge mace. He is a destructive force on the battlefield. |\n| 12 | Zul'jin | A mysterious and enigmatic orc who keeps to himself. He always wears a hooded cloak and carries a curved sword at his side. |\n| 13 | Dakrog | A jovial and boisterous orc who loves to tell stories and sing songs. He is a talented musician and is often found entertaining his tribe around the campfire. |\n| 14 | Urzoth | A scarred and battle-hardened orc who has seen it all. He is a font of knowledge and is often consulted for his opinions on strategy and tactics. |\n| 15 | Garthok | A hulking and brutish orc who revels in his own strength. He is often seen lifting boulders or performing other feats of strength to impress his fellow orcs. |\n| 16 | Zogar | A crafty and resourceful orc who is always finding ways to bend the rules to his advantage. He is a skilled thief and a master of the art of deception. |\n| 17 | Grishnakh | A cunning and malicious orc who delights in causing pain and suffering. He is often involved in sadistic acts of torture and is feared by his own allies as well as his enemies. |\n| 18 | Mogor | A gruff and grizzled old warrior who has seen more battles than he can count. He is a mentor to younger orcs and is respected for his wisdom and experience. |\n| 19 | Drogathok | A towering and fearsome orc who wields a massive two-handed axe. He is a deadly warrior who strikes fear into the hearts of his enemies. |\n| 20 | Krakgar | A wild and unpredictable orc who is known for his erratic behavior. He is a loose cannon who can be either a valuable asset or a liability, depending on the situation. |\r\n## Half-Orcs\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Grommash | A gruff half-orc with scars criss-crossing his face and arms. His forearms are heavily muscled from years of wielding a battle-axe. |\n| 2 | Grimgor | This half-orc towers over most humans, standing over 6 feet tall. He has piercing green eyes that seem to watch everything around him and a booming voice that carries throughout any room. |\n| 3 | Korgoth | Korgoth is heavily armored and carries a giant warhammer. Despite his intimidating look, he has a soft spot for children and will often donate his gold to orphanages. |\n| 4 | Uzguk | This half-orc is covered in tribal tattoos and piercings. He speaks in a guttural language, and his movements are primal and animalistic. |\n| 5 | Drogathar | Drogathar is a seasoned adventurer, with a thick beard and wild hair. He carries a crossbow and has a keen eye for spotting traps and secret doors. |\n| 6 | Garok | Garok is a stoic half-orc, with a shaved head and neatly trimmed beard. He wears studded leather armor and carries a longsword, always ready for battle. |\n| 7 | Valk | Valk is a gentle giant of a half-orc, with a heart of gold. He has a strong sense of justice and will stop at nothing to protect the innocent. |\n| 8 | Graug | Graug is a fierce half-orc with a bad temper. He is quick to draw his greataxe and will often resort to violence to get what he wants. |\n| 9 | Drogath | Drogath is a well-spoken half-orc with a quick wit. He has a talent for negotiation and often works as a mediator between warring factions. |\n| 10 | Urzul | Urzul is a half-orc barbarian known for his love of ale and brawling. He is often seen in taverns, regaling anyone who will listen with tales of his exploits. |\n| 11 | Throgar | Throgar is a half-orc paladin of Torm. He wields a gleaming silver longsword and has a strong belief in justice and righteousness. |\n| 12 | Hruk | Hruk is a half-orc who has embraced his feral side. He often runs on all fours and has a savage fighting style. |\n| 13 | Skarr | Skarr is a half-orc rogue with a mischievous streak. He delights in pickpocketing and other stealthy activities. |\n| 14 | Grimgnash | Grimgnash is a half-orc ranger who has tamed a giant wolf as his companion. He is a skilled tracker and can navigate even the most treacherous terrain. |\n| 15 | Gruumsh | Gruumsh is a half-orc cleric of Gruumsh, the orcish god of war. He is a fierce warrior and often leads his followers into battle. |\n| 16 | Drog | Drog is a half-orc monk who has mastered the art of hand-to-hand combat. He moves with fluidity and grace, despite his brutish appearance. |\n| 17 | Borguk | Borguk is a half-orc wizard who has a passion for alchemy. He is often seen mixing various potions in his laboratory. |\n| 18 | Hrak | Hrak is a half-orc druid who is deeply connected to nature. He often takes the form of animals and can talk to plants. |\n| 19 | Snik | Snik is a half-orc bard with a beautiful singing voice. He is a bit of a ladies' man and loves to woo women with his music. |\n| 20 | Zog | Zog is a half-orc artificer who creates incredible mechanical inventions. He possesses a brilliant mind and is always tinkering with his latest invention. |\r\n## Halflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Pip | Short and plump, with curly brown hair and a twinkle in their eye. Loves to bake pies. |\n| 2          | Bree | Nimble and quick, with short blonde hair and a mischievous grin. Skilled at pickpocketing. |\n| 3          | Milo | Balding and slightly overweight, with a kind smile and a talent for storytelling. |\n| 4          | Lila | Petite and graceful, with long dark hair and a fierce spirit. Works as a scout for traveling caravans. |\n| 5          | Bram | A jolly fellow with a bushy beard and rosy cheeks. Owns a successful brewery. |\n| 6          | Tilda | Wiry and energetic, with a determined look and a talent for acrobatics. Adventurous and always up for a challenge. |\n| 7          | Finn | A rugged outdoorsman with shaggy brown hair and a love for hunting. Often seen with a loyal hunting dog at their side. |\n| 8          | Pippin | A mischievous troublemaker with a love for gambling and swindling. Always looking for the next big score. |\n| 9          | Rosie | Cheerful and hardworking, with a warm smile and a talent for cooking. Runs a popular restaurant in town. |\n| 10         | Bilbo | Wise and adventurous, with sparkling blue eyes and a love for collecting rare items. Retired from a life of adventure. |\n| 11         | Daisy | A carefree spirit with a love for music and dancing. Often seen playing a lute or flute in the town square. |\n| 12         | Milo | Polite and reserved, with a regal bearing. Works as a butler for a wealthy family. |\n| 13         | Gracie | Tough and scrappy, with a scar on their cheek and a no-nonsense attitude. Runs a successful tavern. |\n| 14         | Tom | Stout and gruff, with a wild shock of hair and a talent for blacksmithing. |\n| 15         | Marigold | Curious and adventurous, with big brown eyes and a love for exploring. Often found poking around abandoned ruins. |\n| 16         | Hal | A quiet and mysterious figure, with a dark past and a talent for subterfuge. |\n| 17         | Wilbur | Kind-hearted and generous, with a love for gardening and animals. Often volunteers at the local animal shelter. |\n| 18         | Daisy | A quirky inventor with a knack for creating unusual gadgets. Often seen tinkering in their workshop. |\n| 19         | Pete | A grizzled veteran with a scarred face and a love for battle. Often hired as a mercenary by wealthy patrons. |\n| 20         | Merry | Fun-loving and charismatic, with a contagious laugh and a talent for throwing lively parties.\r\n## Drow\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Ssivara | A slender and aloof drow with obsidian skin and piercing violet eyes. Prefers to communicate telepathically. |\n| 2 | Drizzt | A rare and noble drow with white hair and lavender eyes. A skilled warrior and loyal friend. |\n| 3 | Eclavdra | An ambitious and manipulative priestess of Lolth, with a reputation for treachery and cruelty. |\n| 4 | Zaknafein | A stoic and disciplined warrior with silver hair and piercing blue eyes. Known for his deadly acrobatics. |\n| 5 | Guenhwyvar | A fierce panther companion of Drizzt, bonded through magical means. Quick to attack any who threaten its master. |\n| 6 | Nalfein | A scholarly and introspective drow with a talent for illusions and a fascination with surface culture. |\n| 7 | Kelnozz | A cunning and ambitious sorcerer, with an eye for power and a talent for divination. |\n| 8 | Jarlaxle | A flamboyant and charismatic rogue, with a penchant for wearing fancy hats and using enchanted gadgets. |\n| 9 | Liriel | A carefree and adventurous drow, with a wild mane of curly hair and a love of music. Known for her mischievous pranks. |\n| 10 | Pharaun | A cynical and eccentric drow with a talent for crafting magical items. Often carries a golem shaped like a spider. |\n| 11 | Quenthel | A haughty and imperious priestess of Lolth, with a burning hatred for males. Prone to fits of sadistic pleasure. |\n| 12 | Rizzen | A vengeful and bitter male drow, with scars covering his body and an obsession with revenge against his kin. |\n| 13 | Solaufein | A gentle and compassionate drow, with a fiery mane of hair and a talent for healing magic. |\n| 14 | Triel | A secretive and enigmatic drow, with a talent for necromancy and an obsession with the undead. |\n| 15 | Uthegentel | A gluttonous and slothful drow, with a talent for transmutation and a distaste for physical activity. |\n| 16 | Viconia | A sultry and seductive drow, with a talent for enchantment magic and a history of slavery. |\n| 17 | Xull'rae | A hot-tempered and impulsive drow, with a talent for evocation magic and an affinity for fire. |\n| 18 | Yvonnel | A regal and dignified matron mother, with a talent for politics and a ruthless streak. |\n| 19 | Zinzerena | A capricious and playful drow, with a talent for illusion magic and a love of pranks and mischief. |\n| 20 | Faeryl | A mysterious and elegant drow, with silver hair and emerald eyes. Rumored to be a master of the rare art of shadow magic. |\r\n## Gnomes\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Zephyrwick Whistlewind | A young gnome with messy brown hair and curious amber eyes. He wears a tattered green cloak and carries a small wand. |\n| 2          | Fizzlebang Gearspinner | An elderly gnome with a long white beard and twinkling blue eyes. He wears a leather vest with various pockets and carries a small hammer. |\n| 3          | Pip Sprocketwhirl | A female gnome with curly red hair and bright green eyes. She wears a mechanical wristwatch and carries a small toolbox. |\n| 4          | Thimble Galvanic | A male gnome with short black hair and a thick mustache. He wears a pair of tinted goggles and carries a small lightning rod. |\n| 5          | Bixby Magentablaze | A young gnome with spiky blonde hair and mischievous blue eyes. He wears a red bandana and carries a small crossbow. |\n| 6          | Tuck Mithrilglint | An elderly gnome with a bald head and a long white beard. He wears a tattered brown cloak and carries a small spellbook. |\n| 7          | Twill Copperwhirl | A female gnome with short blonde hair and piercing green eyes. She wears a red scarf and carries a small backpack. |\n| 8          | Puddle Gearfinder | A male gnome with messy brown hair and a friendly smile. He wears a pair of round spectacles and carries a small telescope. |\n| 9          | Sparkle Blastfizzle | A young gnome with curly black hair and a mischievous grin. She wears a pair of sparkly earrings and carries a small bag of fireworks. |\n| 10         | Springleaf Fireflower | An elderly gnome with short gray hair and a kind smile. She wears a flowery wreath on her head and carries a small garden trowel. |\n| 11         | Buzzby Clockspring | A male gnome with short blonde hair and a serious expression. He wears a leather apron and carries a small pocketwatch. |\n| 12         | Skye Whirlfrost | A female gnome with wavy blue hair and icy blue eyes. She wears a silver necklace and carries a small wand. |\n| 13         | Copper Wireweaver | An elderly gnome with a neatly trimmed beard and a friendly demeanor. He wears a green bowtie and carries a small screwdriver. |\n| 14         | Tiptoe Greenflower | A young gnome with messy brown hair and a playful grin. She wears a pair of green boots with jingling bells and carries a small lute. |\n| 15         | Tack Snapwhistle | A male gnome with jet black hair and a serious expression. He wears a black cloak and carries a small dagger. |\n| 16         | Sassafras Steamspinner | A female gnome with curly purple hair and a mischievous twinkle in her eye. She wears a top hat with a feather and carries a small staff. |\n| 17         | Wizzle Flinthook | An elderly gnome with a bald head and a kind smile. He wears a pair of brass spectacles and carries a small fishing pole. |\n| 18         | Nettle Goldleaf | A young gnome with spiky blonde hair and shining green eyes. She wears a yellow scarf and carries a small pouch of gold coins. |\n| 19         | Hopper Ironwheel | A male gnome with short brown hair and keen brown eyes. He wears a pair of leather gloves and carries a small hammer. |\n| 20         | Snicker Doodlewhirl | A female gnome with wavy pink hair and a bubbly personality. She wears a pink dress and carries a small basket of treats. |\r\n## Genasi\r\n| Dice Value | Name           | Description                                                                                                                      |\n|------------|----------------|----------------------------------------------------------------------------------------------------------------------------------|\n| 1          | Asira          | She emanates an aura of smoke - her hair, her clothes, even her breath seem to be made of it. Her eyes are a deep burning red.       |\n| 2          | Calax          | His skin gleams like polished obsidian and the air around him smolders. His voice has an unsettlingly fiery quality to it.            |\n| 3          | Darya          | Her hair is a shifting mass of storm clouds and her eyes crackle with lightning. She seems to be lost in thought most of the time.    |\n| 4          | Fiero          | His skin is the color of molten lava and his hair seems to be made of flame. He exudes a constant wave of heat that is almost unbearable. |\n| 5          | Ione           | Her skin has an opalescent sheen and her eyes are a pale blue that seem to change depending on the light. She moves with an unearthly grace.|\n| 6          | Kaveh          | His hair is a mass of tangled vines and his skin is a rich earthy brown. His voice is deep and resonant, like the rumbling of stones. |\n| 7          | Luna           | Her skin shimmers like moonlit water and her hair is a silver-white that seems to move on its own. Her eyes are a pale, almost otherworldly blue. |\n| 8          | Neveah         | Her hair swirls and eddies like a blizzard and her skin is a pale, icy blue. Her voice is soft and musical, like the tinkling of icicles. |\n| 9          | Onyxia         | Her skin is like polished black marble and her hair is a tangled mess of dark, twisting vines. Her eyes are a piercing green. |\n| 10         | Pyro           | His skin flickers with a constant flame, and his hair is a wild, untamed mass of fire. His voice is booming and vibrant, like the roar of a bonfire. |\n| 11         | Roux           | His skin has the texture of fine-veined marble and his hair is a deep auburn that seems to be on fire. He carries himself with a regal bearing. |\n| 12         | Sable          | Her skin is a dark, smoky gray and her hair is a mass of writhing, shadowy tendrils. Her eyes are a piercing, almost hypnotic green. |\n| 13         | Tempest        | Her hair and dress whip and swirl around her as if she's caught in a maelstrom. Her eyes are a stormy gray and she seems to be carried by the winds. |\n| 14         | Uriel          | His skin is a pale gold and seems to glow with an inner light. His hair is a motionless white that seems almost too perfect. His voice is soft and distant. |\n| 15         | Vesper         | Her skin is a deep, rich blue that seems to glow in dark places. Her hair is a mass of waving kelp that moves as if underwater. Her eyes are a luminescent green. |\n| 16         | Xenia          | Her skin is a shimmering pearl white and her hair is a riot of multicolored, luminous streaks. Her voice is soft and lilting, like the fluttering of butterfly wings. |\n| 17         | Yara           | Her hair is a wild, tangled mass of vegetation that seems to be growing even as you watch. Her skin is a pale green, like the underside of leaves. |\n| 18         | Zephyr         | Her hair is a fine, ethereal mist that seems to follow her movements. Her skin is an almost imperceptible pale blue that seems to blend into the sky. |\n| 19         | Erebos         | His skin has a deep, velvety blackness that sucks in the light. His hair is like black silk that seems to pulse in time with his breaths. His voice is low and measured.  |\n| 20         | Hestia         | Her hair is a mass of flickering flames that dance and sway around her face. Her skin is aglow with the warmth of a hearth. Her eyes are a comforting shade of red. |\r\n## Aarakocra\r\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:--------:|:---------------:|\n|       1        |   Aera   | This Aarakocra has feathers of golden brown and is always eager to help travelers with her keen eyesight. |\n|       2        |   Vala   | A graceful Aarakocra with dark feathers, Vala can often be found soaring through the skies, lost deep in thought. |\n|       3        |  Vorel   | Vorel is an elder of his tribe with silver-white feathers and has many tales to tell of the ancient ways of the Aarakocra. |\n|       4        |  Skava   | This Aarakocra has vibrant green feathers and is renowned for her skill at hunting. She offers training to those in need. |\n|       5        |  Zarni   | Zarni is a stoic Aarakocra with deep blue feathers, who is dedicated to the worship of the deity of the winds. |\n|       6        |  Xanthe  | Xanthe is a young Aarakocra with feathers of dusky pink, who is still learning the ways of her tribe. |\n|       7        |  Arin   | Arin is a proud and headstrong Aarakocra with stark white feathers who values the traditions of his tribe above all else. |\n|       8        |  Adara   | Adara is a skilled healer among her tribe, with feathers in varying shades of brown. |\n|       9        |  Naron   | Naron is a solitary Aarakocra, with feathers of deep purple. He is known to guide lost travelers through the mountains. |\n|       10       |   Keen   | Keen has feathers in shades of amber and is renowned for her sharp vision and attention to detail. |\n|       11       |  Kava   | A fierce warrior with feathers in shades of red, Kava is a natural born leader among his peers. |\n|       12       |  Cyne   | A curious and adventurous Aarakocra with feathers in varying shades of gray, Cyne is always eager for new experiences. |\n|       13       |  Fela   | Fela has feathers in shades of green and brown. She's a skilled woodworker and often makes beautiful carvings. |\n|       14       |  Quinn  | Quinn is a wise elder with feathers in shades of brown and gray. He is deeply respected among his tribe. |\n|       15       |  Lirien | This Aarakocra has bright feathers in shades of orange and yellow. She is known for her quick wit and cleverness. |\n|       16       |  Tova   | Tova is a solitary Aarakocra with feathers in shades of blue and silver. She guards the entrance to a sacred mountain shrine. |\n|       17       |  Gwenn  | Gwenn has vibrant feathers in shades of pink and purple. Her bubbly personality brings joy to everyone around her. |\n|       18       |  Kael   | Kael is a silent and brooding Aarakocra with feathers in shades of black and midnight blue. His temper is fierce, but his loyalty is unwavering. |\n|       19       |  Elin   | Elin is a gentle and nurturing Aarakocra with light brown feathers, who is often sought after for her wise counsel. |\n|       20       |  Yara   | Yara is an adventurous and carefree Aarakocra with feathers in shades of turquoise and green. She loves to explore and discover new things. |\r\n## Kobold\r\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:--------:|:---------------:|\n|       1        |  Snikch  | A small and wiry kobold with beady yellow eyes and a cunning smile. Always up to no good. |\n|       2        |  Skrit   | A timid kobold with mottled grey-brown scales. Always speaks in a low whisper. |\n|       3        |  Zikzik  | A young and inexperienced kobold eager to prove themselves. Often oversells their abilities. |\n|       4        |  Soot    | A highly skilled engineer and trap-maker. Covered head to toe in black soot. |\n|       5        |  Gristle | A muscular and brutish kobold covered in scars from battles. Gruff and direct. |\n|       6        |  Zzzax   | A kobold who has become obsessed with an ancient artifact. Will stop at nothing to find it. |\n|       7        |  Sparky  | A kobold with a love for tinkering. Always surrounded by a pile of gadgets and gizmos. |\n|       8        |  Glimmer | A kobold sorcerer with an affinity for illusion magic. Often plays pranks on their allies. |\n|       9        |  Scraps  | A scrawny kobold with matted fur and a patchwork cloak. Often seen scavenging for scraps of food. |\n|       10       |  Rags    | A kobold who has fallen on hard times. Once a successful merchant, now reduced to selling trinkets on the street. |\n|       11       |  Topsy   | A hyperactive and excitable kobold with a high-pitched voice. Loves to dance and sing. |\n|       12       |  Gnash   | A kobold warrior with razor-sharp teeth and a wickedly curved blade. Quick to anger and always ready for a fight. |\n|       13       |  Hiss    | A sneaky and conniving kobold assassin. Prefers to strike from the shadows and always has a plan. |\n|       14       |  Flicker | A kobold who has mastered the art of fire magic. Often creates elaborate displays of flame and smoke. |\n|       15       |  Pebble  | A kobold miner with a nose for precious gems and metals. Can spot valuable veins from miles away. |\n|       16       |  Croak   | A kobold who has taken a liking to frogs. Carries a small menagerie of amphibians with them. |\n|       17       |  Gloom   | A kobold rogue with a penchant for stealing. Often found lurking in the shadows. |\n|       18       |  Grime   | A filthy kobold who doesn't seem to care about their personal hygiene. Strong and pungent. |\n|       19       |  Slinky  | A sleek and agile kobold thief. Has a reputation for slipping past even the tightest security. |\n|       20       |  Crackle | A kobold who has experimented with lightning magic. Often accompanied by the smell of ozone. |\r\n## Bugbear\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Grimgnaw | This brutish bugbear towers over most creatures, with its shaggy fur and rippling muscles. Its red eyes glare out from beneath low-slung brows. |\n| 2          | Vorguk | A narrow face with an aggressive snout, Vorguk has matted brown fur and thin, sharp claws. A fur cloak embroidered with gold clings to its broad shoulders. |\n| 3          | Snaggletooth | This bugbear's bared teeth give it a savage and deadly appearance. Thin scars crisscross its nose and cheekbones, and its stringy hair frames a cruel face. |\n| 4          | Krogar | A towering, broad-shouldered bugbear with tufts of wiry fur on its forearms. Its eyes blaze with ferocity and its bellowing roar strikes fear into the hearts of enemies. |\n| 5          | Uggrath | This stocky bugbear's eyes gleam with greed and malice. It wears a blackened breastplate, making it appear even more menacing. |\n| 6          | Snarl | Snarl the bugbear has wickedly serrated teeth and a snarling disposition. Its mottled fur stands on end for intimidation purposes. |\n| 7          | Gruumsh | Gruumsh's thick, shaggy mane hangs low over its forehead, partially obscuring its small, glowing eyes. Its hooked claws and massive arms hint at a terrifying strength. |\n| 8          | Thunk | Thunk's eyes are a sickly yellow, and its face is pockmarked from past fights. A scarred bald patch on its back suggests a rough past. |\n| 9          | Grosh | This burly bugbear's bulging muscles are highlighted by its tight-fitting leather armor. Thick fur protrudes from gaps where the armor doesn't cover. |\n| 10         | Slogg | Slogg has a beady-eyed stare and a jagged scar running down its left cheek. Its breath is heavy with the scent of rotted meat. |\n| 11         | Ruk-Gar | A vicious-looking bugbear, Ruk-Gar's eyes are bloodshot and its fangs jut out menacingly. Its fur is matted and unkempt, suggesting it has not slept in some time. |\n| 12         | Gorgoth | This towering brute of a bugbear has a thick neck and powerful arms. An intricate pattern is cut into the fur on its chest and translates to strength and bravery. |\n| 13         | Snort | Snort's hair is coarse and wiry, covering most of its muscular body. The ends of its ears are gnawed away from past battles. |\n| 14         | Vroth | This bugbear has a loping gait and a mottled fur cloak that matches its green eyes. Its laugh is both maniacal and menacing. |\n| 15         | Krag | Krag's maw is filled with pointed teeth, and its hands curl into sharp claws. Thick cords of muscle vibrate beneath its matted fur coat. |\n| 16         | Dorg | A smaller than average bugbear, Dorg's eyes are almost cute until one realizes the gleam of hunger shimmers from within them. Its scent is pale lavender from the herbal remedies it uses to clean itself. |\n| 17         | Ruug'la | Female by nature rather than brute force, Ruug'la's thick short hair is braided into intricate dreadlocks. She wears a shining medallion around her neck. |\n| 18         | Gnarl | Gnarl looks woefully undernourished compared to other bugbears. It seems to achieve its notorious reputation through cunning and a clever wit. |\n| 19         | Ugg | Ugg is a quiet bugbear that rests during most activity. In a fight, however, its speed is renowned and often misunderstood as laziness. |\n| 20         | Farg | Farg's fur is matted and knotted, except where it is singed from past battles. Its hands are calloused from making jewelry and other trinkets as a hobby. |\r\n## Hobgoblin\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Gruumshak | A towering hulk of a hobgoblin covered in scars and wielding a vicious two-handed axe. His left eye is missing, replaced with an unsettling red glow. |\n| 2          | Zorathak  | A wiry hobgoblin with quick hands and an even quicker wit. He wears a patchwork cloak made from the pelts of various beasts he's hunted. |\n| 3          | Korgul    | A hobgoblin with a booming laugh and a love of strong drink. He also has a talent for composing bawdy tavern songs. |\n| 4          | Snaga     | An imposing hobgoblin who prefers to let his strength do the talking. His muscular frame is covered in intricate tattoos depicting scenes of battle. |\n| 5          | Draazak   | A hobgoblin with a keen mind for strategy. He's often found poring over maps and contemplating military maneuvers. |\n| 6          | Grommok   | A hobgoblin blacksmith who takes great pride in his craft. He's known for his ability to forge blades that are both beautiful and deadly. |\n| 7          | Vrask     | A hobgoblin trader who specializes in rare and exotic goods. He's always looking for new treasures to add to his collection. |\n| 8          | Thokk     | A hobgoblin enforcer who works for the local crime boss. He's feared by many and known for his ruthless efficiency. |\n| 9          | Grimgor   | A hobgoblin thief who's made a name for himself as one of the best in the business. He's a master of disguise and sneaking around undetected. |\n| 10         | Khazgul   | A hobgoblin shaman who's rumored to be able to commune with spirits and wield powerful magic. He's also known for his unsettling cackle. |\n| 11         | Urzog     | A hobgoblin bard who uses his music to spread joy and merriment. He's also a skilled storyteller and knows a tale for every occasion. |\n| 12         | Nazgul    | A hobgoblin assassin who's assassin's guild has been hired by the local noble to eliminate his enemies. She's known for her silent and deadly approach. |\n| 13         | Moghar    | A hobgoblin ranger who's at home in the wilderness. He's a skilled tracker and hunter, and is willing to share his knowledge for a price. |\n| 14         | Glok      | A hobgoblin gladiator who fights in the local arena for the entertainment of the masses. He's a fierce combatant whose name strikes fear into the hearts of his opponents. |\n| 15         | Krugg     | A hobgoblin sailor who's sailed the seas far and wide. He's also an expert in navigation and can chart a course through even the most treacherous waters. |\n| 16         | Jarn      | A hobgoblin engineer who spends his days tinkering with machines and gadgets. He's always working on some new invention and is known for his eccentricity. |\n| 17         | Bargul    | A hobgoblin politician who's risen to power through cunning and manipulation. He's a master of intrigue and is always looking for ways to gain an advantage. |\n| 18         | Zogath    | A hobgoblin scholar who's dedicated his life to the study of ancient tomes and forgotten lore. He's often found in dusty libraries pouring over arcane texts. |\n| 19         | Hrogath   | A hobgoblin chef who's renowned for his exotic dishes and unusual ingredients. He's always looking for new flavors to experiment with. |\n| 20         | Drog      | A hobgoblin adventurer who's traveled the world in search of fame and fortune. He's a seasoned veteran and has tales of daring escapes and impossible victories. |\r\n## Changeling\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Aria | An elusive changeling who prefers to hide in the shadows and observe before taking action. She has long, slender fingers and striking green eyes. |\n| 2          | Dorian | A confident changeling who enjoys playing mind games with those around him. He has a charming smile and always seems to be in control of the situation.|\n| 3          | Fallon | A mischievous changeling who loves to pull pranks on others. She has a heart-shaped face and curly red hair that often changes color depending on her mood. |\n| 4          | Galen | A reserved changeling who is more comfortable in his natural form than in his assumed form. He has a quiet demeanor and piercing blue eyes. |\n| 5          | Harper | A passionate changeling who wears his emotions on his sleeve. He has a broad smile and a deep, rich voice that can be heard from across the room. |\n| 6          | Jules | A kind-hearted changeling who always thinks of others before herself. She has a gentle touch and a warm smile that lights up a room. |\n| 7          | Kael | A fierce changeling who is always ready for a fight. He has a muscular build and sharp features that make him intimidating to others. |\n| 8          | Lirien | A carefree changeling who loves to dance and sing. She has a light, airy voice and a graceful, fluid movements. |\n| 9          | Niamh | A curious changeling who is always seeking out new experiences. She has a childlike wonder about the world and loves to learn new things. |\n| 10         | Riven | A melancholy changeling who struggles to find his place in the world. He has a brooding demeanor and tends to keep to himself. |\n| 11         | Sariel | A enigmatic changeling who always seems to have a hidden agenda. She has a mysterious air about her and is almost impossible to read. |\n| 12         | Thorne | A stubborn changeling who never backs down from a challenge. He has a rugged appearance and a fierce determination that is both admirable and intimidating. |\n| 13         | Ulric | A dedicated changeling who is fiercely loyal to his friends. He has a stoic demeanor and a quiet strength that others find comforting. |\n| 14         | Varian | A charismatic changeling who knows how to work a crowd. He has a commanding presence and a way with words that can persuade even the most skeptical of audiences. |\n| 15         | Wren | A flighty changeling who has trouble sitting still. She has a bubbly personality and a contagious laugh that always lifts the spirits of those around her. |\n| 16         | Xander | A calculating changeling who always has a plan. He has a sharp mind and a keen eye for detail that make him an excellent strategist. |\n| 17         | Yael | A resilient changeling who has overcome many obstacles in her life. She has a determined spirit and a fierce independence that make her a natural leader. |\n| 18         | Zephyr | A free-spirited changeling who loves to travel and explore new places. He has a wandering soul and a thirst for adventure that is almost impossible to quench. |\n| 19         | Apollo | A creative changeling who loves to express himself through art. He has a vivid imagination and a flair for the dramatic that make him a captivating storyteller. |\n| 20         | Ember | A fiery changeling who is quick to anger but just as quick to forgive. She has a passionate soul and a fierce loyalty to her friends and family. |\r\n## Aasimar\r\n| Dice Value | Name         | Description                                                                         |\n|------------|--------------|-------------------------------------------------------------------------------------|\n| 1          | Lirien       | An Aasimar with bright, silver wings and a serene smile.                            |\n| 2          | Remiel       | A tall, imposing figure with piercing blue eyes and a commanding presence.          |\n| 3          | Sariel       | A benevolent healer, always ready to lend aid to those in need.                     |\n| 4          | Zadkiel      | Radiating warmth, this Aasimar is a beacon of hope even in the darkest of times.     |\n| 5          | Uriel        | Calm and collected in all situations, Uriel exudes an air of quiet confidence.      |\n| 6          | Raziel       | With piercing, unearthly eyes, Raziel seems to know all secrets and all truths.     |\n| 7          | Ariel        | Soft-spoken and gentle, Ariel's kind heart is evident in all that they do.           |\n| 8          | Cassiel      | Mysterious and enigmatic, Cassiel's motives are often difficult to discern.         |\n| 9          | Gavriel      | A fierce warrior, Gavriel is fearless in battle and fiercely loyal to their allies.  |\n| 10         | Tzadkiel     | Flamboyant and charismatic, Tzadkiel loves to be the center of attention.            |\n| 11         | Iathiel      | A skilled diplomat, Iathiel is often called upon to negotiate in times of crisis.   |\n| 12         | Jophiel      | A fiery personality, Jophiel is always ready to confront injustice head-on.         |\n| 13         | Lumiel       | With an infectious laugh and a mischievous grin, Lumiel brings joy to all around.   |\n| 14         | Metatron     | Known for their deep wisdom and unfailing judgment, Metatron is a force to be reckoned with.|\n| 15         | Nuriel       | With a keen mind and quick wit, Nuriel is the brains of any operation.              |\n| 16         | Puriel       | Unpredictable and prone to wild mood swings, Puriel keeps everyone on their toes.    |\n| 17         | Raziel       | Somewhat aloof and detached, Raziel prefers to observe and analyze rather than act.  |\n| 18         | Sachiel      | A born leader, Sachiel inspires respect and loyalty in all those around them.       |\n| 19         | Uzziel       | With a fierce temper and a stubborn streak, Uzziel can be difficult to work with.    |\n| 20         | Zophiel      | A free spirit, Zophiel is always seeking new experiences and adventures.            |\r\n## Human\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Aldric | A tall, broad-shouldered man with a thick beard and piercing blue eyes. Aldric carries himself with an air of confidence, his armor gleaming in the sunlight. |\n| 2 | Bridget | A young woman with long, curly hair and bright green eyes. Bridget is a skilled archer, and her aim is second to none. She wears a cloak made of bear fur, which she uses to keep warm on cold nights. |\n| 3 | Cedric | A grizzled veteran with scars crisscrossing his face and hands calloused from years of swordplay. Cedric has seen it all, and he's not afraid to get his hands dirty. |\n| 4 | Dara | A shy, soft-spoken woman with a gentle smile and a kind heart. Dara is a healer, and she spends most of her time tending to the wounded and sick. |\n| 5 | Elias | A flamboyant man with a flair for the dramatic. Elias is a bard, and he loves nothing more than entertaining a crowd with his music and poetry. |\n| 6 | Flynn | A rugged man with a thick beard and chiseled features. Flynn is a skilled blacksmith, and his weapons and armor are highly sought after by adventurers. |\n| 7 | Gwendolyn | A regal woman with silver hair and piercing blue eyes. Gwendolyn is a powerful wizard, and her magic is feared by many. |\n| 8 | Harper | A bookish man with a pair of wire-rimmed glasses perched on his nose. Harper is a sage, and he spends his days pouring over ancient tomes in search of lost knowledge. |\n| 9 | Isadora | An enigmatic woman with dark hair and an even darker past. Isadora is a rogue, and her skills at skullduggery make her a valuable ally - or a formidable foe. |\n| 10 | Jeremiah | A jovial man with a hearty laugh and a round belly. Jeremiah is a tavern keeper, and his establishment is known throughout the land for its warm atmosphere and fine ale. |\n| 11 | Kael | A brooding man who prefers to keep to himself. Kael is a ranger, and his skills at tracking and survival are unmatched. |\n| 12 | Lysandra | A fierce woman with a quick temper. Lysandra is a fighter, and her skill with a sword is legendary. |\n| 13 | Marcus | A stern, no-nonsense man with a shaved head and piercing brown eyes. Marcus is a paladin, and he has dedicated his life to defending the innocent. |\n| 14 | Nadia | A cunning woman with a sly smile and a mysterious past. Nadia is a warlock, and her pact with a powerful entity gives her access to dark and dangerous magic. |\n| 15 | Orin | A burly man with a thick beard and arms like tree trunks. Orin is a dwarf, and his skills at mining and metalworking are unparalleled. |\n| 16 | Penelope | A bubbly, outgoing woman with a heart of gold. Penelope is a cleric, and her faith in her deity gives her the strength to heal the sick and smite the wicked. |\n| 17 | Quincy | An eccentric man with wild hair and a perpetually distracted expression. Quincy is a wizard, and his experiments with magic often have...unexpected results. |\n| 18 | Rian | A dashing man with a rakish grin and a twinkle in his eye. Rian is a rogue, and his skills at charm and deceit are matched only by his skill with a blade. |\n| 19 | Selena | An ethereal woman with pale skin and silver hair. Selena is a sorceress, and her innate magical abilities are a constant source of wonder and terror. |\n| 20 | Tomas | A stoic man with a scarred face and quick reflexes. Tomas is a monk, and his mastery of martial arts allows him to strike with devastating speed and precision. |\r\n## Goliath\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Hruk'kal | A towering goliath with rippling muscles and a thick beard. He carries a giant maul and wears a necklace of bear teeth. |\n| 2          | Rokara | A wise and weathered goliath who speaks in riddles. She wears a cloak made of owl feathers and carries a staff adorned with small bones. |\n| 3          | Thorgath | A boisterous and jovial goliath who is always up for a drinking contest. He wears a brightly colored kilt and has a tattoo of a mountain on his bicep. |\n| 4          | Kethar | A reclusive goliath who spends most of his time communing with nature. He wears a cloak made of fox fur and speaks softly but with authority. |\n| 5          | Grommash | A grizzled veteran of many battles, Grommash is missing an eye and has scars covering his arms and face. He wields a giant battleaxe and wears a helmet adorned with ram horns. |\n| 6          | Ulfgar | A gregarious and outgoing goliath who loves to tell stories and sing songs. He wears a vest made of bear hide and carries a lute at his side. |\n| 7          | Grimgnash | A fearsome goliath warrior who is quick to anger. He wears a suit of scale mail and wields a pair of battle axes. |\n| 8          | Erikk | A solitary goliath who is rarely seen in town. He wears a hooded cloak and carries a bow and quiver. |\n| 9          | Vorgath | A crafty and cunning goliath who is always looking out for his own interests. He wears a necklace of dragon teeth and carries a spiked mace. |\n| 10         | Yaruk | A stoic and reserved goliath who rarely speaks. He wears a suit of chain mail and carries a tower shield and a longsword. |\n| 11         | Kragh | A jolly and rotund goliath who loves to cook and eat. He wears a stained chef's apron and carries a ladle and a meat cleaver. |\n| 12         | Drogath | A pious and devout goliath who follows a strict code of honor. He wears a holy symbol around his neck and carries a mace. |\n| 13         | Brorin | A jovial and boisterous goliath who loves to drink and brawl. He wears a chain shirt and carries a pair of brass knuckles. |\n| 14         | Orgoch | A gruff and surly goliath who is always spoiling for a fight. He wears a suit of studded leather and carries a heavy club. |\n| 15         | Kethar | A reclusive goliath who spends most of his time communing with nature. He wears a cloak made of fox fur and speaks softly but with authority. |\n| 16         | Garg | A brash and impulsive goliath who rushes headlong into danger. He wears a suit of scale mail and carries a warhammer. |\n| 17         | Hrothgar | A wise and patient goliath who is a skilled healer. He wears a white cloak and carries a bag of medicinal herbs. |\n| 18         | Vorgoth | A quiet and reserved goliath who is a natural diplomat. He wears a suit of chain mail and carries a short sword. |\n| 19         | Ongrum | A powerful and imposing goliath who is a formidable foe in battle. He wears a suit of plate mail and carries a giant greatsword. |\n| 20         | Gruumsh | A mysterious and enigmatic goliath who is said to have supernatural powers. He wears a cloak made of raven feathers and carries a staff adorned with glowing crystals. |\r\n## Goblin\r\n| **d20** | **Name** | **Description** |\n| --- | --- | --- |\n| 1 | Klik | A short and stocky goblin with a prominent underbite and a constantly sneering expression. |\n| 2 | Grik | A lanky goblin with wild, wiry hair and darting, shifty eyes. |\n| 3 | Smirk | An opportunistic goblin with a twisted grin and a talent for skulking around unnoticed. |\n| 4 | Snik | A sly goblin with a rasping laugh and a love for shiny trinkets and stolen coin. |\n| 5 | Griggle | A goblin with a crooked nose and a high-pitched cackle that's both unsettling and infectious. |\n| 6 | Nix | A goblin with a perpetually runny nose and a knack for sneaking about in the shadows. |\n| 7 | Zib | A scrappy goblin with a scar across one cheek and a penchant for picking fights with those bigger than himself. |\n| 8 | Quil | A goblin with a nasty disposition and a suspicious, baleful stare that makes most people uneasy. |\n| 9 | Dregg | A goblin who walks with a pronounced limp and mutters to himself in an unsettling manner. |\n| 10 | Snarl | A brutish goblin with an intimidating scowl and a love for all things violent. |\n| 11 | Fizzle | A goblin with tufty green hair and wide, darting eyes, who's always looking to strike a bargain. |\n| 12 | Grog | A goblin with thick veins running across his forehead and a powerful build. He has a tendency to charge into battle without thinking. |\n| 13 | Razzle | A goblin with a manic, toothy grin and a habit of cackling when things go his way. |\n| 14 | Skree | A wiry goblin with a toothpick physique and a talent for slipping out of tight spaces. |\n| 15 | Zazz | A goblin with a mischievous gleam in his eye and a penchant for practical jokes. |\n| 16 | Grozzle | A goblin with wild, frizzy hair, a pointed chin, and a talent for tinkering with devices that probably shouldn't work. |\n| 17 | Shlink | A goblin with a slimy smile and a propensity for slithering instead of walking. |\n| 18 | Splinter | A goblin with a droopy face and a disheveled appearance, who has a skill for sowing discord in groups of people. |\n| 19 | Blarg | A hulking goblin with an unintelligent look on his face and a love of smashing things. |\n| 20 | Snicker | An unsettling goblin with a penchant for sweet-talking his way out of trouble, even when it seems impossible. |\r\n## Duergar\r\n| Dice Value | Name | Description                                                                          |\n|------------|------|--------------------------------------------------------------------------------------|\n| 1          | Gruumsh | This gruff Duergar is missing an eye, and his remaining eye constantly looks angry. |\n| 2          | Drukket | A stout Duergar with a love of ale and a booming laugh.                              |\n| 3          | Hargrim | A quiet Duergar who prefers to listen before speaking.                               |\n| 4          | Kethra | A Duergar with piercing blue eyes and a penchant for gemstones.                      |\n| 5          | Bandrur | A lanky Duergar with a sarcastic sense of humor.                                    |\n| 6          | Thalkor | This elderly Duergar is covered in scars and has a gruff demeanor.                  |\n| 7          | Drakka | A Duergar with a booming voice and a love of battle.                                |\n| 8          | Orinath | This Duergar is a skilled blacksmith and takes pride in their work.                  |\n| 9          | Rolda | A Duergar with a quick wit and a talent for negotiation.                            |\n| 10         | Gethra | A kind-hearted Duergar who enjoys baking and gardening in their free time.          |\n| 11         | Brondar | This Duergar is fiercely loyal to their clan and always puts their needs first.     |\n| 12         | Thordak | A Duergar with a love of music and a beautiful singing voice.                       |\n| 13         | Nalda | This Duergar has a keen mind and excels at solving puzzles and riddles.             |\n| 14         | Hurrak | A boisterous Duergar who loves to tell tall tales and entertain others.             |\n| 15         | Morin | A disciplined Duergar with a strong sense of justice.                              |\n| 16         | Raetha | This Duergar is a skilled hunter and tracker, and can often be found in the wild.   |\n| 17         | Thrym | A stoic Duergar with a love of history and a deep knowledge of ancient civilizations.|\n| 18         | Karduk | This Duergar is a skilled miner and has a wealth of knowledge about underground tunnels and caves. |\n| 19         | Vruna | A charismatic Duergar with a talent for persuasion and leadership.                 |\n| 20         | Bofri | This Duergar is a skilled herbalist and healer, using their knowledge of plants to aid the sick and injured. |\r\n## Dragon\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Argentum | A platinum-scaled dragon with eyes that shine like diamonds. Known for being aloof and proud. |\n| 2 | Nidhogg | A black dragon with razor sharp claws and a poisonous breath. Often found lurking in the depths of swamps and marshes. |\n| 3 | Rillifane | A green dragon with iridescent scales, known for its cunning and trickery. Often uses illusions to deceive its prey. |\n| 4 | Zalathormaeus | A dragon with shimmering scales of sapphire blue. Known for its wisdom and love of magical artifacts. |\n| 5 | Pyraxion | A fiery red dragon with scales that glow with embers. Known for its destructive tendencies and love of treasures. |\n| 6 | Aurum | A golden dragon, with a majestic presence and a heart of valor. Often revered as a protector by those in need. |\n| 7 | Balthazarr | A dragon with mottled scales, bearing scars from battles fought long ago. Known for its fiercely protective nature. |\n| 8 | Xaxalexis | A dragon with hypnotic scales of amethyst purple. Known for its gift of foresight and its cryptic ways. |\n| 9 | Imryx | A dragon with deep blue scales and an insatiable curiosity. Often found studying arcane lore and ancient history. |\n| 10 | Alzrius | A dragon with scales as black as night, and eyes that seem to glow with ghostly light. Known for its mysterious and otherworldly nature. |\n| 11 | Sylphrena | A dragon with shimmering opal scales and an almost ethereal presence. Often revered as a guardian of natural wonders and beauty. |\n| 12 | Grimgoroth | A dragon with scales as red as blood, known for its ferocity in battle and its relentless pursuit of foes. |\n| 13 | Valtariel | A dragon with brilliant white scales, known for its purity of spirit and its healing breath. Often revered as a harbinger of hope and new beginnings. |\n| 14 | Midriffaer | A black dragon with a voice like gravel, and a love for dark magic and forbidden lore. |\n| 15 | Myxalor | A dragon with scales that shift colors in the light, known for its love of riddles and penchant for tricking those who seek its wisdom. |\n| 16 | Fenrisulfr | A dragon with scales that resemble fur, known for its strength and ferocity as a hunter. |\n| 17 | Talonfang | A dragon with razor sharp talons and a hulking mass, known for its brute force and savage attacks. |\n| 18 | Celandine | A dragon with shimmering green scales and a sweet disposition, loved by all who meet her. |\n| 19 | Rivenwind | A dragon with scales that flutter in the wind like feathers, known for its elusiveness and speed in flight. |\n| 20 | Thallorin | A dragon with scales as blue as the ocean, known for its vast knowledge of the world and its secrets. Often sought out for counsel and advice. |\r\n## Dragonborn\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Balasar | A particularly tall and imposing Dragonborn, with dark red scales and a missing left horn. |\n| 2          | Morix | A young Dragonborn with bright orange scales and a chipped tooth. He carries a small wooden figurine he carves in his spare time. |\n| 3          | Korrith | A grizzled veteran of innumerable campaigns, with metallic scales and a wary, downturned gaze. |\n| 4          | Vorgath | An unconventional Dragonborn that can often be found in the company of halflings. He is prone to humor and pranks. |\n| 5          | Zirpola | A sage-like Dragonborn, with a long white beard and scales that fade from grey to black. His armor is etched with countless inscriptions and glyphs. |\n| 6          | Nelthiss | A young Dragonborn with shimmering teal scales and a wide, toothy grin. She wields a pair of daggers, and always keeps one eye on the horizon. |\n| 7          | Thherissk | A Dragonborn thief and rogue, with wiry muscles and bright green scales. If there's something to be stolen, he's the one to do it. |\n| 8          | Jaxxik | A stern and humorless Dragonborn, with black scales and glowing yellow eyes. He is a paladin, on a quest for vengeance against the undead. |\n| 9          | Verrick | A Dragonborn of average height and build, with deep blue scales and a distinctive necklace made of teeth from his fallen enemies. |\n| 10         | Riktorian | A charming and roguish Dragonborn, with coppery scales and a penchant for card games and gambling. |\n| 11         | Throgonis | A battle-scarred Dragonborn, with tough, ashen scales and a rasping voice. He is a mercenary for hire, with a heart of gold. |\n| 12         | Kiriin | A boisterous Dragonborn bard, with scales that shift from vibrant purple to crimson depending on his mood. He always has a lute on hand, and loves to tell tales of legend and lore. |\n| 13         | Griel | A scholarly Dragonborn wizard, with deep green scales and a love of experimentation. He is often found in his tower laboratory, working on his latest arcane theories. |\n| 14         | Yrirkas | A Dragonborn of few words, with scales that shimmer like molten gold. He is a skilled blacksmith, and his weapons and armor are much sought-after. |\n| 15         | Hallioth | A Dragonborn ranger, with mottled brown and green scales perfect for blending in with nature. She is accompanied by her faithful hawk, who always perches on her shoulder. |\n| 16         | Drogathar | A Dragonborn with bright, almost luminescent violet scales and piercing purple eyes. He is a powerful sorcerer, but often overestimates his own abilities. |\n| 17         | Sorrondor | A Dragonborn captain in the city guard, with armor that gleams and scales as black as pitch. He is tough but fair, with a soft spot for those in need. |\n| 18         | Tensaar | A Dragonborn cleric, with bronze scales and a warm, comforting presence. He is often found in the local temple, healing the sick and injured. |\n| 19         | Krithyen | A Dragonborn scholar and historian, with scales that fade from lavender to silver. He is always searching for lost relics and ancient artifacts. |\n| 20         | Zillara | A Dragonborn spy and assassin, with scales that shift from deep purple to midnight blue. She can blend into any crowd, and is always one step ahead of her targets. |\r\n## Lizardfolk\r\n# NPC Names and Descriptions - Lizardfolk\n\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:---------:|:----------------|\n| 1              | Grr'ath   | A burly and battle-scarred warrior, with his scales mottled and darkened by combat. He speaks little, and when he does, it is with a low, growling voice. |\n| 2              | Sess'tris | A smaller and more agile lizardfolk, with bright green scales and a cheerful demeanor. She delights in trickery and practical jokes, and always seems to be smiling. |\n| 3              | K'shara  | A stern and imposing figure, K'shara holds herself with a regal bearing and speaks with great authority. Her scales are an iridescent blue, and she wears a golden circlet on her brow. |\n| 4              | Rrr'keth  | An old and wise lizardfolk, with a long white beard and a wealth of knowledge about their people's history and traditions. He is often found in quiet contemplation, or sharing stories with younger members of his tribe. |\n| 5              | T'thax    | A young and impetuous lizardfolk, with bright red scales and a fiery temper. He is quick to anger and delights in battle, but lacks the patience and wisdom of his elders. |\n| 6              | Hsskra   | A cunning and duplicitous lizardfolk, with sleek black scales and a sharp mind for business. She runs a thriving trade network among her people, but is known to double-cross her partners without warning. |\n| 7              | G'ssara  | A gentle and nurturing lizardfolk, with soft yellow scales and a motherly disposition. She cares for the young of her tribe with great affection, and is respected by all for her wisdom and kindness. |\n| 8              | X'terra   | A mysterious and enigmatic lizardfolk, with deep purple scales that seem to shift and change color in different light. It is said that X'terra is a powerful sorcerer, but their true abilities remain shrouded in secrecy. |\n| 9              | Ix'klan   | A proud and honorable lizardfolk, with scales the color of polished bronze and a deep love for his tribe and its traditions. He is a fierce protector of his people, and a skilled warrior with his spear. |\n| 10             | Y'ssari  | An outlander among her people, Y'ssari is a traveler and adventurer with no fixed abode. She has journeyed across many lands and cultures, and is fascinated by the customs and beliefs of other races. |\n| 11             | K'rrash  | A brutish and violent lizardfolk, with scales the color of dried blood and a baleful glare. He revels in inflicting pain on others, and takes pleasure in the suffering of his enemies. |\n| 12             | L'xar     | A quiet and thoughtful lizardfolk, with deep blue scales and a love for the natural world. He spends much of his time communing with the spirits of the forest and the river, and is said to have the ability to speak with animals. |\n| 13             | N'shash  | A skilled artisan and craftsman, with scales of a rich brown color and a talent for working with metal and stone. His weapons and armor are highly prized among his people, and he is always seeking to improve his craft. |\n| 14             | R'ssath  | A devout and pious lizardfolk, with pale white scales and a deep reverence for the ancient gods of his people. He spends much of his time in prayer and meditation, seeking to deepen his understanding of the divine. |\n| 15             | J'shkra   | A sly and cunning lizardfolk, with scales the color of moss and a talent for thievery and deception. He is often found lurking in the shadows, or planning a daring heist. |\n| 16             | Q'thra    | A fierce and determined lizardfolk, with scales the color of molten lava and a fierce determination to succeed in battle. She is a skilled strategist, and a powerful warrior with her polearm. |\n| 17             | V'ssor    | A melancholy and introspective lizardfolk, with scales of a deep grey color and a troubled past. He carries a heavy burden of guilt and sorrow, and seeks redemption through acts of charity and kindness. |\n| 18             | M'ssara  | A charismatic and outgoing lizardfolk, with vibrant orange scales and a natural talent for leadership. She is a popular figure among her people, and is often chosen to negotiate treaties and alliances with other tribes. |\n| 19             | P'sskar   | A jovial and friendly lizardfolk, with scales the color of fresh spring leaves and a love for music and dancing. He is always ready with a joke or a story, and delights in making others laugh. |\n| 20             | Z'ssak    | A fearsome and notorious pirate of the lizardfolk seas, with scales that shimmer like the sun on the water and a crew of cutthroat sailors at her command. She is a master of naval warfare, and a scourge to all who cross her path. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Races",
        "Aarakocra",
        "Aasimar",
        "Bugbear",
        "Changeling",
        "Dragon",
        "Dragonborn",
        "Drow",
        "Duergar",
        "Dwarves",
        "Elves",
        "Genasi",
        "Gnomes",
        "Goblin",
        "Goliath",
        "Half-Elves",
        "Half-Orcs",
        "Halflings",
        "Hobgoblin",
        "Human",
        "Kobold",
        "Lizardfolk",
        "Orcs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}