{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "5e Rolltables",
  "description": "Prompt generated entities from ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n| Roll | Mishap |\n|------|--------|\n| 1    | You throw your weapon, it lands 1d10 feet away. |\n| 2    | You swing too hard and lose your balance, falling prone. |\n| 3    | Your weapon gets stuck in an adjacent object, taking an action to dislodge. |\n| 4    | You accidentally hit an ally within 5ft of you. |\n| 5    | Your weapon becomes slippery and is dropped, taking your next turn to pick it up. |\n| 6    | You strike yourself in confusion, dealing the weapon's damage to yourself. |\n| 7    | You swing too wildly, hitting nothing but air and losing your next attack. |\n| 8    | Your weapon bends or breaks, becoming unusable until repaired. |\n| 9    | You lose focus and become disoriented, gaining disadvantage on your next attack roll. |\n| 10   | Your weapon hits a solid object (rock, tree, etc.) and vibrates in your hands, stunning you for 1 round. |\n| 11   | You strike the ground, sending dirt and debris into your eyes, blinding you for 1 turn. |\n| 12   | You swing too hard, slamming your weapon against your knee, causing 1d6 damage. |\n| 13   | You accidentally hit an object that unleashes a cloud of poison gas, save against being poisoned. |\n| 14   | Your weapon strikes a cursed object, causing it to cling to you until removed with remove curse. |\n| 15   | Your weapon becomes electrified and shocks you, causing 1d8 lightning damage. |\n| 16   | You become overzealous, pushing yourself into a rage and losing control of your character for 1 turn. |\n| 17   | You slip on a wet patch on the ground, falling prone. |\n| 18   | Your weapon strikes a loose stone, causing a small cave-in that buries you for 1 turn. |\n| 19   | You swing too early or too late, causing a momentary decrease in AC. |\n| 20   | Your weapon hits a rune-protected stone, causing an explosion, saving throw for half damage. |\n\n**Note**: All damage values assumed to be handled by game systems, and are presented only as suggested options.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Melee"
    },
    {
      "rawText": "## Ranged\r\n# d100 Mishaps due to a Critical Failure on a Ranged Attack\n\n1. Your bowstring snaps and you take 1d4 piercing damage from the recoil.\n2. Your arrow hits an ally within 10 feet of your target. Roll to see who gets hit.\n3. Your arrow ricochets off a nearby rock and hits a random target within 20 feet.\n4. A gust of wind throws off your shot and the arrow lands harmlessly 10 feet to the left.\n5. The arrow you nocked was already damaged and breaks upon firing.\n6. Your quiver falls apart and arrows scatter in every direction.\n7. You accidentally fire the arrow backwards, hitting a random target behind you.\n8. A bird swoops down and intercepts your arrow mid-flight.\n9. You get distracted and accidentally shoot a friendly NPC instead of the intended target. Roll to determine the NPC's injury.\n10. Your bowstring flies off, striking a random character within 10 feet for 1d4 bludgeoning damage.\n11. Your arrow ricochets off a wall and lands at your feet.\n12. Your bow collapses into shards, dealing 2d6 piercing damage to you.\n13. Your arrow misses and strikes a beehive, attracting an angry swarm of bees.\n14. Your arrow hits an enemy's shield, alerting the enemy to your presence.\n15. Your bowstring becomes tangled, preventing you from firing for 1d4 rounds.\n16. A nearby warlock accidentally curses your arrow with a random spell up to 2nd level.\n17. You trip and accidentally shoot your ally in the back for 1d6 piercing damage.\n18. You accidentally shoot your boot, dealing 1d4 piercing damage to yourself.\n19. Your shot is just a little too strong, with the arrow sailing over the horizon never to be seen again.\n20. Your shot misses the enemy, but hits a random piece of explosive debris which detonates for 2d6 fire damage to everyone within 10 feet.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Ranged"
    },
    {
      "rawText": "## Arcane\r\n# d100 Arcane Attack Critical Failure Mishaps\n\n1. You accidentally teleport to a nearby location and cannot return to your original spot for the next hour.\n2. Your arcane energies backfire and you become stunned for one round.\n3. You overload your senses with magical energy, causing vision impairment for the next minute.\n4. Your magical attack hits a nearby ally instead of the enemy.\n5. You unintentionally summon a minor demon or elemental, which immediately attacks you.\n6. Your spell creates a loud, obnoxious noise that can be heard up to a mile away.\n7. Your target is surrounded by a barrier of magical force, making it almost invulnerable for the next minute.\n8. Your magical attack triggers a wild surge that affects everyone within 30 feet of you.\n9. Your attack misfires, causing you to become vulnerable to the same magical damage type for the next minute.\n10. You lose your concentration and suffer from a sudden headache, causing you to take 1d6 psychic damage.\n11. You accidentally open a portal to another realm that sucks in one random person or object within 10 feet of you.\n12. Your spell fizzles out and you suffer from a disruption in your magical abilities, causing you to be unable to cast spells for the next turn.\n13. You accidentally polymorph yourself into a harmless creature, such as a mouse or a frog, for the next minute.\n14. Your spell was too powerful and now there's a slight chance of a magical storm in the next 24 hours.\n15. A swarm of magical insects appears and begins to attack everyone within 20 feet of you.\n16. Your magical energy causes a localized earthquake, knocking everyone in the vicinity prone.\n17. Your spell hits a nearby object, breaking it into pieces and causing loud noises that alert others to your presence.\n18. Your magical energy lingers and causes a small fire to start that quickly spreads out of control.\n19. Your spell backlashes and causes one of your senses, chosen randomly, to be impaired for the next 10 minutes.\n20. You imbue yourself with too much magical power, causing you to take 1d8 force damage.\n21. Your spell triggers a magical chain reaction, causing all magical items within 10 feet to cease functioning for the next hour.\n22. Your magical energy causes all metal objects within 15 feet to glow brightly for the next minute.\n23. Your spell causes the ground beneath your feet to become slippery and difficult to stand on.\n24. You accidentally summon a flock of annoying birds that disrupt your attempts to be stealthy.\n25. Your spell causes a localized breach in reality, causing strange and disturbing sounds to emanate from the area for the next hour.\n26. Your magical energy causes all the plants within 30 feet to wither and die.\n27. You accidentally instantaneously age yourself by 10 years.\n28. Your spell causes a burst of intense light that blinds all creatures within 20 feet for one round.\n29. Your magical attack causes the ground beneath the target to bubble and turn into a small pool of acid.\n30. Your spell causes a loud and unsettling noise that can be heard up to a mile away.\n31. Your magical energy causes your hair to stand on end and gives you a static shock.\n32. Your spell creates a bright and colorful display of lights that have no real effect.\n33. You accidentally summon an impish prankster who will cause mayhem for the next 24 hours.\n34. Your magical energy causes a magical labyrinth to appear around the target.\n35. Your spell triggers a chain of magical illusions that affect everyone within 30 feet of you.\n36. You lose control of your magical energy and create a small crater in the ground.\n37. Your magical attack causes an unsettling silence to fill the area for the next minute.\n38. Your spell causes a hazy mist to envelope the area, making visibility difficult.\n39. Your magical energy causes water within 20 feet of you to become purified.\n40. Your spell creates a blinding flash of light that makes it difficult to see for the next round.\n41. You accidentally summon a benevolent spirit that offers advice and guidance for the next hour.\n42. Your magical energy causes a small gust of wind that forces everyone within 15 feet of you to make a Dexterity saving throw or be knocked prone.\n43. Your spell causes a loud and unsettling scream that can be heard up to a mile away.\n44. Your magical attack causes an unsettling feeling to affect everyone within 30 feet of the target.\n45. You imbue yourself with too much magical power, causing you to become disorientated for one round.\n46. Your spell causes a large, colorful explosion that has no real effect.\n47. Your magical energy causes the target to rapidly age by 10 years.\n48. Your spell creates a distracting echo that lasts for the next round.\n49. You accidentally summon a harmless animal, such as a rabbit or a songbird.\n50. Your magical energy causes a bizarre and unsettling smell to permeate the area.\n51. Your spell creates a harmless but blinding burst of light.\n52. Your magical attack causes a localized tornado that knocks everyone within 20 feet of the target prone.\n53. You imbue yourself with too much magical power, causing you to become frightened for one round.\n54. Your spell causes a burst of intense cold that freezes everything within 10 feet of the target.\n55. Your magical energy causes all the objects within 20 feet to levitate for the next minute.\n56. Your spell causes a deafening boom that echoes through the area for the next minute.\n57. You accidentally summon a friendly elemental that offers its assistance for the next 24 hours.\n58. Your magical attack causes the ground beneath the target to become a muddy, difficult terrain.\n59. Your spell creates a burst of vibrant colors that blinds all those who see it for one round.\n60. Your magical energy causes everyone within 20 feet of you to become insubstantial for one round.\n61. Your spell causes a sudden and intense heat wave that makes it difficult to breathe for the next round.\n62. You imbue yourself with too much magical power, causing you to become confused for one round.\n63. Your magic creates a harmless, miniature copy of yourself nearby.\n64. Your magical energy causes a sudden and powerful gust of wind that blows everyone within 15 feet of you backward.\n65. Your spell causes intense vibrations within the ground that cause everyone within 30 feet of you to make a Dexterity saving throw or fall prone.\n66. You accidentally summon a harmless object, such as a pillow or a piece of fruit.\n67. Your magical attack causes everyone within 20 feet of the target to become deafened for one round.\n68. Your spell causes a burst of intense heat that sets nearby objects on fire.\n69. Your magical energy causes a sudden and strong current of water to sweep everyone within 15 feet of you off their feet.\n70. Your spell causes a sudden and total darkness to envelop the area.\n71. You imbue yourself with too much magical power, causing you to become paralyzed for one round.\n72. Your magical attack causes the ground beneath the target to become unstable and difficult to stand upon.\n73. Your spell causes a sudden and intense burst of light that causes those who witness it to become stunned for one round.\n74. Your magical energy causes a sudden and powerful gust of wind that blows everyone within 15 feet of you backward.\n75. You accidentally summon a harmless creature, such as a butterfly or a gnat.\n76. Your spell causes everyone within 20 feet of the target to become slowed for one round.\n77. Your magical attack causes a sudden and frenzied flurry of snow that temporarily blinds everyone within 30 feet.\n78. Your spell causes a sudden and spectacular explosion that has no real effect.\n79. Your magical energy causes the target's shadow to detach and become a solid, inherently malevolent creature that attacks the target for one minute.\n80. Your magic causes a harmless, miniature monster to appear nearby.\n81. Your spell creates a burst of harmless but unsettling images and sounds.\n82. Your magical energy causes a sudden and intense gust of wind that whips through the area.\n83. Your spell causes a sudden and unexpected burst of rain to drench everyone within 15 feet of you.\n84. You imbue yourself with too much magical power, causing you to become nauseated for one round.\n85. Your magical attack causes a sudden and powerful gust of wind to rush forward and knock everyone within 30 feet back.\n86. Your spell causes a sudden and frenzied flurry of hail that temporarily blinds everyone within 30 feet.\n87. Your magical energy causes all living creatures within 10 feet of the target to become insubstantial for one round.\n88. Your spell creates a harmless but audible echo that resonates throughout the area for the next minute.\n89. You accidentally summon a harmless object, such as a stick or a pebble.\n90. Your magical attack causes everyone within 20 feet of the target to become paralyzed for one round.\n91. Your spell causes a burst of harmless but uncomfortable sensations, such as goosebumps or a shudder.\n92. Your magical energy causes a sudden and unexpected gust of wind that causes everyone within 10 feet of you to make a Dexterity saving throw or become knocked prone.\n93. Your spell causes a harmless but blinding beam of light to emit from your hand.\n94. You imbue yourself with too much magical power, causing you to become dazed for one round.\n95. Your magical attack causes the ground beneath the target to become suffused with water and slippery.\n96. Your spell causes a sudden and violent surge of water to sweep through the area.\n97. Your magical energy causes the target to burst into sudden, frenzied movement for one round before collapsing exhausted.\n98. Your spell creates a harmless but intense burst of flame.\n99. You accidentally summon a harmless illusion, that can only be seen by you.\n100. Your magical attack causes the ground beneath the target to become dangerously unstable and difficult to stand upon.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Talon | A proud warrior, adorned in colorful feathers and armed with a deadly spear. |\n| 2 | Skyla | A wise old philosopher, with eyes that sparkle like sapphires and wings that shimmer in the sunlight. |\n| 3 | Swiftwing | A lithe and graceful scout, with a quick mind and even quicker reflexes. |\n| 4 | Featherfall | A jovial and boisterous merchant, with a talent for haggling and a love for shiny baubles. |\n| 5 | Stormcaller | A powerful shaman, capable of channeling the elemental powers of the sky itself. |\n| 6 | Windrider | A reckless thrill-seeker, always looking for the next adrenaline rush. |\n| 7 | Cloudwatcher | A watchful guardian, with keen eyes that can spot danger from miles away. |\n| 8 | Skydancer | A graceful dancer and performer, renowned for their aerial acrobatics. |\n| 9 | Sunwing | A devoted priest, serving the sun god and spreading their gospel throughout the land. |\n| 10 | Nightfeather | A mysterious rogue, shrouded in shadows and always keeping their motives hidden. |\n| 11 | Frostwing | A stoic and disciplined soldier, trained in the art of aerial combat. |\n| 12 | Raincaller | A gentle healer, with the power to cure ailments and soothe troubled minds. |\n| 13 | Firebeak | A fiery and passionate artisan, crafting beautiful works of art from precious metals and gems. |\n| 14 | Thunderstrike | A fearsome warrior, wielding a massive battle axe with deadly precision. |\n| 15 | Mistwing | A patient and wise mentor, guiding young aarakocra on their journey to adulthood. |\n| 16 | Skyblade | A skilled duelist, always seeking the ultimate challenge in the form of a worthy opponent. |\n| 17 | Eagleeye | A sharp-eyed scout and tracker, capable of finding their way through even the most treacherous terrain. |\n| 18 | Moonfeather | A mystic seer, gifted with visions and prophetic dreams from the moon goddess. |\n| 19 | Flamefeather | A passionate and impulsive adventurer, always eager to explore new lands and face new challenges. |\n| 20 | Windwhisper | A soft-spoken bard, weaving tales and melodies that captivate audiences both small and large. |\n| 21 | Swiftstrike | A swift and deadly hunter, with a keen sense of smell and the ability to move without making a sound. |\n| 22 | Skywatcher | A vigilant sentinel, perched atop high cliffs and tall trees to keep watch over their territory. |\n| 23 | Sunfeather | A devout cleric, spreading the warmth and light of the sun god to all who will listen. |\n| 24 | Cloudshaper | A master of illusion and trickery, capable of conjuring convincing illusions that can trick even the most astute observers. |\n| 25 | Icewing | A stoic and calculating strategist, capable of analyzing any situation and coming up with a plan of attack. |\n| 26 | Raindancer | A joyful and exuberant entertainer, using dance and song to lift the spirits of all around them. |\n| 27 | Sparkfeather | An energetic inventor, always tinkering with gadgets and gizmos that harness the power of lightning. |\n| 28 | Thunderbeak | A fierce and intimidating leader, inspiring their followers to charge fearlessly into battle. |\n| 29 | Cloudwhisperer | A compassionate and empathetic healer, able to calm the nerves and ease the pain of even the most troubled souls. |\n| 30 | Skyfire | A fierce and passionate rebel, fighting against the tyranny of those who would seek to enslave his people. |\n| 31 | Windracer | A daring and adventurous explorer, always seeking out new frontiers to conquer. |\n| 32 | Featherstorm | A wild and unpredictable maverick, embracing chaos and the unexpected at every turn. |\n| 33 | Icefeather | A cold and calculating assassin, striking from the shadows with deadly precision. |\n| 34 | Shadowwing | A shadowy figure, lurking in the darkness and always shrouded in mystery. |\n| 35 | Stormfeather | A tempestuous and unpredictable warrior, wielding the power of the storm to devastating effect. |\n| 36 | Sunclaw | A fierce and loyal supporter of their leader, willing to do whatever it takes to protect their people. |\n| 37 | Cloudwalker | A nimble and agile performer, using acrobatics and grace to wow audiences. |\n| 38 | Skyhunter | A skilled hunter, tracking prey across vast distances and taking them down with deadly accuracy. |\n| 39 | Flameblade | A passionate and hot-headed warrior, charging into battle with reckless abandon. |\n| 40 | Thunderclap | A ferocious defender, using lightning to stun and incapacitate their enemies. |\n| 41 | Raincaller | A gentle healer, with the power to cure ailments and soothe troubled minds. |\n| 42 | Windrider | A reckless thrill-seeker, always looking for the next adrenaline rush. |\n| 43 | Sunwing | A devoted priest, serving the sun god and spreading their gospel throughout the land. |\n| 44 | Nightfeather | A mysterious rogue, shrouded in shadows and always keeping their motives hidden. |\n| 45 | Frostwing | A stoic and disciplined soldier, trained in the art of aerial combat. |\n| 46 | Skyeagle | A proud and noble warrior, renowned for their courage and bravery. |\n| 47 | Emberstorm | A fiery and passionate leader, capable of inspiring their followers to greatness. |\n| 48 | Thunderbolt | A lightning-fast warrior, moving with a speed that seems almost impossible. |\n| 49 | Windwhirl | A carefree and whimsical spirit, embodying the freedom and joy of flight. |\n| 50 | Moonshadow | A mysterious and enigmatic figure, who seems to exist on the fringes of society. |\n| 51 | Skydive | A reckless and foolhardy daredevil, constantly pushing the limits of what is possible. |\n| 52 | Featherflame | A fiery and passionate artist, creating works of stunning beauty and power. |\n| 53 | Cloudjumper | A fearless explorer, always seeking out new heights to conquer. |\n| 54 | Sunburst | A radiant and joyful spirit, spreading warmth and light wherever they go. |\n| 55 | Nightshade | A dark and brooding figure, whose motives are always shrouded in mystery. |\n| 56 | Frostbeak | A stoic and unyielding warrior, who can withstand even the harshest of conditions. |\n| 57 | Skyglider | A master of the skies, using every trick and technique to stay aloft. |\n| 58 | Rainstorm | A powerful and unpredictable force of nature, capable of unleashing devastating floods and storms. |\n| 59 | Thunderbird | A legendary figure, whose power and majesty strike fear into the hearts of their enemies. |\n| 60 | Windwalker | A wise and contemplative philosopher, seeking deeper truths in the intricacies of the wind. |\n| 61 | Feathertail | A graceful and elegant dancer, moving with the fluidity of water. |\n| 62 | Cloudweaver | A master of art and magic, creating stunning works that seem almost otherworldly. |\n| 63 | Sunsworn | A faithful and devoted servant of their god, walking the path of righteousness. |\n| 64 | Nightwing | A fierce and cunning predator, stalking their prey in the darkness. |\n| 65 | Frostclaw | A patient and methodical tracker, always staying one step ahead of their quarry. |\n| 66 | Skyshaper | A master of architecture and engineering, designing structures that seem impossible to build. |\n| 67 | Raincloud | A gentle and supportive friend, always there to provide comfort and reassurance. |\n| 68 | Emberwing | A driven and ambitious leader, always pushing their people to strive for greatness. |\n| 69 | Thunderstorm | A raging tempest, striking fear into the hearts of anyone unlucky enough to face them. |\n| 70 | Windchaser | A fearless adventurer, racing across the sky at breakneck speeds. |\n| 71 | Moonlight | A gentle and nurturing soul, offering comfort and guidance to those who seek it. |\n| 72 | Skydancer | A graceful and elegant performer, captivating audiences with their beauty and skill. |\n| 73 | Featherfoot | A nimble and agile warrior, moving with a speed and grace that seems almost unnatural. |\n| 74 | Cloudmancer | A powerful sorcerer, commanding the very clouds and winds to do their bidding. |\n| 75 | Sunbeam | A radiant and joyful figure, spreading warmth and light wherever they go. |\n| 76 | Nightfall | A shadowy and mysterious presence, whose motives are always shrouded in secrecy. |\n| 77 | Frostfeather | A cold and calculating strategist, always thinking three steps ahead. |\n| 78 | Skyhawk | A fierce and noble warrior, always ready to defend their people against any threat. |\n| 79 | Rainfeather | A gentle and compassionate soul, always ready to lend an ear and a shoulder to those in need. |\n| 80 | Emberflame | A passionate and driven artisan, always striving to create works of unsurpassed beauty. |\n| 81 | Thundercrash | A fierce and unrelenting warrior, whose battle cry can shake the very foundations of the earth. |\n| 82 | Windweaver | A master of illusions and trickery, capable of making reality bend to their will. |\n| 83 | Moonbeam | A gentle and nurturing spirit, shining a light of hope in even the darkest of times. |\n| 84 | Skyfall | A reckless and headstrong daredevil, who cares more for the thrill of the moment than the consequences. |\n| 85 | Featherwind | A free-spirited wanderer, always following the winds wherever they may lead. |\n| 86 | Cloudbringer | A powerful and wise healer, capable of curing even the most deadly of ailments. |\n| 87 | Sunblade | A fierce and unyielding warrior, whose blade can cut through even the toughest armor. |\n| 88 | Nightwatcher | A vigilant and protective guardian, always watching over their people from the shadows. |\n| 89 | Frosteye | A sharp-eyed scout, able to spot the smallest details from miles away. |\n| 90 | Skyblade | A skilled duelist, always seeking out the ultimate challenge in the form of a worthy opponent. |\n| 91 | Rainstorm | A powerful and unpredictable force of nature, capable of unleashing devastating floods and storms. |\n| 92 | Emberheart | A passionate and caring soul, always putting the needs of others before their own. |\n| 93 | Thunderwing | A powerful and imposing presence, whose very sight is enough to strike fear into the hearts of their foes. |\n| 94 | Windrider | A free-spirited adventurer, always seeking out new thrills and challenges. |\n| 95 | Moonshadow | A mysterious and enigmatic presence, who seems to exist on the fringes of society. |\n| 96 | Skydancer | A graceful and elegant performer, captivating audiences with their beauty and skill. |\n| 97 | Featherblade | A swift and deadly warrior, whose blade strikes faster than the eye can see. |\n| 98 | Cloudweaver | A master of art and magic, creating stunning works that seem almost otherworldly. |\n| 99 | Sunstorm | A fierce and unstoppable warrior, whose fury is matched only by the heat of the sun. |\n| 100 | Nightblade | A shadowy and mysterious figure, moving through the darkness with deadly grace. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 01         | Aela | This aasimar has stunning golden eyes and long, curly blonde hair that frames their delicate, high-cheekboned face. They carry themselves with a regal, confident air and wear flowing robes reminiscent of those worn by high priests. |\n| 02         | Erevan | This aasimar has piercing blue eyes and a mop of wild, curly black hair. They have a lean, muscular build and wear fitted leather armor that highlights their toned figure. They exude an electrifying energy that draws people to them. |\n| 03         | Iliana | This aasimar has striking emerald green eyes and long, straight silver hair. They have a serene, peaceful aura that puts others at ease, and they dress in simple, flowing white robes. They are often seen helping those in need or tending to the sick. |\n| 04         | Kael | This aasimar has piercing grey eyes and short, spiky platinum blonde hair. They have a rugged, handsome appearance and wear studded leather armor. They are known for their bravery in battle and their fierce loyalty to their allies. |\n| 05         | Lirien | This aasimar has deep brown eyes and wavy, honey-brown hair. They have a warm, friendly demeanor and wear brightly colored clothing that reflects their playful nature. They are known for their sense of humor and their love of pranks. |\n| 06         | Mirielle | This aasimar has dramatic, almond-shaped eyes that change color from blue to green depending on the light. They have long, flowing black hair and delicate features that give them an otherworldly appearance. They dress in intricate, elegant clothing and are often seen at high society gatherings. |\n| 07         | Naia | This aasimar has bright hazel eyes and long, curly red hair. They have a bubbly, effervescent personality that can turn heads and lighten hearts. They wear comfortable clothes that allow them to move freely, and they often use their talents to entertain crowds or cheer on their allies. |\n| 08         | Rhiannon | This aasimar has bold, striking blue eyes and short, choppy silver hair. They have a fierce, fiery personality that can be both inspiring and intimidating. They wear black leather clothing and wield powerful weapons with ease. They are known for their ferocity on the battlefield and their unyielding determination. |\n| 09         | Sariel | This aasimar has a serene, otherworldly beauty that is accentuated by their piercing green eyes and long, silver hair that falls in soft waves around their face. They dress in light, flowing garments that are adorned with moonstones and silver thread. They have an affinity for the celestial realm and often venture there to seek guidance or commune with their angelic ancestors. |\n| 10         | Thalia | This aasimar has striking violet eyes and long, flowing burgundy hair. They have a regal, elegant appearance and dress in luxurious silks and velvets that accentuate their high cheekbones and graceful figure. They are known for their poise and grace, as well as their keen intellect and strategic mind. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01-05 | Grimsnarl | This bugbear's fur is a dirty brown color and its eyes are a piercing yellow. Its long arms end in sharp claws and its snarling face reveals jagged teeth. |\n| 06-10 | Grobb | With matted black fur and a hulking form, this bugbear has a prominent scar above its lip. It carries a crude club and wears a necklace of teeth. |\n| 11-15 | Rikkitar | Outfitted in a patchwork collection of furs and leathers, this bugbear stands taller than most of its kin. Its head is adorned with a crown of antlers and its expression is one of cruel amusement. |\n| 16-20 | Gurtok | This bugbear is notable for its missing eye, which was gouged out in a long-ago battle. It wears a scratched and dented breastplate and carries a large, battle-worn shield. |\n| 21-25 | Vorgok | With a barrel chest and a sharp-toothed grin, this bugbear is known for its insatiable appetite, even by the standards of its kin. It can usually be found in the midst of a pile of stolen foodstuff. |\n| 26-30 | Fekk | This bugbear is fond of tinkering with all manner of machinery, and often has a smattering of grease or oil smeared across its fur. It wears goggles on its forehead and carries a small assortment of tools. |\n| 31-35 | Krag | With a ragged patch of fur around one eye, Krag is especially tough-looking even for a bugbear. It wields a pair of wicked-looking axes and is often surrounded by a gang of lackeys. |\n| 36-40 | Razzle | This bugbear's fur is a rich shade of chestnut, and it often wears a look of thoughtfulness on its brutish face. It carries a worn journal and a dented quill, and is known by reputation to be something of a strategist. |\n| 41-45 | Garg | Towering and heavily muscled, Garg is an intimidating figure even among his kind. Its fur is a dark, matted grey, and it is often seen clad in layers of fur and chainmail. |\n| 46-50 | Zog | Zog is covered in a patchwork of scars of unknown origin, and its fur is a sickly shade of green. It is known to be particularly cruel, and is often found torturing captives with sadistic glee. |\n| 51-55 | Kragnor | This bugbear is particularly fleet-footed, even for one of its kind. It carries a pair of long, slender daggers and often employs hit-and-run tactics in combat. |\n| 56-60 | Torg | Torg is particularly ugly, even for a bugbear, with a lopsided jaw and a misshapen nose. Despite its appearance, however, it is known to be a persuasive negotiator and is often called upon to handle delicate diplomatic matters. |\n| 61-65 | Ug | With a thick, powerful build and a prominent underbite, Ug is a formidable opponent in combat. However, it is known to have a soft spot for children, and has been seen to occasionally provide aid to lost or stranded youngsters. |\n| 66-70 | Snik | Snik is smaller than most bugbears, but it makes up for its lack of size with cunning and intellect. It often works as a scout or spy, and has been known to give strategy advice to leaders higher up the chain of command. |\n| 71-75 | Grog | With a brutish, low forehead and a snarling expression, Grog is the epitome of the stereotypical bugbear. It carries a crude, spiked club and frequently engages in pointless acts of violence. |\n| 76-80 | Zik | Zik is something of a scoundrel, even by bugbear standards. It frequently engages in underhanded tactics such as using poison or dirty fighting. It is often found in the company of similarly amoral rogues and criminals. |\n| 81-85 | Grubnub | This bugbear is notorious for its poor hygiene and foul smell. It frequently wears a wide grin and is known to be particularly vicious and cruel in battle. |\n| 86-90 | Grimtusk | With a long, powerful set of tusks, Grimtusk strikes fear in the hearts of many. It often carries a giant meat cleaver as a weapon, and is rumored to be something of a cannibal. |\n| 91-95 | Rorag | Rorag has a particularly large and muscular build, even for a bugbear. It is known for its almost unbreakable stubbornness and often refuses to back down, even in the face of overwhelming odds. |\n| 96-00 | Throg | With a massive, muscular frame and a rumbling voice, Throg is the very embodiment of brute strength. It is often used as a shock trooper in battle, and is known for its devastating, bone-crushing attacks. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n\nChatbot reponse terminated unexpectedly: : The request was canceled due to the configured HttpClient.Timeout of 100 seconds elapsing.\r\n\nSystem message: : You are a game master who helps other game masters develop rolltables to help them run their games.  Responses should be limited to what was specifically asked for.  Do not include introduction or closing text.  All generated tables should be in markdown format.  Do not surround any markdown text with fenced code blocks.\r\n\nUser message: : Generate a d100 rolltable in markdown format for the following:\nTopic: NPC names and descriptions\nRace: Changeling\nGenre: Fantasy\nGame System: Dungeons and Dragons 5e\nSentiment: On a sentiment scale of 1 to 10, where 1 represents a very precise and serious reponse and 10 represents a whimsical reponse, please generate reponses with a sentiment rating of 2\nTable Structure: Table should have three columns: dice value, name, description.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01 | Vrakola | A young dragon, barely out of her wyrmling stage, who is fascinated by humanoids and often takes on a humanoid form to interact with them. |\n| 02 | Zalthiriax | An ancient dragon who has accumulated vast knowledge and treasures over the centuries, but is now seeking a worthy successor to inherit it all. |\n| 03 | Gethyx | A dragon who has taken up residence in a large cavern beneath a mountain, and has been worshipped by nearby humanoids as a deity for generations. |\n| 04 | Pyreneia | A dragon who has befriended a group of adventurers and frequently hires them for odd jobs, such as retrieving hard-to-find treasures or eliminating rival dragons. |\n| 05 | Xalvion | A dragon who has been cursed to spend the majority of his time in a human form, and has become somewhat of a recluse as a result. |\n| 06 | Auralia | A dragon who is fiercely protective of her mountain territory, and will attack any intruders without hesitation. |\n| 07 | Draconis | A dragon who has become fascinated with magic and spends most of his time studying arcane texts and experimenting with new spells. |\n| 08 | Nymthalax | A dragon who has formed an unlikely alliance with a group of elves, and allows them to live in her forest as long as they bring her regular offerings of silver. |\n| 09 | Gorgoth | A dragon who has been cursed with a hoarder's mentality, and cannot resist adding to his treasure pile every chance he gets. |\n| 10 | Zyphorax | A dragon who has taken on the persona of a traveling bard in order to better understand humanoids. He frequently performs in taverns and inns, and is always looking for new stories to add to his repertoire. |\n| 11 | Dracarys | A dragon who has allied herself with a group of orc raiders, and uses her fire breath to devastating effect in their battles. |\n| 12 | Kyraxia | A dragon who has become obsessed with the study of history, and has amassed an impressive library of rare tomes and scrolls. |\n| 13 | Sylphira | A dragon who has taken on a humanoid apprentice, and is patiently teaching her everything she knows about magic and dragonkind. |\n| 14 | Terraxis | A dragon who has been spotted flying with a group of griffins, and is rumored to be working with them to establish a new territory. |\n| 15 | Vorathia | A dragon who has taken up residence in a massive glacier, and is constantly manipulating the surrounding weather to suit her needs. |\n| 16 | Zephyra | A dragon who was captured by a group of mages and is now being used as a guardian for their tower. |\n| 17 | Aurorax | A dragon who has taken in a group of kobolds and is using them to mine valuable minerals from the nearby caverns. |\n| 18 | Thanatos | A dragon who has been cursed with a ravenous hunger, and must eat several times her body weight every day just to survive. |\n| 19 | Nexia | A dragon who has traveled to the material plane specifically to locate and study the rare flowers that grow there. |\n| 20 | Axxarion | A dragon who has taken up residence atop a high tower, and has been using its height to scout the surrounding area for potential threats. |\n| 21 | Chillthorn | A dragon who has claimed a large swath of tundra as her own, and is known for freezing anyone who crosses into her territory. |\n| 22 | Hadeon | A dragon who has taken over a nearby castle through sheer force, and now expects tribute from the surrounding humanoids. |\n| 23 | Phylaxia | A dragon who is fascinated with the workings of the natural world, and spends most of her time studying flora and fauna. |\n| 24 | Solariel | A dragon who has become obsessed with the study of theology, and is constantly seeking out new religious texts and artifacts. |\n| 25 | Valkorion | A dragon who is constantly seeking out new experiences, and will often hire adventurers to take him to far-off lands or introduce him to new foods and cultures. |\n| 26 | Vindrax | A dragon who has taken up residence atop a tall spire, and is known for her sharp vision and deadly accuracy with ranged attacks. |\n| 27 | Winthirax | A dragon who is using his vast wealth and magical abilities to set himself up as the ruler of a nearby city, and is steadily expanding his power base. |\n| 28 | Xylophian | A dragon who has allied himself with a nearby tribe of goblins, and uses their numbers to great effect in battle. |\n| 29 | Azurath | A dragon who has been cursed with a twisted sense of humor, and enjoys playing elaborate pranks on anyone who crosses her path. |\n| 30 | Bloodwing | A dragon who has been terrorizing nearby villages for years, and has grown increasingly bold as a result. |\n| 31 | Crysania | A dragon who has taken over a nearby abandoned keep, and now uses it as a base of operations for her various schemes and plots. |\n| 32 | Daemyn | A dragon who has become fascinated with humanoid music, and will often sit quietly in the back of taverns and listen to bards perform. |\n| 33 | Frostbite | A dragon who has set up an ambush along a major trade route, and is using her frost breath to freeze goods in transit and then loot them. |\n| 34 | Galleon | A dragon who has taken to the seas in search of adventure and treasure, and has learned how to swim and use her breath weapon underwater. |\n| 35 | Gladius | A dragon who has become something of a local legend, thanks to his regular feats of strength and valor. |\n| 36 | Igniria | A dragon who has been cursed with an insatiable desire for vengeance, and will stop at nothing to destroy those she perceives as her enemies. |\n| 37 | Nihilum | A dragon who has taken it upon herself to act as a protector of the local ecosystem, and will often step in to stop hunters or loggers who are damaging the area. |\n| 38 | Orinthea | A dragon who has become fascinated with the workings of the stock market and other economic systems, and is using her vast wealth to manipulate them to her advantage. |\n| 39 | Pyrrhus | A dragon who has become a patron of the arts, particularly sculpture, and is known for her collection of beautiful statues. |\n| 40 | Sangria | A dragon who is known for her love of physical challenges, and will often compete in various sports or games just for the thrill of it. |\n| 41 | Stardust | A dragon who has taken up residence in a nearby constellation, and is known for her ability to rain down meteors on anyone who angers her. |\n| 42 | Sylphrena | A dragon who has become a close friend and ally of a nearby group of unicorns, and is known for her patience and kindness towards them. |\n| 43 | Twilight | A dragon who has spent years studying the prophecies of ancient seers and is convinced that she is the key to unlocking some great destiny. |\n| 44 | Amonarax | A dragon who has taken up residence in a massive desert and is known for her ability to create mirages and sandstorms at will. |\n| 45 | Athenia | A dragon who has taken a particular interest in the local political landscape, and is secretly pulling strings behind the scenes to ensure that certain factions gain power. |\n| 46 | Balthazar | A dragon who has become fascinated with the workings of the universe, and spends most of his time studying the stars and other celestial bodies. |\n| 47 | Charisma | A dragon who is known for her incredible charisma and manipulation skills, and has been able to dupe even powerful wizards and nobles into doing her bidding. |\n| 48 | Crimson | A dragon who has taken up residence in a nearby volcano, and is known for her fiery temper and her ability to incinerate anything in her path. |\n| 49 | Drakonix | A dragon who has become convinced that she is the only true god in existence, and is using her vast breath weapon to force others to convert or die. |\n| 50 | Erebus | A dragon who has taken up residence in a nearby swamp, and is known for her ability to disappear into the murky waters at a moment's notice. |\n| 51 | Euphoria | A dragon who has a strange fascination with the taste of certain gemstones, and often pays adventurers to bring her rare gems to eat. |\n| 52 | Fangoria | A dragon who is known for her keen sense of smell and her ability to track prey for miles. |\n| 53 | Fizban | A dragon who has taken on the guise of a kindly old wizard in order to better observe and interact with humanoids. |\n| 54 | Gilgamesh | A dragon who has become a master of disguise, and can change her appearance at will to blend in with any crowd. |\n| 55 | Helix | A dragon who has taken up residence in a nearby labyrinth, and is known for her ability to navigate its twists and turns with ease. |\n| 56 | Horus | A dragon who has become fascinated with the art of tattooing, and has allowed several skilled artists to decorate her scales with intricate designs. |\n| 57 | Hyperion | A dragon who has become obsessed with the idea of flight, and is constantly experimenting with new techniques and formulas to improve her aerial ability. |\n| 58 | Icarus | A dragon who has become convinced that she can fly to the sun, and is willing to do whatever it takes to make that dream a reality. |\n| 59 | Jabberwock | A dragon who has taken to skulking through nearby forests and attacking travelers who wander too close. |\n| 60 | Kaida | A dragon who has taken up residence in a nearby volcano, and is known for her ability to create lava flows and molten rocks at will. |\n| 61 | Lirien | A dragon who is fascinated with the concept of love and spends most of her time observing couples and attempting to understand their feelings and behaviors. |\n| 62 | Magnus | A dragon who has taken a particular interest in the study of alchemy, and has a large laboratory full of bubbling concoctions. |\n| 63 | Mephistopheles | A dragon who has taken over a nearby town and now rules it with an iron fist, demanding constant tribute and punishing any dissenters harshly. |\n| 64 | Nebula | A dragon who has taken up residence in a nearby constellation, and is known for her ability to summon shooting stars and other heavenly phenomena. |\n| 65 | Nimbus | A dragon who has become fascinated with the workings of weather patterns, and spends most of her time analyzing and predicting weather events. |\n| 66 | Noctis | A dragon who has taken up residence in a nearby mountain pass, and is known for attacking travelers who try to pass through without paying her toll. |\n| 67 | Oblivion | A dragon who has become convinced that the material plane is nothing but an illusion, and is constantly searching for a way to break free into true reality. |\n| 68 | Onyxia | A dragon who has taken control of a powerful criminal organization, and is using their resources and influence to further her own agenda. |\n| 69 | Pandora | A dragon who has become fascinated with the concept of chance and probability, and is often willing to take a risk just to see what will happen. |\n| 70 | Parnassus | A dragon who has become obsessed with the concept of beauty, and spends most of his time admiring works of art or creating his own elaborate displays. |\n| 71 | Polaris | A dragon who has taken up residence in a nearby constellation, and is known for her ability to control and manipulate the stars themselves. |\n| 72 | Riven | A dragon who has been troubled by prophetic dreams, and is desperate to understand their meaning and how she can use that knowledge. |\n| 73 | Ryu | A dragon who is fascinated by the martial arts and frequently challenges powerful warriors to test her own abilities. |\n| 74 | Saphira | A dragon who has taken up residence on a nearby mesa, and has a vast network of underground tunnels and passages at her disposal. |\n| 75 | Sarkan | A dragon who has taken over a nearby monastery, and is forcing the monks there to serve him in any way he sees fit. |\n| 76 | Scatha | A dragon who is known for her incredible agility and reflexes, and is capable of dodging even the most deadly of attacks. |\n| 77 | Seraphina | A dragon who has become convinced that her true calling lies in serving a higher power, and is frequently seen praying or meditating in isolation. |\n| 78 | Shadowfang | A dragon who has become skilled in the art of stealth and is capable of moving with incredible silence and grace. |\n| 79 | Shimmer | A dragon who has become fascinated with the concepts of light and color, and has created several beautiful and intricate works of art using these elements. |\n| 80 | Skathi | A dragon who has become fascinated with the concept of death and is often seen collecting skulls or other morbid items. |\n| 81 | Smoke | A dragon who has taken up residence in a nearby forest, and is known for her ability to create impenetrable smoke screens to hide her movements. |\n| 82 | Solitude | A dragon who has become something of a hermit and will rarely interact with anyone or anything outside of her own territory. |\n| 83 | Sovngarde | A dragon who is convinced that she is a god and is constantly seeking out new followers and ways to prove her divinity. |\n| 84 | Sparx | A dragon who has created an elaborate trap-filled maze deep in a nearby cave system, and is using it to test the mettle of any who dare to challenge her. |\n| 85 | Tarragon | A dragon who has become a master of illusion and is capable of creating extremely convincing and detailed illusions. |\n| 86 | Tenebrosity | A dragon who has amassed a large following of devout cultists who seek to do her bidding in exchange for power and knowledge. |\n| 87 | Thalassia | A dragon who has taken up residence underwater and is known for her ability to control and shape water itself. |\n| 88 | Thundara | A dragon who has taken up residence on a nearby mountaintop, and is known for her ability to summon powerful thunderstorms and lightning strikes. |\n| 89 | Trillian | A dragon who has taken up residence in a nearby marketplace and is constantly trading goods and information with merchants and traders. |\n| 90 | Umbra | A dragon who has become fascinated with shadow magic and is capable of manipulating shadows to confuse and disorient opponents. |\n| 91 | Vega | A dragon who has taken up residence in a nearby constellation, and is known for her ability to create intricate patterns in the night sky. |\n| 92 | Vesper | A dragon who has become fascinated with the concept of time and is often seen studying ancient clocks and other time-keeping devices. |\n| 93 | Vexxia | A dragon who has taken up residence in a nearby city and is using her vast wealth and charisma to manipulate local politics and gain influence. |\n| 94 | Voidstar | A dragon who has become convinced that the universe is a chaotic and meaningless void, and is constantly seeking out new ways to create meaning and purpose in her own life. |\n| 95 | Voltaire | A dragon who has become fascinated with the concept of humor and often enjoys playing pranks and jokes on others. |\n| 96 | Vortex | A dragon who has taken up residence in a nearby canyon, and is known for her ability to create powerful whirlwinds and tornadoes. |\n| 97 | Wildfire | A dragon who has become obsessed with the concept of fire, and is often seen experimenting with new ways to create and manipulate flames. |\n| 98 | Wyvern | A dragon who has taken up residence in a nearby castle, and is using its defenses and infrastructure to establish herself as the ruler of the surrounding land. |\n| 99 | Xenith | A dragon who has become fascinated with various magical artifacts and is always seeking to add new items of power to her collection. |\n| 100 | Zeno | A dragon who has become obsessed with the concept of philosophy and spends most of his time pondering questions of existence and meaning. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:--------:|:---------------:|\n| 1 | Vireo | Tall, with silver scales and piercing blue eyes. Known for their sharp wit and cunning. |\n| 2 | Helicon | A red-scaled dragonborn with unusually large teeth. Has a habit of speaking in riddles. |\n| 3 | Aurum | A fierce warrior with golden scales and a scar across their snout. Famous for their bravery in battle. |\n| 4 | Myrrh | A black-scaled dragonborn with a husky voice and piercing gaze. Known for their love of treasure and hoarding gold. |\n| 5 | Fafnir | A green-scaled dragonborn with a long, bushy tail. Has a fondness for poetry and composing ballads. |\n| 6 | Kalessin | A blue-scaled dragonborn with a secret love for human literature. Has been known to quote Shakespeare in conversation. |\n| 7 | Tiamat | A fierce and powerful dragonborn with five heads, each a different color. Highly respected but feared by many. |\n| 8 | Dracul | A pale, almost albino dragonborn with an enigmatic personality. Has a mysterious past and is a skilled sorcerer. |\n| 9 | Ignatius | A fiery-tempered dragonborn with scales as bright as flames. Has a talent for blacksmithing and crafting weapons. |\n| 10 | Nidhogg | A purplish-black dragonborn with foreboding crimson eyes. Known for their temper and propensity for destruction. |\n| 11 | Pyrrhus | A mildly vain dragonborn with brilliantly red scales. Has a love for fashion and creating unique jewelry. |\n| 12 | Saphira | A mystical dragonborn with radiant blue scales. Has a reputation for being wise and possessing ancient knowledge. |\n| 13 | Balthazar | A muscular dragonborn with deep-red scales. Provides physical training and self-defense lessons to those in need. |\n| 14 | Shenlong | A wise and honorable dragonborn of gold scales. Has an extensive knowledge of medicine and provides aid to those in need. |\n| 15 | Ember | A skilled fire-dancer with uniquely orange scales. Offers entertainment to those seeking a night of revelry. |\n| 16 | Grendel | A menacing dragonborn with a reputation for brawls and causing chaos. Often found at the center of tavern mishaps. |\n| 17 | Scorch | A devilishly cunning dragonborn, known for their ability with fire magic. Has a fondness for traps and playing practical jokes. |\n| 18 | Ragnar | A battle-hardened dragonborn of silver scales. Has a thick accent and a love of mead. Often shares stories of war and adventure. |\n| 19 | Cinder | A musically gifted dragonborn with a voice as smooth as silk. Performs in taverns and concert halls throughout the land. |\n| 20 | Nighthawk | A stealthy dragonborn of ebony scales and sharp claws. Specializes in providing reconnaissance and scouting services. |\n| 21 | Gnash | A hulking dragonborn with yellow scales and a reputation for being a brute. Often hired for muscle work and intimidation services. |\n| 22 | Vermillion | A dragonborn of ruby scales with a stern but fair demeanor. Has a reputation for being a skilled negotiator and diplomat. |\n| 23 | Ash | A quiet dragonborn with gray scales and extensive knowledge of botany. Works as an alchemist and apothecary, providing exotic herbs and medicines. |\n| 24 | Comet | A dragonborn with metallic scales that reflect light. Provides stargazing and astronomical readings to those interested. |\n| 25 | Cobalt | A fiercely intelligent dragonborn with blue scales. Often provides sage advice to those who seek it. |\n| 26 | Crimson | A dragonborn of deep red scales who specializes in the art of persuasion and verbal manipulation. |\n| 27 | Cyan | A contemplative dragonborn of light blue scales. Has a deep knowledge of philosophy and can often be found deep in thought. |\n| 28 | Ebon | A dragonborn of dark black scales who is skilled in the art of aerial combat and acrobatics. |\n| 29 | Ferrum | A dragonborn of metallic silver scales who specializes in blacksmithing and creating armor and weaponry. |\n| 30 | Goldie | A dragonborn with light gold scales who is known for their impeccable sense of style and flair for the dramatic.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n\nChatbot reponse terminated unexpectedly: : The request was canceled due to the configured HttpClient.Timeout of 100 seconds elapsing.\r\n\nSystem message: : You are a game master who helps other game masters develop rolltables to help them run their games.  Responses should be limited to what was specifically asked for.  Do not include introduction or closing text.  All generated tables should be in markdown format.  Do not surround any markdown text with fenced code blocks.\r\n\nUser message: : Generate a d100 rolltable in markdown format for the following:\nTopic: NPC names and descriptions\nRace: Drow\nGenre: Fantasy\nGame System: Dungeons and Dragons 5e\nSentiment: On a sentiment scale of 1 to 10, where 1 represents a very precise and serious reponse and 10 represents a whimsical reponse, please generate reponses with a sentiment rating of 2\nTable Structure: Table should have three columns: dice value, name, description.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 01-05 | Dolgrin | An ambitious and cunning duergar who seeks power through manipulation and intimidation. |\n| 06-10 | Belmira | A crafty duergar who is skilled at metalworking and blacksmithing. |\n| 11-15 | Gruknek | A duergar who is fiercely loyal to their clan and will fiercely defend their territory and kin. |\n| 16-20 | Cragmire | A burly duergar who has a talent for mining and stonework. |\n| 21-25 | Nargrek | A duergar warrior who has honed their combat skills in the subterranean tunnels and caverns. |\n| 26-30 | Thirya | A duergar priestess who worships the deity of their clan and seeks to advance their faith. |\n| 31-35 | Grimgar | A wily duergar thief who prowls the underground cities and raiding parties of other races. |\n| 36-40 | Kragmud | A gruff and grumpy duergar who prefers to keep to themselves and their work. |\n| 41-45 | Trugga | A duergar explorer who likes to venture out into the surface world to gather resources and knowledge. |\n| 46-50 | Hrungar | A duergar diplomat who seeks to foster alliances and improve relations with other races. |\n| 51-55 | Vorgoth | A duergar spy who uses their keen senses and dark vision to gather intelligence. |\n| 56-60 | Beldurz | A duergar bard who uses their musical talents to tell stories and influence others. |\n| 61-65 | Zarnak | A duergar enchanter who harnesses the power of magic to protect their clan and further their goals. |\n| 66-70 | Drakna | A duergar necromancer who uses their dark powers to control the undead and strike fear into their enemies. |\n| 71-75 | Drogath | A duergar ranger who is skilled at tracking and hunting both above and below ground. |\n| 76-80 | Murgrat | A duergar alchemist who experiments with strange and dangerous chemicals to create powerful potions and explosives. |\n| 81-85 | Gloinna | A duergar merchant who trades in precious metals, gems, and exotic goods from the underworld. |\n| 86-90 | Kragnar | A duergar inventor who creates complex machines and traps to defend their territory and expand their power. |\n| 91-95 | Felnik | A duergar scholar who studies the history and lore of their people and seeks to preserve their culture. |\n| 96-99 | Jarnaxle | A duergar adventurer who has seen the world and seeks new challenges and thrills. |\n| 100 | Grunak | A duergar gladiator who fights in the arenas of their underground cities for the amusement of their kin. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| Dice Value | Name              | Description                                                                                                                                        |\n|------------|-------------------|----------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1-3        | Morgrim           | A gruff and seasoned veteran of many battles. Morgrim has seen it all and isn't afraid to share his opinions on pretty much anything.              |\n| 4-6        | Balin             | A jovial and good-natured dwarf who loves nothing more than a good drink and a hearty meal.                                                            |\n| 7-9        | Durgeddin         | A stoic and introverted dwarf who rarely speaks and is always lost in thought. Many believe he has a tragic past he is trying to come to terms with.     |\n| 10-12      | Torm             | A dwarf bard whose love of music is only matched by his love for a good story. Torm is always looking to learn and experience new things.                 |\n| 13-15      | Bofur             | A hirsute dwarf who prides himself on his impressive beard and impressive collection of trinkets. Bofur is always happy to show off his treasures.  |\n| 16-18      | Fimbril            | A young and ambitious dwarf who is always eager to prove himself. He takes great pride in his work and is always looking for ways to improve his craft. |\n| 19-21      | Krog             | A tough and no-nonsense dwarf who is feared by many. Krog has a reputation for being the best weapon-smith in the land and charges a high price for his work.|\n| 22-24      | Nori               | A dwarf rogue who has a knack for getting into trouble. Nori is always quick on his feet and has a silver tongue that can get him out of most situations.    |\n| 25-27      | Drogan            | A dwarf paladin who is deeply committed to his faith. Drogan is always looking for ways to help those in need and holds himself to the highest moral standards.|\n| 28-30      | Gorm             | A dwarf druid who has spent much of his life living in harmony with nature. Gorm is always on the lookout for ways to protect the natural world from harm.     |\n| 31-33      | Thrain            | A dwarf ranger who is at home in the wilderness. Thrain has an uncanny ability to track even the most elusive prey and is always ready for danger.          |\n| 34-36      | Kili               | A dwarf monk who has devoted his life to mastering the art of unarmed combat. Kili is always striving to perfect his technique and remain in balance.      |\n| 37-39      | Gimli             | A dwarf fighter who has spent his life honing his skills with a battleaxe. Gimli is a fearsome warrior who relishes the thrill of combat.                  |\n| 40-42      | Thorin            | A dwarf king who takes his responsibilities very seriously. Thorin is always thinking about the safety and well-being of his people and will do whatever it takes to protect them.                  |\n| 43-45      | Bifur             | A dwarf inventor who is always tinkering with gadgets and gizmos. Bifur is always looking for ways to make life easier for his fellow dwarves.             |\n| 46-48      | Dwalin            | A dwarf mercenary who has seen his fair share of battles. Dwalin is always looking for an opportunity to put his skills to the test.                        |\n| 49-51      | Oin                | A dwarf medic who is skilled in the art of healing. Oin is always ready to tend to the wounds of his comrades and is highly respected among his peers.    |\n| 52-54      | Gloin             | A dwarf diplomat who has a way with words. Gloin excels at negotiating and forming alliances, and is highly valued by his king.                             |\n| 55-57      | Fili                 | A young and impetuous dwarf who is always eager to prove himself. Fili often acts before he thinks, which can sometimes get him into trouble.              |\n| 58-60      | Grimgor         | A dwarf blacksmith who is known throughout the land for his exceptional work. Grimgor is always in high demand, and charges a premium for his services.|\n| 61-63      | Oskar            | A dwarf shipwright who has spent his life building and repairing boats. Oskar is always looking for ways to improve the design of his vessels.                |\n| 64-66      | Hugin            | A dwarf historian who is a walking encyclopedia of dwarven lore. Hugin is always happy to share his knowledge with anyone who will listen.                  |\n| 67-69      | Harald           | A dwarf geologist who is fascinated with rocks and minerals. Harald is always on the lookout for new deposits of valuable minerals.                          |\n| 70-72      | Helga            | A female dwarf who runs a successful tavern. Helga is known for her tasty ale and delicious food, and her inn is a popular spot for adventurers.        |\n| 73-75      | Ingrid          | A female dwarf who works as a blacksmith. Ingrid is highly skilled and is often sought out for her exceptional work.                                    |\n| 76-78      | Magnus         | A dwarf wizard who is well-versed in the arcane arts. Magnus is always experimenting with spells and is highly respected by his fellow magic-users.     |\n| 79-81      | Sven             | A dwarf hermit who has lived alone in the mountains for years. Sven is highly reclusive and wary of outsiders, but has a wealth of knowledge to share.    |\n| 82-84      | Ulf                | A dwarf bounty hunter who specializes in tracking down criminals. Ulf is highly skilled and always gets his man.                                        |\n| 85-87      | Valdemar     | A dwarf treasure hunter who is always searching for long-lost riches. Valdemar is highly skilled in traps and puzzles and has a keen eye for hidden treasure. |\n| 88-90      | Ylva             | A female dwarf warrior who has made a name for herself in battle. Ylva is an exceptional fighter and is respected by both her allies and enemies.          |\n| 91-93      | Zoran           | A dwarf alchemist who is always experimenting with potions and elixirs. Zoran is highly skilled and is always looking for new ways to enhance his brews.|\n| 94-96      | Varg             | A dwarf scout who is an expert in wilderness navigation. Varg is always on the lookout for new and interesting locales to explore.                      |\n| 97-99      | Eirik             | A dwarf battle priest who is deeply committed to his faith. Eirik is both a skilled combatant and a powerful healer, and is highly respected by his peers.  |\n| 100        | Baelin            | A wise and respected dwarf elder who is highly revered by his people. Baelin has a wealth of knowledge and experience, and is always willing to share his wisdom. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 01         | Aldereth | A dashing elven ranger with piercing green eyes who wields a bow made of enchanted wood. |\n| 02         | Elvina | A wise and ancient elven druid who has lived for centuries and possesses an otherworldly aura. |\n| 03         | Ilmare | A beautiful and graceful elven bard who can enchant and beguile with her haunting music. |\n| 04         | Galadriel | A regal and powerful elven queen who commands an army of loyal followers and is known for her unwavering resolve. |\n| 05         | Erevan | A rogueish and charming elven rogue who is always looking for his next score. |\n| 06         | Liriel | A passionate and fiery elven sorceress who can summon powerful magic to do her bidding. |\n| 07         | Thranduil | An imposing elven king who demands respect and loyalty from his subjects. |\n| 08         | Aerin | A determined elven warrior who fights with skill and ferocity in battle. |\n| 09         | Arwen | A gentle and compassionate elven healer who uses her magic to ease the suffering of others. |\n| 10         | Celeborn | A wise and knowledgeable elven sage who has dedicated his life to the pursuit of knowledge. |\n| 11         | Eilistraee | A devoted elven cleric who worships the goddess of song and beauty. |\n| 12         | Keyleth | A free-spirited elven druid who has a deep connection to the natural world. |\n| 13         | Thia | An adventurous elven ranger who loves nothing more than exploring new lands and discovering new creatures. |\n| 14         | Althaea | A mysterious elven enchantress who uses her magic to manipulate and control others. |\n| 15         | Nimue | An elusive elven mage who seems to vanish into thin air at will. |\n| 16         | Galathil | A renowned elven archer who has won countless competitions with his bow. |\n| 17         | Taurnen | An enigmatic elven wizard who has a reputation for being unpredictable and dangerous. |\n| 18         | Miriel | An intuitive elven diviner who can see the future and predict the outcome of battles. |\n| 19         | Thalassian | An inscrutable elven assassin who strikes from the shadows and leaves no trace of his presence. |\n| 20         | Naiad | A secretive elven druid who has a deep connection to the element of water and can manipulate it at will. |\n| 21         | Cendriane | A quiet elven ranger who prefers the solitude of the forest to the company of others. |\n| 22         | Lorien | A gentle elven healer who has dedicated her life to saving the sick and injured. |\n| 23         | Arvandor | A proud elven warrior who values honor and duty above all else. |\n| 24         | Lurue | An ethereal elven sorceress who can disappear and reappear at will. |\n| 25         | Thessalia | A beautiful elven bard who sings enchanting songs that can lift the spirits of even the most jaded adventurer. |\n| 26         | Elrond | An elderly elven sage who possesses vast knowledge of history and magic. |\n| 27         | Gil-galad | A legendary elven hero who fought in many epic battles and is revered by all who know his name. |\n| 28         | Tathariel | An elusive elven rogue who is always one step ahead of her enemies. |\n| 29         | Yavanna | An earthy elven druid who is fiercely protective of the natural world. |\n| 30         | Faelyn | An impish elven trickster who loves nothing more than playing pranks on unsuspecting adventurers. |\n| 31         | Elladan | A skilled elven ranger who is a master of tracking and stealth. |\n| 32         | Eowyn | A brave elven warrior who has fought in many battles and always comes out on top. |\n| 33         | Elbereth | A powerful elven cleric who serves the goddess of light and purity. |\n| 34         | Orodreth | A stern elven king who brooks no disobedience from his subjects. |\n| 35         | Galathil | A handsome elven bard who can sing and play any instrument with ease. |\n| 36         | Eryndor | An enigmatic elven wizard who always seems to have a trick up his sleeve. |\n| 37         | Anariel | A graceful elven dancer who can mesmerize and enchant with her movements. |\n| 38         | Amastacia | A beautiful elven sorceress whose spells can cause devastation and destruction. |\n| 39         | Cirdan | An ancient elven sage who has seen the rise and fall of many kingdoms. |\n| 40         | Elenwe | A mystical elven healer who can cure even the most incurable diseases. |\n| 41         | Galdor | A noble elven warrior who is always first into battle and last to leave. |\n| 42         | Galathynius | A charismatic elven rogue who always seems to talk his way out of trouble. |\n| 43         | Lorien | A serene elven cleric who has devoted her life to the pursuit of inner peace. |\n| 44         | Elrathia | A fierce elven warrior who is feared by her enemies and respected by all who know her. |\n| 45         | Aragorn | A wise and noble elven king who rules with wisdom and compassion. |\n| 46         | Sylvi | A mischievous elven sprite who loves to play pranks and tricks on unwary adventurers. |\n| 47         | Calantha | A gentle elven bard who can calm even the most agitated of beasts with her music. |\n| 48         | Dairine | An adventurous elven ranger who is always seeking new challenges and experiences. |\n| 49         | Lilliandra | A mystical elven enchantress who can bend the will of others to her own. |\n| 50         | Filianore | A serene elven cleric who worships the goddess of love and beauty. |\n| 51         | Thalion | A skilled elven archer who can shoot an arrow through the eye of a fly. |\n| 52         | Isilmeara | A mysterious elven sorceress who can change her appearance at will. |\n| 53         | Eruanna | An ethereal elven bard who sings songs of love and loss with haunting beauty. |\n| 54         | Galadrielle | A proud and noble elven queen who commands the respect and loyalty of all who serve her. |\n| 55         | Aria | A beautiful elven healer who can mend broken bones and heal even the most grievous of wounds. |\n| 56         | Legolas | A skilled elven ranger who is a master of the bow and arrow. |\n| 57         | Gwaeron | A wise and knowledgeable elven sage who has spent his life studying the mysteries of the universe. |\n| 58         | Tallis | A charismatic elven rogue who can sweet-talk his way out of any situation. |\n| 59         | Elrohir | A powerful elven wizard who can make the very fabric of reality bend to his will. |\n| 60         | Luthien | A beautiful elven princess who possesses great strength and courage. |\n| 61         | Imrahil | A proud elven warrior who fights for honor and glory above all else. |\n| 62         | Aerwyn | An impish elven trickster who loves to play practical jokes on unsuspecting adventurers. |\n| 63         | Thia | A fierce elven ranger who can track even the most elusive of prey through dense forests and rugged mountains. |\n| 64         | Mithrandir | A wise and ancient elven wizard who commands great power and respect. |\n| 65         | Galadreil | A powerful elven sorceress who can call down the wrath of the gods with but a whisper. |\n| 66         | Elendil | A noble elven king who rules with justice and compassion. |\n| 67         | Liriel | A mysterious elven rogue who is always one step ahead of her enemies. |\n| 68         | Eldarian | A legendary elven hero who has saved the world from destruction on more than one occasion. |\n| 69         | Vilya | An enigmatic elven wizard who possesses great knowledge and wisdom. |\n| 70         | Arwen | A gentle and compassionate elven cleric who can cure any ailment with her magic. |\n| 71         | Gilraen | A brave elven warrior who has fought in many epic battles and emerged victorious. |\n| 72         | Elobiel | A charismatic elven bard who can inspire greatness in those around her with her music. |\n| 73         | Nimrodel | An elusive elven sorceress who can disappear and reappear at will. |\n| 74         | Miriel | A beautiful elven healer who can heal even the most dire of injuries with a touch. |\n| 75         | Avarielle | A serene elven cleric who spreads love and joy wherever she goes. |\n| 76         | Legolass | A skilled elven archer who can shoot an arrow through the eye of a dragon. |\n| 77         | Cirdaen | A powerful elven wizard who has mastered the secrets of the universe. |\n| 78         | Anduril | A fierce elven warrior who has never lost a battle. |\n| 79         | Galanath | A mysterious elven rogue who loves to steal from the rich and give to the poor. |\n| 80         | Celebrian | An elusive elven enchantress who can wrap her enemies in illusions and false promises. |\n| 81         | Faelivrin | An adventurous elven ranger who has traveled the world and seen many wonders. |\n| 82         | Tharanduil | A regal elven king who inspires awe and admiration in all who behold him. |\n| 83         | Melwasul | A powerful elven sorceress who can control the elements with ease. |\n| 84         | Elentari | A wise and compassionate elven druid who can communicate with animals and plants. |\n| 85         | Galithil | A skilled elven archer who can shoot an arrow from horseback with deadly accuracy. |\n| 86         | Eruwen | A mystical elven bard who can entrance even the most hard-hearted with her singing. |\n| 87         | Gwindor | A proud elven warrior who has faced death in battle and emerged victorious. |\n| 88         | Melethril | A graceful elven dancer who can bring moonlight to the darkest night. |\n| 89         | Eorithiel | An ethereal elven enchantress who can charm and beguile with her smile. |\n| 90         | Thelrandir | A wise and knowledgeable elven sage who has spent his life studying the mysteries of the universe. |\n| 91         | Elanor | A beautiful elven princess who loves adventure and excitement. |\n| 92         | Galadriell | An enigmatic elven wizard who can change reality with a snap of her fingers. |\n| 93         | Finrod | A powerful elven sorcerer who can summon demons and undead to do his bidding. |\n| 94         | Elvandar | A fierce elven warrior who never backs down from a fight. |\n| 95         | Ellarian | A cunning elven rogue who is always one step ahead of his enemies. |\n| 96         | Galathoniel | An ethereal elven bard who can manipulate the very fabric of reality with her singing. |\n| 97         | Anfalas | A powerful elven wizard who can bring down stars from the sky. |\n| 98         | Thranduil | A regal elven king who is always at the forefront of battle. |\n| 99         | Elenor | A beautiful elven healer who can make the sick and the wounded whole once more. |\n| 100        | Arwen | A wise and compassionate elven queen who rules with love and kindness. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n\nChatbot reponse terminated unexpectedly: : The request was canceled due to the configured HttpClient.Timeout of 100 seconds elapsing.\r\n\nSystem message: : You are a game master who helps other game masters develop rolltables to help them run their games.  Responses should be limited to what was specifically asked for.  Do not include introduction or closing text.  All generated tables should be in markdown format.  Do not surround any markdown text with fenced code blocks.\r\n\nUser message: : Generate a d100 rolltable in markdown format for the following:\nTopic: NPC names and descriptions\nRace: Genasi\nGenre: Fantasy\nGame System: Dungeons and Dragons 5e\nSentiment: On a sentiment scale of 1 to 10, where 1 represents a very precise and serious reponse and 10 represents a whimsical reponse, please generate reponses with a sentiment rating of 2\nTable Structure: Table should have three columns: dice value, name, description.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01 | Alby | Alby is a young gnome with a passion for tinkering. He is always covered in grease and has a wrench in hand.|\n| 02 | Bixby | Bixby is an older gnome who has lived a long and adventurous life. He now spends his days spinning tales and drinking ale at the local tavern.|\n| 03 | Cindra | Cindra is an energetic and curious gnome. She is always exploring and discovering new things.|\n| 04 | Dexter | Dexter is a studious gnome who spends his days buried in books. He is a bit of a recluse and isn't very good with people.|\n| 05 | Ellywick | Ellywick is a mischievous gnome who loves to play pranks on her friends. She is always up for a good laugh.|\n| 06 | Fizzbang | Fizzbang is a eccentric gnome who loves explosions. He is a skilled pyrotechnic and is often found experimenting with new bombs.|\n| 07 | Glim | Glim is a shy gnome who is more comfortable around animals than people. She runs a small petting zoo in the park.|\n| 08 | Hoggle | Hoggle is a grumpy old gnome who yells at kids to get off his lawn. Despite his prickly exterior, he has a heart of gold.|\n| 09 | Isla | Isla is a sweet and gentle gnome who loves to bake. She runs a little bakery that sells the best pastries in town.|\n| 10 | Jinks | Jinks is a witty and clever gnome who loves solving puzzles. He is always up for a good brain-teaser.|\n| 11 | Klaus | Klaus is a serious and disciplined gnome who takes his duties as a guard very seriously. He always carries a spear and a stern expression.|\n| 12 | Liliwink | Liliwink is a flighty and carefree gnome who travels the world in search of adventure. She is a skilled bard and loves to play her lute.|\n| 13 | Maddox | Maddox is a paranoid and secretive gnome who always thinks someone is out to get him. He has a hidden laboratory where he conducts strange experiments.|\n| 14 | Nixie | Nixie is a graceful and elegant gnome who dances in the forest under the moonlight. She is a skilled dancer and teaches classes to other gnomes.|\n| 15 | Oakley | Oakley is a rugged and outdoorsy gnome who loves to hunt and fish. He is always wearing his trusty hat and boots.|\n| 16 | Pipsqueak | Pipsqueak is a tiny gnome with a big personality. She is always bouncing around and talking a mile a minute.|\n| 17 | Quimby | Quimby is a scholarly gnome who spends his days buried in dusty tomes. He is fascinated by ancient magic and artifacts.|\n| 18 | Ricket | Ricket is a clumsy gnome who is always tripping over his own feet. He means well but sometimes causes unintended chaos.|\n| 19 | Scribbles | Scribbles is a creative and artistic gnome who loves to draw and paint. She has a small studio where she sells her works.|\n| 20 | Tilly | Tilly is a friendly and outgoing gnome who loves to entertain guests. She runs the local inn and is always happy to share a pint with new friends.|\n| 21 | Ulrich | Ulrich is a grizzled old gnome who has seen it all. He fought in the great war and lost his eye in battle.|\n| 22 | Vinnie | Vinnie is a conniving and greedy gnome who is always looking for a way to make a quick buck. He runs a pawn shop that is rumored to sell stolen goods.|\n| 23 | Waverly | Waverly is a gentle and kind gnome who is always looking to help others. She runs a soup kitchen that feeds the homeless.|\n| 24 | Xander | Xander is a suave and debonair gnome who is a bit of a ladies' man. He runs a dance club where he works as a DJ.|\n| 25 | Yara | Yara is a fierce and independent gnome who fights for what she believes in. She is a skilled warrior and leads a group of rebels against the corrupt government.|\n| 26 | Zephyr | Zephyr is a free-spirited gnome who travels the world with her trusty companion, a giant butterfly. She is always looking for new and exciting experiences.|\n| 27 | Axl | Axl is a rough-and-tumble gnome who is always getting into scrapes. He is a skilled brawler and enjoys a good fistfight.|\n| 28 | Balthazar | Balthazar is a mysterious gnome who wears a long dark cloak and carries a cane. He is rumored to be a vampire hunter.|\n| 29 | Candlewick | Candlewick is a shy gnome who spends her days making candles. She sells her wares at the local market.|\n| 30 | Dazzle | Dazzle is a flamboyant gnome who loves attention. He wears brightly colored clothes and performs illusions on the street for money.|\n| 31 | Ember | Ember is a fiery gnome who is always on the go. She works at the local blacksmith's shop and is a skilled metalworker.|\n| 32 | Flicker | Flicker is a twitchy gnome who is always looking over his shoulder. He has a reputation for being a thief.|\n| 33 | Gadget | Gadget is a curious gnome who loves to tinker with machines. She runs a small gadget shop that sells all sorts of contraptions.|\n| 34 | Hopper | Hopper is an energetic gnome who hops around like a frog. He is a skilled acrobat and performs in the circus.|\n| 35 | Izzy | Izzy is a sassy gnome who speaks her mind. She runs a party planning business that specializes in wild and crazy events.|\n| 36 | Jagger | Jagger is a rogueish gnome who is always looking for a good time. He runs a speakeasy that serves illegal booze.|\n| 37 | Kipper | Kipper is a nervous gnome who is scared of everything. He hides in his house all day and never leaves.|\n| 38 | Lark | Lark is a happy-go-lucky gnome who is always whistling a tune. She runs a flower shop that sells beautiful bouquets.|\n| 39 | Mimsy | Mimsy is a ditzy gnome who always gets things wrong. She runs a small cafe that serves terrible food.|\n| 40 | Noodle | Noodle is a laid-back gnome who loves to relax. He runs a hot springs spa that offers massages and saunas.|\n| 41 | Ozzy | Ozzy is a heavy metal-loving gnome who plays guitar in a band. He performs at music festivals around the country.|\n| 42 | Pogo | Pogo is a jumpy gnome who is always bouncing around. He works as a delivery boy for the local messenger service.|\n| 43 | Quark | Quark is a scientific gnome who is always conducting experiments. He runs a laboratory that specializes in potions.|\n| 44 | Rascal | Rascal is a mischievous gnome who loves to play pranks. He works as a court jester and is always making the king laugh.|\n| 45 | Scuttle | Scuttle is a crabby gnome who is always complaining. He works as a librarian and shushes people all day.|\n| 46 | Tinker | Tinker is a hardworking gnome who loves to build things. He runs a construction company that specializes in building bridges.|\n| 47 | Ulysses | Ulysses is a wise gnome who is full of knowledge. He runs a library that contains rare and ancient tomes.|\n| 48 | Vesper | Vesper is an evening-loving gnome who works as a bartender. She serves fanciful cocktails and often moonlights as a gin-based chemist.|\n| 49 | Whimzy | Whimzy is an eccentric gnome who is always doing strange things. She runs a curiosity shop that sells weird and unusual trinkets.|\n| 50 | Xylo | Xylo is a musical gnome who plays the xylophone. He is always looking for new and interesting ways to play.|\n| 51 | Yolanda | Yolanda is a fashion-forward gnome who runs a clothing boutique. She designs all her own clothes and is always ahead of the trends.|\n| 52 | Ziggy | Ziggy is a kaleidoscope-eyed gnome who runs a crystal shop. She sells all sorts of gemstones and crystals.|\n| 53 | Alaric | Alaric is a burly gnome who works as a bouncer. He is always on the lookout for troublemakers.|\n| 54 | Bashful | Bashful is a timid gnome who is scared of his own shadow. He works as a gardener and spends his days tending to the flowers.|\n| 55 | Crunch | Crunch is a tough gnome who works as a lumberjack. He chops down trees with his trusty axe.|\n| 56 | Dink | Dink is a happy gnome who works as a toy maker. He creates whimsical toys that delight children.|\n| 57 | Eris | Eris is a mysterious gnome who runs a fortune-telling business. She gazes into a crystal ball and predicts people's futures.|\n| 58 | Flare | Flare is a charismatic gnome who runs a circus. He is always performing death-defying stunts and entertaining the masses.|\n| 59 | Grimble | Grimble is a dour gnome who works as a gravedigger. He has a macabre sense of humor and loves to tell spooky stories.|\n| 60 | Hooch | Hooch is a tipsy gnome who works as a brewer. He creates delicious beer that is sold at the local tavern.|\n| 61 | Ida | Ida is a sensible gnome who works as a nurse. She is always ready to help people when they are sick or injured.|\n| 62 | Jojo | Jojo is a wild gnome who works as a zookeeper. She takes care of all sorts of exotic animals.|\n| 63 | Kiri | Kiri is a friendly gnome who runs a tea shop. She offers a wide variety of teas and is always happy to chat with customers.|\n| 64 | Lolly | Lolly is a bubbly gnome who works as a candy maker. She creates delicious treats that are sold at the local market.|\n| 65 | Mojo | Mojo is a magical gnome who runs a magic shop. He sells all sorts of enchanted items.|\n| 66 | Nimbus | Nimbus is a dreamy gnome who reads fortunes in the clouds. She gazes into the sky and interprets the formations.|\n| 67 | Otto | Otto is a gruff gnome who works as a blacksmith. He creates weapons and armor for the local soldiers.|\n| 68 | Perry | Perry is an adventurous gnome who has sailed the seven seas. He now runs a shipping company that specializes in exotic goods.|\n| 69 | Quim | Quim is a curious gnome who runs a curiosity shop. He sells all sorts of strange and unusual items.|\n| 70 | Remy | Remy is a crafty gnome who runs a jewelry shop. She creates beautiful trinkets that are sold at high-end boutiques.|\n| 71 | Saffron | Saffron is a spicy gnome who runs a restaurant. She serves exotic dishes from all over the world.|\n| 72 | Tamsin | Tamsin is an earthy gnome who runs a farm. She raises all sorts of animals and grows all sorts of vegetables.|\n| 73 | Uriah | Uriah is a wise gnome who runs a school. He teaches young gnomes about history, science, and magic.|\n| 74 | Velvet | Velvet is a luxurious gnome who runs a textile business. She creates beautiful fabrics that are sold at high-end shops.|\n| 75 | Winston | Winston is a stodgy gnome who works as a bank teller. He is always impeccably dressed and takes his job very seriously.|\n| 76 | Xanthe | Xanthe is a quirky gnome who runs a pet store. She sells all sorts of exotic animals and has a soft spot for snakes.|\n| 77 | Yannis | Yannis is a precise gnome who runs a clock shop. He creates and repairs all types of timepieces.|\n| 78 | Zane | Zane is a flashy gnome who owns a strip club. He is known for his lavish lifestyle and expensive cars.|\n| 79 | Arlo | Arlo is a dashing gnome who works as a fencing instructor. He teaches swordsmanship to the local knights.|\n| 80 | Bree | Bree is a breezy gnome who works as a ship captain. She sails from port to port and trades goods.|\n| 81 | Clio | Clio is a serious gnome who runs a museum. She collects and displays all sorts of ancient artifacts.|\n| 82 | Darcy | Darcy is a fashionable gnome who works as a hair stylist. She creates all sorts of trendy hairstyles.|\n| 83 | Enoch | Enoch is a pious gnome who works as a priest. He tends to the spiritual needs of the community.|\n| 84 | Fern | Fern is a nature-loving gnome who runs a floral business. She designs beautiful arrangements for weddings and special events.|\n| 85 | Goro | Goro is a martial gnome who works as a sensei. He teaches the art of self-defense at his dojo.|\n| 86 | Halcyon | Halcyon is a peaceful gnome who runs a meditation center. She offers classes in mindfulness and relaxation.|\n| 87 | Iris | Iris is a whimsical gnome who runs a toy store. She sells all sorts of fanciful toys that spark the imagination.|\n| 88 | Jules | Jules is an artistic gnome who works as a photographer. She captures beautiful moments and creates stunning portraits.|\n| 89 | Kaida | Kaida is a fiery gnome who works as a firefighter. She bravely fights fires and saves lives.|\n| 90 | Luna | Luna is a celestial gnome who runs an observatory. She gazes at the stars and studies the heavens.|\n| 91 | Mika | Mika is a mercurial gnome who works as a bartender. She creates delicious cocktails that are works of art.|\n| 92 | Nellie | Nellie is a nurturing gnome who works as a midwife. She helps bring new life into the world.|\n| 93 | Orion | Orion is a stoic gnome who works as a park ranger. He protects the natural beauty of the park.|\n| 94 | Piper | Piper is a melodious gnome who plays the flute. She performs in orchestras and at weddings.|\n| 95 | Quilla | Quilla is a mysterious gnome who works as a spy. She gathers secrets and information for the government.|\n| 96 | Rowan | Rowan is a resourceful gnome who runs a recycling center. She turns trash into treasure.|\n| 97 | Solstice | Solstice is a spiritual gnome who runs a new age store. She sells all sorts of crystals, tarot cards, and other mystical items.|\n| 98 | Tesla | Tesla is an inventive gnome who runs an electricity company. He harnesses the power of lightning.|\n| 99 | Una | Una is a nurturing gnome who works as a nursemaid. She takes care of the young and the elderly.|\n| 100 | Vida | Vida is a vibrant gnome who runs a fitness center. She offers classes in yoga, dance, and exercise. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01-05 | Grub | This goblin has a voracious appetite and is always found munching on something. |\n| 06-10 | Squig | Named for the unusual pet he keepsa small and very squiggly creature that he treasures. |\n| 11-15 | Grot | Grot is always tinkering with machines and gadgets, hoping to create something that will impress the tribe's leader. |\n| 16-20 | Scab | This goblin has numerous scars and scabs on his skin, evidence of his numerous brawls and battles. |\n| 21-25 | Snik | This goblin has a penchant for sneaking around and is constantly trying to gain information on the tribe's enemies. |\n| 26-30 | Drog | Drog is one of the larger goblins in the tribe, and he uses his size to intimidate and bully the others. |\n| 31-35 | Flik | Flik is quick-witted and always has a quip at the ready, especially when it comes to making fun of other goblins. |\n| 36-40 | Razzle | This goblin loves to gamble and is always trying to start a card game or bet on the outcome of a battle. |\n| 41-45 | Snag | Snag's fingers are incredibly nimble, making him the tribe's best pickpocket and thief. |\n| 46-50 | Skit | Skit is easily distracted and often wanders off during important meetings or battles. |\n| 51-55 | Spug | This goblin is particularly ugly, with a twisted face and a large, bulbous nose. |\n| 56-60 | Klik | Klik is the tribe's shaman and is always brewing up strange potions and casting unusual spells. |\n| 61-65 | Grix | Grix is the tribe's best hunter and is always tracking prey through the forest or plains. |\n| 66-70 | Zit | Zit is constantly scratching at his skin, which is covered in all manner of rashes and bumps. |\n| 71-75 | Snarl | Snarl is known for his fierce temper and is always looking for a fight. |\n| 76-80 | Droop | Droop is one of the weaker goblins in the tribe, and is often bullied and pushed around by the others. |\n| 81-85 | Snot | This goblin is constantly sniffling and has a perpetually runny nose. |\n| 86-90 | Razz | Razz is known for his strange and unpredictable behavior, which often gets him into trouble. |\n| 91-95 | Gob | Gob is obsessed with finding shiny objects and is always stealing trinkets and baubles from the other goblins. |\n| 96-99 | Snig | Snig is the tribe's leader, and is known for his cunning and strategic thinking. |\n| 100 | Wart | Wart is the oldest goblin in the tribe, with numerous scars and warts on his body. Despite his age, he is still a formidable warrior. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 01         | Gronn | A towering Goliath with rippling muscles and a deep, booming voice. His skin is a dark, stormy gray and his hair is black as coal. He carries a massive greatsword on his back and speaks little, but when he does it is with authority and conviction. |\n| 02         | Thokk | Thokk is a Goliath shaman with the ability to control the elements. He can summon lightning, create gusts of wind, and call forth torrents of rain. He wears robes made of animal skins and carries a staff covered in glowing runes. Despite his fierce demeanor, Thokk is wise and kind-hearted. |\n| 03         | Korg | Korg is a Goliath warrior with a fierce reputation. He is covered in scars, evidence of countless battles fought and won. He carries a pair of massive axes and wears a suit of spiked plate armor. Korg is loud, brash, and unafraid to charge into battle against overwhelming odds. |\n| 04         | Hulda | A hulking Goliath woman with broad shoulders and biceps like tree trunks. Her skin is a pale, icy blue and her hair is braided into intricate patterns. Hulda is a skilled blacksmith, crafting weapons and armor that are unmatched in quality. She speaks little, preferring to let her work speak for itself. |\n| 05         | Gorn | Gorn is a Goliath ranger with a deep love of nature. He is tall and lean, with skin the color of granite and eyes piercing like the trees he stalks through. He carries a bow made from elk horn and a quiver full of magical arrows. Gorn is slow to anger, but when he does it is like a storm unleashed. |\n| 06         | Ulfar | Ulfar is a Goliath bard with a gift for poetry and song. He carries a lyre made from mammoth ivory and sings of battles fought and victories won. Ulfar is a master of diplomacy, using his words to coax and persuade even the most stubborn of foes. |\n| 07         | Vorn | Vorn is a Goliath rogue with a talent for sneaking and stealing. He wears a cloak of shadow and carries a pair of daggers with blades that gleam like moonlight. Vorn is cunning and quick-witted, always looking for the next opportunity to acquire wealth and power. |\n| 08         | Freya | Freya is a Goliath druid with a connection to the pack animals of the tundra. She wears furs of wolves and bears, and her hair is adorned with feathers and antlers. Freya is fierce and wild, calling forth the spirits of the hunt to aid her in battle. |\n| 09         | Ragnar | Ragnar is a Goliath sorcerer with the ability to control fire. He wears a cloak of flickering flames and carries a staff of obsidian. Ragnar is quick to anger and even quicker to unleash his magical fury upon his enemies. |\n| 10         | Gunnar | Gunnar is a Goliath paladin with a devotion to the gods of battle. He wears plate armor emblazoned with holy symbols and carries a greatsword that glows with divine power. Gunnar is fearless in the face of danger, unafraid to lay down his life in defense of his beliefs. |\n| 11         | Bjorn | Bjorn is a Goliath monk with a mastery of martial arts. He wears simple robes and carries nothing but his own body weight. Bjorn is quiet and contemplative, but his movements in combat are like the flowing of water. |\n| 12         | Ingrid | Ingrid is a Goliath cleric with a deep connection to the earth. She wears robes made from natural fibers and carries a staff of oak. Ingrid is wise and compassionate, using her powers of healing to aid those in need. |\n| 13         | Leif | Leif is a Goliath barbarian with a ferocious rage. He wears little armor, preferring the freedom of movement. Leif is unpredictable, his anger flaring up at the slightest provocation. |\n| 14         | Sven | Sven is a Goliath scholar with a passion for history. He wears spectacles and carries a leather-bound tome filled with ancient lore. Sven is curious and inquisitive, always seeking knowledge about the world and its many mysteries. |\n| 15         | Sigrid | Sigrid is a Goliath fighter with a cruel streak. She wears spiked armor and carries a whip made from dragonhide. Sigrid takes pleasure in the pain of her enemies, seeking to dominate and control them through fear. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01 | Alexia | A quiet and reserved half-elf, with a sharp mind and piercing gaze. She wears her long, dark hair in a braid and is never seen without a book in hand. |\n| 02 | Asher | A skilled archer with a laid-back personality. He's known for his quick wit and tendency to improvise on the fly. |\n| 03 | Bryn | A charismatic half-elf with a penchant for storytelling. His tales are embellished with magic, humor, and a dash of danger. |\n| 04 | Callista | A fierce and independent half-elf who isn't afraid to speak her mind. Her fiery personality matches the flame-red color of her hair. |\n| 05 | Darian | A contemplative half-elf who spends his time analyzing the world around him. He has a talent for divination magic and often provides guidance to those who seek it. |\n| 06 | Elara | A talented musician who roams the countryside, performing at fairs and inns. Her lilting voice and haunting melodies have earned her a small but adoring fanbase. |\n| 07 | Gwendolyn | A devout follower of Pelor who spends her days healing the sick and injured. Her gentle nature and kind words are a balm to those in need. |\n| 08 | Kael | A fierce warrior who seeks out challenges to test his mettle. He has a jovial personality and loves to laugh and sing. |\n| 09 | Lirien | A shy and introverted half-elf who finds solace in nature. She has a natural talent for animal handling and can often be found tending to injured creatures. |\n| 10 | Tristan | A half-elf rogue with a devil-may-care attitude. He's a smooth talker and has a knack for getting himself out of sticky situations. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| Dice Value |    Name   | Description                                                                                                                          |\n|:----------:|:---------:|:------------------------------------------------------------------------------------------------------------------------------------:|\n|      01    |  Grommash | Grommash is a hulking half-orc with rippling muscles and a menacing scowl. His deep voice booms like thunder, and he has a fierce reputation as a warrior. |\n|      02    |    Gruk   | Gruk is a gruff half-orc with a crooked nose and a jagged scar on his cheek. He has a foul temper and a knack for violence, but he is also fiercely loyal to those he trusts. |\n|      03    |  Thrakgar | Thrakgar is a stoic half-orc with a shaved head and a bushy black beard. He speaks little, but when he does, his words carry weight. He is a skilled blacksmith and takes great pride in his work. |\n|      04    |  Korgath  | Korgath is a massive half-orc with bulging muscles and a fearsome presence. He is a gladiator by trade and has fought in many bloody battles. Despite his brutish exterior, he has a soft spot for animals and is known to adopt stray cats and dogs. |\n|      05    |   Garash  | Garash is a wiry half-orc with a bald head and a scruffy beard. He is a skilled thief and has a knack for finding hidden treasure. He is always on the lookout for his next score. |\n|      06    |  Hrogath  | Hrogath is a scarred half-orc with a missing eye and a wicked grin. He is a master of dirty tactics and will stop at nothing to win a fight. But he also has a playful side and enjoys playing pranks on his friends. |\n|      07    | Grimgor   | Grimgor is a bulky half-orc with a bushy beard and a booming laugh. He is a lumberjack by trade and has a talent for felling trees with a single swing of his axe. He loves nothing more than a hearty meal and a mug of ale at the end of a long day. |\n|      08    |  Rorakar | Rorakar is a lean half-orc with a shaved head and a quick wit. He is a skilled bard and has a beautiful singing voice. He is also a bit of a ladies' man and loves to flirt with anyone who catches his eye. |\n|      09    | Mugrath   | Mugrath is a burly half-orc with a wild mane of hair and piercing blue eyes. He is a wandering mercenary and will take on any job for the right price. He has a soft spot for children and will often give them sweets from his pocket. |\n|      10    |   Urzul   | Urzul is a grizzled half-orc with a thick beard and a rough demeanor. He is a skilled tracker and has a talent for picking up the slightest scent on the wind. He is fiercely protective of his friends and will stop at nothing to keep them safe. |\n|      11    |  Grimlok  | Grimlok is a towering half-orc with a scarred face and piercing green eyes. He is a feared gladiator and has won many battles in the arena. Despite his reputation, he is deeply religious and prays to his deity every night before bed. |\n|      12    |  Gruumsh  | Gruumsh is a gruff half-orc with a broad chest and a deep voice. He is a retired soldier and has fought in many wars. He is a bit of a hardass, but he also has a soft side and enjoys painting landscapes in his free time. |\n|      13    |  Skragut  | Skragut is a grizzled half-orc with a missing ear and a deep scar across his chest. He is a skilled sailor and has sailed many seas in search of treasure. He has a knack for telling tall tales and loves to spin yarns to anyone who will listen. |\n|      14    |  Grommok | Grommok is a massive half-orc with an impressive beard and a booming laugh. He is a blacksmith by trade and has a talent for creating beautiful weapons and armor. He is also a bit of a prankster and loves to play practical jokes on his friends. |\n|      15    |   Grokka | Grokka is a fierce half-orc with a wild mane of hair and a piercing gaze. She is a skilled ranger and has a talent for tracking even the most elusive prey. She has a soft spot for nature and will fight tooth and nail to protect it. |\n|      16    |  Gruglok | Gruglok is a stoic half-orc with a shaved head and a stern expression. He is a skilled blacksmith and has a talent for creating intricate metalwork. He is deeply private and doesn't speak much, but he is fiercely loyal to his friends. |\n|      17    |  Gromgar | Gromgar is a grizzled half-orc with a jagged scar across his lip and a broken tusk. He is a retired gladiator and has won many battles in the arena. He is a bit of a drunkard and can often be found in the local tavern, regaling anyone who will listen with tales of his past glories. |\n|      18    |  Urgrath  | Urgrath is a lean half-orc with a scruffy beard and intense eyes. He is a traveling bard and has a talent for composing epic ballads. He is also an amateur poet and has a talent for writing heartfelt verses. |\n|      19    |  Gorzad   | Gorzad is a thick-bodied half-orc with a bald head and a gruff voice. He is a skilled blacksmith and has a talent for creating beautiful jewelry. He is fiercely protective of his craft and will stop at nothing to ensure that his creations are of the highest quality. |\n|      20    |  Ugthrak  | Ugthrak is a fierce half-orc with a wild mane of hair and glowing red eyes. He is a blackguard by trade and has a talent for intimidation. He is feared by many, but also respected for his unwavering loyalty to his comrades. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01-05 | Adalyn Puddifoot | A plump halfling with rosy cheeks and a desire to always be surrounded by delicious food. |\n| 06-10 | Barty Butterbur | A halfling with wild, curly hair and a knack for storytelling. He can spin a tale that will have you on the edge of your seat. |\n| 11-15 | Calla Goodbarrel | A cheerful halfling with a contagious laugh and a love for gardening. She's never without a bunch of flowers to brighten up a space. |\n| 16-20 | Dillan Greenhill | A quiet halfling with piercing green eyes and a talent for archery. He's often mistaken for being aloof, but really he's just deep in thought. |\n| 21-25 | Eliza Brushgather | A chatty halfling with a fondness for animals. Her pockets are always filled with treats for her furry friends. |\n| 26-30 | Finley Smallburrow | A mischievous halfling with a twinkle in his eye and a love for pranks. He means well, but sometimes his sense of humor can get the better of him. |\n| 31-35 | Gia Baggins | A studious halfling with a thirst for knowledge. She can often be found pouring over books and scrolls, searching for new information. |\n| 36-40 | Hobart Hornblower | A boisterous halfling with a booming voice and a love for singing. He's never met a tune he couldn't harmonize with. |\n| 41-45 | Idella Deepdelver | A serious halfling with a no-nonsense attitude when it comes to business. She's a skilled negotiator and always gets what her clients need. |\n| 46-50 | Jasper Thistlefoot | A halfling with a wild mop of hair and a love for adventure. He's always keen to explore new places and meet new people. |\n| 51-55 | Kiera Brownlock | A sweet-natured halfling with a gentle touch and a love for baking. Her cinnamon rolls are the best in town. |\n| 56-60 | Leif Tumblebelly | A curious halfling with a thirst for adventure. He's always searching for new experiences and loves learning about other cultures. |\n| 61-65 | Milly Muffinbottom | A kind-hearted halfling with a talent for healing. She's always happy to lend a helping hand to those in need. |\n| 66-70 | Nolan Meadowgrass | A calm and collected halfling with a talent for diplomacy. He's a skilled mediator who can smooth over almost any disagreement. |\n| 71-75 | Olive Applecheek | A bubbly halfling with a passion for fashion. She's always trying out new hairstyles and clothes, and loves giving makeovers to her friends. |\n| 76-80 | Piper Underhill | A bold halfling with a love for the outdoors. She's an expert tracker and can navigate even the trickiest of terrain. |\n| 81-85 | Quincy Quickfoot | A nimble halfling with lightning-fast reflexes. He's a skilled thief who can slip in and out of tight spots without detection. |\n| 86-90 | Rowan Leafcutter | A thoughtful halfling with a love for the written word. She's a talented writer and poet who can conjure up vivid images with her words. |\n| 91-95 | Sullivan Stonemoss | A gruff halfling with a heart of gold. He's a skilled blacksmith who takes great pride in his work and loves crafting new weapons and armor. |\n| 96-99 | Tansy Wheatstraw | A lively halfling with a love for music. She's a talented bard who can captivate an audience with her songs and stories. |\n| 100 | Wilbur Widdershins | A shy halfling with a love for tinkering. He's a skilled inventor who's always coming up with new gadgets and gizmos.  |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01 | Zolg | A muscular hobgoblin with scars on his face and tattoos covering his arms. He wears a studded leather armor and carries a wicked looking battle-axe. |\n| 02 | Kresh | A hobgoblin with sharp features and piercing eyes. He wears a red cloak and carries a longbow with a quiver full of arrows on his back. |\n| 03 | Grimgor | A hobgoblin with a bald head and a thick beard. He wears a chainmail shirt and a spiked helmet. His weapon of choice is a morningstar. |\n| 04 | Urguk | A large hobgoblin with a crooked nose and a lazy eye. He wears a black plate armor and carries a tower shield and a shortsword. |\n| 05 | Barguk | A hobgoblin with a thin frame and nimble fingers. He wears a dark green leather armor and carries a shortbow and a rapier. |\n| 06 | Grommok | A hobgoblin with a scarred face and a deep voice. He wears a purple robe and carries a wand of magic missiles. |\n| 07 | Drog | A hobgoblin with a thick neck and a low brow. He wears a chain shirt and carries a greataxe that looks almost too big for him. |\n| 08 | Skugg | A hobgoblin with a long hair and a pointed chin. He wears a brown tunic and carries a sling and a pouch full of rocks. |\n| 09 | Vorguk | A hobgoblin with a broken tusk and a permanent sneer. He wears a breastplate and carries a halberd. |\n| 10 | Krak | A hobgoblin with a shaved head and a scar across his forehead. He wears a black cloak and carries a crossbow and a shortsword. |\n| 11 | Gorbag | A hobgoblin with a hunchback and a twisted leg. He wears a patchwork armor and carries a flail. |\n| 12 | Snik | A hobgoblin with a missing eye and a metal plate covering half of his face. He wears a fur cloak and carries a handaxe. |\n| 13 | Rokk | A hobgoblin with a well-groomed mustache and a goatee. He wears a blue tunic and carries a buckler and a dagger. |\n| 14 | Uzguk | A hobgoblin with a long beard and a big belly. He wears a sleeveless shirt and carries a club. |\n| 15 | Haguk | A hobgoblin with a bald head and a sharp tongue. He wears a white linen shirt and carries a sling and a dagger. |\n| 16 | Krugg | A hobgoblin with a thick beard and a bushy hair. He wears a brown cloak and carries a javelin. |\n| 17 | Mogh | A hobgoblin with a hooked nose and a bad breath. He wears a leather vest and carries a net and a trident. |\n| 18 | Throg | A hobgoblin with a bony face and a high-pitched voice. He wears a purple robe and carries a staff of fire. |\n| 19 | Drogg | A hobgoblin with a bad temper and a good nose. He wears a chainmail shirt and carries a longsword. |\n| 20 | Krakk | A hobgoblin with a long hair and a crooked smile. He wears a black leather armor and carries a sling and a dagger. |\n| 21 | Zog | A hobgoblin with a scarred eye and a twisted mouth. He wears a bronze helmet and carries a spear. |\n| 22 | Moguk | A hobgoblin with a big nose and a quick wit. He wears a blue cloak and carries a shortbow and a quiver of arrows. |\n| 23 | Borguk | A hobgoblin with a red hair and a bushy beard. He wears a silver chainmail and carries a mace. |\n| 24 | Gorgoth | A hobgoblin with a hooked jaw and a piercing glare. He wears a black cloak and carries a longbow and a sword. |\n| 25 | Korg | A hobgoblin with a bald head and a thick neck. He wears a chain shirt and carries a battle-axe. |\n| 26 | Zagg | A hobgoblin with a sharp tongue and a keen mind. He wears a black leather armor and carries a shortbow and a quiver of arrows. |\n| 27 | Robguk | A hobgoblin with a bald head and a bushy beard. He wears a brown cloak and carries a shortsword and a shield. |\n| 28 | Hrag | A hobgoblin with a crooked nose and a pointy chin. He wears a green tunic and carries a blowgun and a pouch of darts. |\n| 29 | Grugg | A hobgoblin with a bumpy forehead and a thick skull. He wears a scale mail and carries a morningstar. |\n| 30 | Orguk | A hobgoblin with a red beard and a rosy complexion. He wears a leather vest and carries a crossbow and a quiver of bolts. |\n| 31 | Snagg | A hobgoblin with a sharp mind and a devious smile. He wears a purple robe and carries a wand of fear. |\n| 32 | Rogg | A hobgoblin with a scarred face and a golden earring. He wears a chain shirt and carries a longsword. |\n| 33 | Korgoth | A hobgoblin with a hooked nose and a sneaky look. He wears a black hooded cloak and carries a hand crossbow. |\n| 34 | Ugg | A hobgoblin with a bald head and a bushy mustache. He wears a blue tunic and carries a quarterstaff. |\n| 35 | Grukk | A hobgoblin with a fierce temper and a short fuse. He wears a patchwork armor and carries a broadsword. |\n| 36 | Vog | A hobgoblin with a big belly and a hearty laugh. He wears a red linen shirt and carries a warhammer. |\n| 37 | Nagg | A hobgoblin with a squinty eye and a raspy voice. He wears a black leather armor and carries a shortbow and a quiver of arrows. |\n| 38 | Drogug | A hobgoblin with a broken nose and a thick skull. He wears a bronze helmet and carries a greataxe that looks almost too big for him. |\n| 39 | Morg | A hobgoblin with a wiry frame and a sharp wit. He wears a green cloak and carries a sling and a pouch full of rocks. |\n| 40 | Horg | A hobgoblin with a bald head and a scar across his cheek. He wears a blue tunic and carries a trident. |\n| 41 | Zorg | A hobgoblin with a crooked smile and a twitchy nose. He wears a silver chainmail and carries a shortsword. |\n| 42 | Vagg | A hobgoblin with a thick neck and a red hair. He wears a sleeveless shirt and carries a club. |\n| 43 | Grogg | A hobgoblin with a scar on his forehead and a gruff voice. He wears a brown cloak and carries a crossbow and a quiver of bolts. |\n| 44 | Krokk | A hobgoblin with a bald head and a sharp chin. He wears a black leather armor and carries a shortsword and a shield. |\n| 45 | Throgg | A hobgoblin with a pointy nose and a sharp tongue. He wears a chain shirt and carries a warhammer. |\n| 46 | Torg | A hobgoblin with a bald head and a jagged scar on his cheek. He wears a leather vest and carries a spear. |\n| 47 | Kurg | A hobgoblin with a bushy beard and a big nose. He wears a brown tunic and carries a sling and a pouch full of rocks. |\n| 48 | Zigg | A hobgoblin with a sharp mind and a cunning look. He wears a purple robe and carries a spellbook. |\n| 49 | Mugg | A hobgoblin with a bald head and a flat nose. He wears a green cloak and carries a longbow and a quiver of arrows. |\n| 50 | Pogg | A hobgoblin with a squat frame and a big belly. He wears a patchwork armor and carries a mace. |\n| 51 | Krugguk | A hobgoblin with a bald head and a thick beard. He wears a chainmail shirt and carries a halberd. |\n| 52 | Zugg | A hobgoblin with a hooked nose and a thick neck. He wears a black leather armor and carries a shortsword. |\n| 53 | Grukkug | A hobgoblin with a thick skull and a bumpy forehead. He wears a silver helmet and carries a greataxe. |\n| 54 | Hogg | A hobgoblin with a muscular build and a scarred face. He wears a brown leather armor and carries a net and a trident. |\n| 55 | Dugg | A hobgoblin with a bald head and a scar across his lip. He wears a leather vest and carries a hand crossbow. |\n| 56 | Karg | A hobgoblin with a sharp tongue and a bad reputation. He wears a black cloak and carries a shortbow and a quiver of arrows. |\n| 57 | Slogg | A hobgoblin with a thick neck and a bulging forehead. He wears a chain shirt and carries a warhammer. |\n| 58 | Vorg | A hobgoblin with a bald head and a crooked nose. He wears a red tunic and carries a longsword. |\n| 59 | Norguk | A hobgoblin with a sneaky look and a crafty mind. He wears a brown cloak and carries a shortsword and a shield. |\n| 60 | Krogg | A hobgoblin with a sharp mind and a quick reflexes. He wears a green linen shirt and carries a shortbow and a quiver of arrows. |\n| 61 | Morguk | A hobgoblin with a bald head and a wild beard. He wears a black leather armor and carries a battle-axe. |\n| 62 | Hugg | A hobgoblin with a big nose and a dry skin. He wears a chainmail shirt and carries a halberd. |\n| 63 | Rugg | A hobgoblin with a bald head and a pointy chin. He wears a brown tunic and carries a club. |\n| 64 | Zorguk | A hobgoblin with a hook nose and a cruel smile. He wears a silver chainmail and carries a longsword. |\n| 65 | Tug | A hobgoblin with a bald head and a thick neck. He wears a leather vest and carries a sling and a pouch full of rocks. |\n| 66 | Dagg | A hobgoblin with a scarred face and a broken jaw. He wears a purple robe and carries a wand of lightning. |\n| 67 | Korguk | A hobgoblin with a bald head and a bushy mustache. He wears a black cloak and carries a crossbow and a quiver of bolts. |\n| 68 | Fug | A hobgoblin with a big nose and a rotten teeth. He wears a brown leather armor and carries a shortsword and a shield. |\n| 69 | Ralguk | A hobgoblin with a bald head and a crooked back. He wears a patchwork armor and carries a mace. |\n| 70 | Horguk | A hobgoblin with a crooked smile and a sharp mind. He wears a blue tunic and carries a trident. |\n| 71 | Mogg | A hobgoblin with a bald head and a flat nose. He wears a green cloak and carries a quarterstaff. |\n| 72 | Gogg | A hobgoblin with a crooked nose and a sneaky look. He wears a chain shirt and carries a handaxe. |\n| 73 | Vugg | A hobgoblin with a bald head and a thick neck. He wears a black leather armor and carries a warhammer. |\n| 74 | Snog | A hobgoblin with a thin frame and a quick wit. He wears a brown cloak and carries a shortbow and a quiver of arrows. |\n| 75 | Zorgoth | A hobgoblin with a sharp tongue and a cruel mind. He wears a silver chainmail and carries a longsword. |\n| 76 | Korgoth | A hobgoblin with a bald head and a hooked jaw. He wears a black cloak and carries a crossbow and a quiver of bolts. |\n| 77 | Roguk | A hobgoblin with a thick skull and a bumpy forehead. He wears a chainmail shirt and carries a greataxe. |\n| 78 | Zugguk | A hobgoblin with a crooked nose and a sneering look. He wears a brown cloak and carries a shortsword and a shield. |\n| 79 | Gugg | A hobgoblin with a bald head and a muscular build. He wears a scale mail and carries a halberd. |\n| 80 | Vorgoth | A hobgoblin with a hooked nose and a sharp tongue. He wears a purple robe and carries a wand of magic missiles. |\n| 81 | Snagguk | A hobgoblin with a bald head and a twitchy eye. He wears a black leather armor and carries a shortbow. |\n| 82 | Hrogg | A hobgoblin with a crooked smile and a bushy chin. He wears a brown tunic and carries a quarterstaff. |\n| 83 | Morgoth | A hobgoblin with a bald head and a crooked nose. He wears a black cloak and carries a shortsword. |\n| 84 | Kogg | A hobgoblin with a big nose and a sharp mind. He wears a blue tunic and carries a warhammer. |\n| 85 | Frugg | A hobgoblin with a bald head and a thick beard. He wears a silver chainmail and carries a longsword. |\n| 86 | Zogg | A hobgoblin with a sharp tongue and a hooked nose. He wears a black leather armor and carries a shortbow and a quiver of arrows. |\n| 87 | Crogg | A hobgoblin with a bald head and a twisted mouth. He wears a chain shirt and carries a halberd. |\n| 88 | Throguk | A hobgoblin with a crooked smile and a sharp tongue. He wears a brown cloak and carries a crossbow and a quiver of bolts. |\n| 89 | Mugguk | A hobgoblin with a bald head and a big nose. He wears a green cloak and carries a shortsword and a shield. |\n| 90 | Gurguk | A hobgoblin with a sharp mind and a quick wit. He wears a black cloak and carries a hand crossbow. |\n| 91 | Zuggoth | A hobgoblin with a bald head and a crooked back. He wears a silver helmet and carries a battle-axe. |\n| 92 | Hugguk | A hobgoblin with a thick neck and a sharp chin. He wears a brown leather armor and carries a shortbow. |\n| 93 | Rog | A hobgoblin with a scarred face and a missing ear. He wears a chain shirt and carries a trident. |\n| 94 | Rogoth | A hobgoblin with a bald head and a twisted leg. He wears a black cloak and carries a crossbow and a quiver of bolts. |\n| 95 | Krog | A hobgoblin with a sharp tongue and a crooked smile. He wears a brown tunic and carries a spear. |\n| 96 | Zag | A hobgoblin with a bald head and a hooked jaw. He wears a green linen shirt and carries a shortbow and a quiver of arrows. |\n| 97 | Vogg | A hobgoblin with a sharp mind and a sneering look. He wears a black robe and carries a wand of fire. |\n| 98 | Kruggoth | A hobgoblin with a bald head and a scar across his cheek. He wears a chainmail shirt and carries a longsword. |\n| 99 | Flogguk | A hobgoblin with a bushy beard and a burly build. He wears a brown cloak and carries a club. |\n| 100 | Zragg | A hobgoblin with a scar across his forehead and a missing tooth. He wears a black leather armor and carries a handaxe. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n\nChatbot reponse terminated unexpectedly: : The request was canceled due to the configured HttpClient.Timeout of 100 seconds elapsing.\r\n\nSystem message: : You are a game master who helps other game masters develop rolltables to help them run their games.  Responses should be limited to what was specifically asked for.  Do not include introduction or closing text.  All generated tables should be in markdown format.  Do not surround any markdown text with fenced code blocks.\r\n\nUser message: : Generate a d100 rolltable in markdown format for the following:\nTopic: NPC names and descriptions\nRace: Human\nGenre: Fantasy\nGame System: Dungeons and Dragons 5e\nSentiment: On a sentiment scale of 1 to 10, where 1 represents a very precise and serious reponse and 10 represents a whimsical reponse, please generate reponses with a sentiment rating of 2\nTable Structure: Table should have three columns: dice value, name, description.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:--------:|:---------------:|\n| 1              | Ahzruk     | Green-scaled kobold with sharp claws and a cunning look in the eyes. |\n| 2              | Dhakidd     | Wiry kobold with a thin tail and a perpetual smirk on their face. |\n| 3              | Gekk       | Short, stocky, and heavily muscled kobold with a no-nonsense attitude. |\n| 4              | Hakkik     | Purple scaled kobold with a love for all things shiny and a knack for pilfering. |\n| 5              | Ikkin       | Sinewy kobold with jagged teeth and a reputation for being fiercely competitive. |\n| 6              | Kekkon     | Large and brawny kobold with a long, bushy tail and a love for ale. |\n| 7              | Mynak       | Timid and scrawny kobold with a talent for lockpicking and a propensity to tremble under stress. |\n| 8              | Nakkik     | Smooth-skinned kobold with a love of wyvern-riding and a lust for adventure. |\n| 9              | Rikkin       | Slender and agile kobold with a talent for stealth and a penchant for practical jokes. |\n| 10            | Zekkon     | Yellow-skinned kobold with a sharp tongue and a quick wit. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n\nChatbot reponse terminated unexpectedly: : The request was canceled due to the configured HttpClient.Timeout of 100 seconds elapsing.\r\n\nSystem message: : You are a game master who helps other game masters develop rolltables to help them run their games.  Responses should be limited to what was specifically asked for.  Do not include introduction or closing text.  All generated tables should be in markdown format.  Do not surround any markdown text with fenced code blocks.\r\n\nUser message: : Generate a d100 rolltable in markdown format for the following:\nTopic: NPC names and descriptions\nRace: Lizardfolk\nGenre: Fantasy\nGame System: Dungeons and Dragons 5e\nSentiment: On a sentiment scale of 1 to 10, where 1 represents a very precise and serious reponse and 10 represents a whimsical reponse, please generate reponses with a sentiment rating of 2\nTable Structure: Table should have three columns: dice value, name, description.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 01         | Groth  | Groth is a fierce orc warrior covered in scars from countless battles. His reputation precedes him, instilling fear in all who hear his name.|\n| 02         | Hrogar  | Hrogar is a brutish orc who delights in causing chaos wherever he goes. He is fiercely loyal to his tribe and will do whatever it takes to protect them. |\n| 03         | Urthak  | Urthak is a towering orc with rippling muscles and a deep, booming voice. He is a natural leader and commands the respect of those around him. |\n| 04         | Korgath  | Korgath is a grizzled veteran of many battles. He has seen it all and is quick to make the tough decisions when they need to be made. |\n| 05         | Gruumsh  | Gruumsh is a devout follower of the orc god of the same name. He is fanatically devoted to his religion and will stop at nothing to see his god's will done. |\n| 06         | Skarr  | Skarr is a small but scrappy orc who has a reputation for punching above his weight. He is known for his quick wit and clever thinking in battle. |\n| 07         | Grumshak  | Grumshak is a shaman who draws his power from the spirits of the earth. He is a wise and respected member of his tribe, often sought out for his guidance. |\n| 08         | Brug  | Brug is a massive orc who moves like a freight train. He is slow to anger but when he does lose his temper, chaos ensues. |\n| 09         | Thokk  | Thokk is a skilled hunter and tracker who has honed his senses to a razor's edge. He is a valuable member of his tribe, able to provide food and security. |\n| 10         | Grommash  | Grommash is a cunning orc who is always looking for an angle. He is a skilled negotiator and is often sent out as an emissary to other tribes. |\n| 11         | Drog  | Drog is a simple orc who is content with the simple pleasures in life, such as food, drink, and a good fight. |\n| 12         | Krug  | Krug is a stoic orc who rarely speaks but whose actions speak volumes. He is a fierce fighter and a valued member of his tribe. |\n| 13         | Mok'har  | Mok'har is an orc spy who excels at gathering information. He is a master of disguise and is often able to infiltrate enemy camps undetected. |\n| 14         | Gul'dan  | Gul'dan is a warlock who has made a dark pact with demonic powers. He is feared and reviled by many of his fellow orcs, but his power cannot be denied. |\n| 15         | Shagrath  | Shagrath is an orc who has turned to a life of banditry. He is a skilled thief and a ruthless killer, preying on anyone who crosses his path. |\n| 16         | Gorg  | Gorg is a diplomat who has been sent to negotiate with other tribes and races. He is a skilled negotiator, able to find common ground even with those who seem diametrically opposed. |\n| 17         | Thraxx  | Thraxx is an orc berserker who fights with a frenzied abandon, hurling himself at his enemies without thought for his own safety. |\n| 18         | Grimfang  | Grimfang is an orc assassin who is feared by many. He is a master of disguise and is often able to get in close to his targets before striking. |\n| 19         | Garokk  | Garokk is an orc merchant who travels from town to town, selling weapons, armor, and other goods to anyone who will pay. |\n| 20         | Gorn  | Gorn is a massive orc who towers over his opponents. He is slow and lumbering but his strength is unmatched. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n\nChatbot reponse terminated unexpectedly: : The request was canceled due to the configured HttpClient.Timeout of 100 seconds elapsing.\r\n\nSystem message: : You are a game master who helps other game masters develop rolltables to help them run their games.  Responses should be limited to what was specifically asked for.  Do not include introduction or closing text.  All generated tables should be in markdown format.  Do not surround any markdown text with fenced code blocks.\r\n\nUser message: : Generate a d100 rolltable in markdown format for the following:\nTopic: NPC names and descriptions\nRace: Tieflings\nGenre: Fantasy\nGame System: Dungeons and Dragons 5e\nSentiment: On a sentiment scale of 1 to 10, where 1 represents a very precise and serious reponse and 10 represents a whimsical reponse, please generate reponses with a sentiment rating of 2\nTable Structure: Table should have three columns: dice value, name, description.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}