{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "5e Rolltables",
  "description": "Prompt generated entities from ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n| Roll (d100) | Mishap |\n|-------------|---------------------------------------------------------|\n| 1-2 | You stumble and fall prone, becoming vulnerable to enemy attacks. |\n| 3-4 | Your attack goes wide, leaving you exposed and granting your enemies advantage on their next attack against you. |\n| 5-6 | Overexerting yourself, you take 1d4 strain damage. |\n| 7-8 | You lose grip on your weapon and it lands 10 feet away from you. |\n| 9-10 | You accidentally strike an unintended target within your reach. |\n| 11-12 | Your weapon takes damage, reducing its effectiveness until repaired. |\n| 13-14 | Your attack ricochets off your enemy and strikes you, dealing minimum weapon damage to yourself. |\n| 15-16 | You twist your ankle, reducing your movement speed by 10 feet until you receive healing. |\n| 17-18 | You strain your arm, and attacks with this arm suffer a disadvantage until you rest. |\n| 19-20 | Your attack leaves you open for a counter, the next attack against you has advantage. |\n| 21-22 | Your weapon gets lodged in the environment, requiring a strength check to free it. |\n| 23-24 | You overbalance and your movement speed is halved on your next turn. |\n| 25-26 | Distorted judgment causes you to become disoriented, suffering disadvantage on the next strength or dexterity check. |\n| 27-28 | Your ill-placed attack shatters environmental cover, possibly revealing hidden enemies. |\n| 29-30 | You exhaust yourself, you can perform only one action on your next turn. |\n| 31-32 | Your weapon becomes entangled with an adversary's weapon, both of them require a strength check to free. |\n| 33-34 | You inadvertently make a loud noise drawing unwanted attention. |\n| 35-36 | A misstep puts distance between you and your enemy, they can take one step back without provoking an attack of opportunity. |\n| 37-38 | Your overzealous attack leaves you dazed, you cannot take reactions until your next turn. |\n| 39-40 | Your weapon flies out of your hand, landing in a random direction 20 feet away. |\n| 41-42 | The enemy redirects your attack, you must succeed a strength saving throw or be pushed 5 feet back. |\n| 43-44 | You leave an opening in your defense, your AC is decreased by 2 until your next turn. |\n| 45-46 | You hit a weak structure in the environment, causing debris to fall and dealing 1d4 bludgeoning damage. |\n| 47-48 | You injure your hand, you have disadvantage on attack rolls until you receive healing. |\n| 49-50 | The strain of the attack makes you lose your breath, you cannot speak until your next turn. |\n| 51-100 | Your attack fails but produces no additional negative side effect. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Melee"
    },
    {
      "rawText": "## Ranged\r\n| d100 Roll | Mishap Due to Critical Failure on Ranged Attack |\n| --- | --- |\n| 1 | The string on your bow snaps, rendering it useless until repaired.\n| 2 | The projectile veers off course and hits an unintended target, roll for damage against the new target.\n| 3 | You stumble and fall prone, wasting your next turn getting up.\n| 4 | Your projectile ricochets off a hard surface, and you take half the attack damage.\n| 5 | Your weapon jams or malfunctions. Its use requires repair or clearing before further use.\n| 6 | The projectile launches backward, potentially hitting an ally. Roll a d20, on 10 or less, it hits an ally for half damage.\n| 7 | You lose your grip and your weapon flies out of your hand, landing 10 feet away from you. \n| 8 | You misjudge your target's position, giving it an opportunity attack against you.\n| 9 | Your lack of focus makes the next attack against you have an advantage.\n| 10 | The string on your bow becomes unstrung. It takes a full round to fix it.\n| 11 | You fail to notice a hazard in the environment; trip and fall, taking 1d6 bludgeoning damage.\n| 12 | A strong gust blows your projectile off course, effective range of all your ranged attacks reduce by half until end of your next turn.\n| 13 | Your misfire alerts nearby enemies to your location, expect reinforcements.\n| 14 | Your weapon breaks from stress, you need to repair it before its next use.\n| 15 | Your overdraw signficantly strains your muscles, reducing your Dexterity by 1 until you take a short or long rest.\n| 16 | You accidentally shoot an item in your inventory, roll a d10 to determine which item is damaged.\n| 17 | Your ammunition supply falls and scatters, you spend your next turn gathering it.\n| 18 | You tear a muscle from the effort, your attacks have disadvantage until you receive healing.\n| 19 | Your extensive focus on your target leaves you exposed, your AC is reduced by 2 until your next turn.\n| 20 | You accidentally injure your hand, dealing 1d4 damage to yourself.\n| 21-100 | No additional effect except for the failed attack. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| Roll (d100) | Mishap |\n| ------- | -------- |\n| 1 | Your spell gets twisted in the air, striking an unintended target in immediate vicinity |\n| 2 | You lose control over the spell energy. It implodes, silencing all magic within a 30-foot radius for 1 round |\n| 3 | A surge of uncontrolled magic is pulled to you causing the casting of a random spell |\n| 4 | A heavy drain of magical energy leaves you stunned for 1 round |\n| 5 | The spell misfires, rebounding back at you for half damage |\n| 6 | Your spell dubs and you are unable to cast that spell until the completion of a long rest |\n| 7 | You accidentally draw from your life force. Lose hit points equal to half of your level |\n| 8 | An arcane feedback loop forms. You cannot take reactions until your next turn |\n| 9 | Wild magic infuses your form temporarily, changing your physical appearance randomly for 1 hour |\n| 10 | Infernal energy infuses your spell, causing you to spontaneously speak in infernal language for 1 hour |\n| 11-20 | For the next minute, you lose the ability to speak, and spells you cast with verbal component fail |\n| 21-30 | The energies of your spell create mirages, giving everyone advantage on attack against you until your next turn |\n| 31-40 | You summon an elemental spirit which becomes hostile and attacks |\n| 41-50 | An unintended static field forms around you, pulling small objects towards you for 1 hour |\n| 51-60 | You are wrapped in a cocoon of swirling colours that lasts until you manage to cast a spell successfully |\n| 61-70 | Your spell cascades out of control, manifesting as a loud scream audible up to a mile away, drawing curiosity or danger |\n| 71-80 | Arcane dislocation happens, you are teleported 30 feet in a random direction |\n| 81-90 | Your spell causes colours around you to fade away, you are unable to see colours for the next 24 hours |\n| 91-95 | A magic-eating parasite is drawn to the misfired spell, attaches to you, draining your magic until removed |\n| 96-100 | A powerful magical being takes interest in your spell mishap, sending a minion to investigate |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1-2 |Aari | A stern Aarakocra warrior who never lets his guard down. Adorned in leather armor crafted from strange beasts, feathers a mix of white and brown depicting his lineage. |\n| 3-4 | Beaki | A calm, wise monk. Her plumage is dusky blue-grey and she often uses her wings to create a shroud-like hood while she meditates. |\n| 5-6 | Cirro | A curious traveler with soft white feathers who is constantly assessing his surroundings. His demeanor is standoffish and secretive. |\n| 7-8 | Dreko | A weathered, old Aarakocra who have seen countless battles. His feathers are largely gone, replaced by scars and calluses. |\n| 9-10 | Ellion | An enthusiastic and friendly Aarakocra that is always ready to help. His feathers are a vibrant yellow, reflecting his sunny personality. |\n| 11-12 | Fari | A female Aarakocra warrior, her feathers are a mix of bright red and orange. Her seriousness and uncompromising nature are well known among her peers. |\n| 13-14 | Gorro | A male Aarakocra hunter, known for his exceptional tracking skills. His feathers are brown and grey and his sharp eyes miss nothing. |\n| 15-16 | Hiiri | A healer Aarakocra with soothing sky-blue feathers. Hiiri is soft-spoken and empathetic, always willing to lend a helping wing to those in need. |\n| 17-18 | Ikko | Fastidious and meticulous, with plumage of a neat and uniform ochre colour, he serves as town record-keeper and historian. |\n| 19-20 | Jirri | A heavy-set Aarakocra, whose feathers have gone mostly grey. He runs one of the largest inns in the city. |\n| 21-22 | Kiira | An instructor who takes great pride in teaching young Aarakocra the art of flight. Her snow-white feathers signify her high status. |\n| 23-24 | Lorea | A cunning Aarakocra rogue, her dark brown and green plumage allows her to hide effectively in the trees. |\n| 25-26 | Mekko | Serving as the community's wise elder, his age shows in all facets. His grey-white feathers sag heavily, and his eyes are more clouded than clear. |\n| 27-28 | Nuri | A scholar whose plumage reflects her intellectual purviews, she meticulously maintains her feathers in the rich indigo colours of the teachers. |\n| 29-30 | Orra | A master craftsman famed for his skillful hands. His natural rich brown plumage is often covered in flecks of wood and metal shavings. |\n| 31-32 | Piri | A young, ambitious warrior, her fiery personality is reflected in her scarlet and gold plumage. |\n| 33-34 | Quillo | A merchant known for his wares that hail from distant lands. His wing feathers present an array of earthy tones. |\n| 35-36 | Rilla | A respected female guard captain whose deep blue-black plumage strikes an imposing figure. |\n| 37-38 | Suri | An elder priestess whose feathers have turned an almonded white with age. She is often seen tending to the community's spiritual needs. |\n| 39-40 | Tari | Calm and composed, this Aarakocra's feathers are dusky and her eyes steely; Tari earns her living as a bounty hunter. |\n| 41-42 | Uri | A charismatic Aarakocra with vibrant purple feathers. Uri is a well-renowned bard who loves sharing tales of adventure. |\n| 43-44 | Viri | Largely silent and isolated, Viri keeps her heavily mottled brown and black plumage cloaked in robes, out of sight. She is a known sorcerer. |\n| 45-46 | Wiri | The community's blacksmith. His feathers are singed in places, and beads of sweat often cling to this dark, gold-speckled plumage. |\n| 47-48 | Xerri | With feathers the color of bleached bone, Xerri is known as the white shadow, an assassin that has never been seen by its targets. |\n| 49-50 | Yirri | A shy Aarakocra with feathers as green as the canopy trees she prefers to live in. She is a skilled herbalist known for her unique potions. |\n| 51-52 | Zerri | A deceptively diminutive Aarakocra, whose petite stature hides a powerful magical ability. Her feathers glitter silver. |\n| 53-100 | (Repeat Names) | Varying descriptions based on the Aarakocra above, accounting for their many different careers, ranks, and personalities. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Seraphim | This Aasimar has a stern gaze and a commanding presence. Her golden eyes glint under the hood of her white cloak. |\n| 2 | Uriel | His silver hair is neatly combed and his celestial markings are clearly visible on his skin. He carries an aura of tranquility. |\n| 3 | Jophiel | This Aasimar is clad in leather armor, bearing symbols of a holy deity. Her vibrant, gold hair is set in a braid. |\n| 4 | Raphael | His azure eyes shimmer with a sense of knowledge and wisdom. His beige robe gives him a scholarly appearance. |\n| 5 | Gabriel | A strong and muscular Aasimar, Gabriel's steel blue eyes show a hint of his celestial lineage. |\n| 6 | Metatron | Known for his fair and just nature, Metatron's wings shimmer under the sunlight, reflecting his divine heritage. |\n| 7 | Raziel | This seemingly aloof Aasimar has flowing alabaster hair and his eyes radiate a mysterious glow. |\n| 8 | Anael | A skilled warrior, Anael has a robust figure and her eyes glow with an undeniable determination. |\n| 9 | Haniel | This Aasimar's silver hair is styled in a top knot, complementing his oriental inspired attire. |\n| 10 | Raguel | With burnished bronze skin and lustrous gold eyes, he exudes an air of nobility and honor. |\n| 11 | Chamuel | His battle-scarred armor does not hide the benevolent spirit radiating from his amethyst eyes. |\n| 12 | Zadkiel | Dressed in a royal blue mantle, this wise and elderly Aasimar carries an aura of calmness around him. |\n| 13 | Auriel | Her strict demeanor does not mask the compassion that lies within her. She dons a set of elegant plate armor. |\n| 14 | Ishim | Portraying an air of sophistication, Ishim's celestial markings make his noble lineage clear. |\n| 15 | Izidkiel | His crimson hair contrasts strikingly with his celestial markings. He carries a stern, yet understanding gaze. |\n| 16 | Sahaqiel | His elegant posture is unruffled by the heavy spear in his hands. He carries a countenance of unwavering resolution. |\n| 17 | Munkar | This Aasimar carries an air of silent contemplation. His crystal eyes and ash-gray hair hint at his celestial lineage. |\n| 18 | Leliel | Green eyes shimmering with a mystic light, she carries an aura of quiet assurance. |\n| 19 | Peliel | Wearing a golden circlet, this highly distinguished Aasimar has a steady and solemn gaze. |\n| 20 | Asaradel | His ice-blue eyes glisten with a mysterious light under his hooded cloak. A cryptic aura envelops him. |\n| .... | .... | .... |\n| 100 | Yophiel | With burning golden eyes and long silver hair, Yophiel is known for her wisdom and tranquility. She carries an aura of serene authority. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n| Dice Value | Name         | Description                                                                                                                        |\n|------------|--------------|------------------------------------------------------------------------------------------------------------------------------------|\n| 1-2        | Gurg         | A brooding Bugbear covered in scars and wearing patchwork armor.                                                                   |\n| 3-4        | Klak         | A towering Bugbear with deep-set eyes and twisted horns.                                                                           |\n| 5-6        | Bok          | An agile young Bugbear who brandishes a crude spear.                                                                               |\n| 7-8        | Murg         | A nervous Bugbear trembling from the raw energy of his magical ability.                                                            |\n| 9-10       | Vrash        | A stoic Bugbear warrior who wears a tattered red cape over his heavy armored chestplate.                                          |\n| 11-12      | Skrag        | A haggard Bugbear with cunning eyes, known for his expertise in setting traps.                                                     |\n| 13-14      | Grith        | A lean, mean Bugbear with a sharp mind and even sharper blades.                                                                    |\n| 15-16      | Snurg        | Burly Bugbear, his body well-muscled from years of voracious combat.                                                               |\n| 17-18      | Drag         | A jittery Bugbear with several jingle bells tied into his fuzzy mane.                                                              |\n| 19-20      | Flog         | A hefty Bugbear hunter with piercing green eyes.                                                                                   |\n| 21-22      | Zog          | A stocky Bugbear, with a resting face that portrays a deep-seated discontent with the world around him.                            |\n| 23-24      | Gruz         | Elderly Bugbear with a sage-like presence, adorned with ceremonial paint in recognition of the respect afforded to him by his tribe.|\n| 25-26      | Brag         | The proud chieftain of his Bugbear clan, with a commanding bellow almost as impressive as his colossal stature.                    |\n| 27-28      | Urg          | A stoic Bugbear with a gaze as hard as stone, carrying the burden of his past like a second set of armor.                          |\n| 29-30      | Kret         | A tribal shaman Bugbear, his body covered in painted symbols of power and devotion to his ancestors.                                |\n| 31-32      | Bog          | A Bugbear innkeeper with a friendly smile, known for weaving enchanting tales about his past exploits.                             |\n| 33-34      | Vrut         | A somber Bugbear who functions as the spiritual leader of his tribe, respected and held in awe by all members.                      |\n| 35-36      | Ugrat        | A Bugbear scribe with a particular affinity for ancient rune carving.                                                              |\n| 37-38      | Nark         | A Bugbear bandit with keen eyes and nimble fingers, known for being fiercely loyal to his brethren.                                |\n| 39-40      | Grak         | A Legendary Bugbear Warrior wielding a massive warhammer.                                                                          |\n| 41-50      | Narr         | A Bugbear blacksmith known for the elegance and practicality of his weaponry.                                                      |\n| 51-60      | Drot         | A seasoned Bugbear scout, no path in the wilderness is unknown to him.                                                             |\n| 61-70      | Trug         | Skilled Bugbear tamer, known for his uncanny ability to communicate and control wild beasts.                                      |\n| 71-80      | Lurk         | A Bugbear raider with a penchant for causing chaos from the shadows.                                                               |\n| 81-90      | Uldak        | A wary Bugbear who is the first line of defense of his tribe, his eyes constantly scanning the horizon for threats.                |\n| 91-100     | Klad         | A feared Bugbear warlord, having attained his status through strength and cunning, his word is law among his tribe.                 |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Eolande | A solemn figure, Eolande's shifting features regularly adopt the countenances of those they frequently interact with. |\n| 2 | Carric | With sharp, discerning eyes, Carric avoids revealing his true face, instead projecting an authoritative, solid image. |\n| 3 | Phyrra | Regardless of borrowed form, Phyrra carries an undeniable aura of mystique and silent strength. |\n| 4 | Oedi | Quick to adopt a form pleasing to others, Oedi wears expressions like masks, rarely revealing his true emotions. |\n| 5 | Dyvim | An imposing figure, Dyvim often shapes themselves into images of strength, opting for intimidation over deception. |\n| 6 | Rinn | A striking, svelte form, Rinn's fluidity of changes and emotion defy clear categorization. |\n| 7 | Gywnneth | An air of ethereal grace clings to Gwynneth, whether she takes the form of a noblewoman or a common servant. |\n| 8 | Thaco | Thaco frequently embodies the likeness of skilled craftspeople, using their appearances to gain trust. |\n| 9 | Cain | A stern, no-nonsense persona, Cain's mastery in mimicking a soldier is both impressive and fearsome. |\n| 10 | Seren | Beneath a plethora of disguises, Seren's true form remains shrouded in enigma and intrigue. |\n| 11 | Riale | Knowledgeable and enigmatic, Riale's forms are as varied as the array of topics they mastered. |\n| 12 | Kizziar | Exceedingly inscrutable, Kizziar hops between faces more frequently than some people change clothes. |\n| 13 | Veil | An observer and a listener, Veil uses their transformations to blend in and go unnoticed. |\n| 14 | Naelis | Rarely seen in their native form, Naelis performs seamless transitions between meticulously studied personas. |\n| 15 | Shava | Shava's controlled changes facilitates her infiltration into both high society and lowly slums. |\n| 16 | Cailen | Adopts the image of fresh-faced youth or a grizzled veteran with consummate ease to manipulate others' perceptions. |\n| 17 | Lireal | Encountered often as a stoic warrior, it's unclear where Lireal's guises end and the real changeling begins. |\n| 18 | Kieran | Kieran's forms range from imposing to inconspicuous, his true features seldom seen. |\n| 19 | Iolande | Often seen as a shadowy figure, Iolande's true face is as mysterious as the night. |\n| 20 | Jorael | Utilizing a wide range of appearances, Jorael fascinates and mystifies with his many faces. |\n| 21-100 | (Repeat above or leave blank as needed) | (Repeat above or leave blank as needed) |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Zephyros | Ancient and wise, Zephyros is a gold dragon with scales that glow like the morning sun. |\n| 2 | Vraximyor | With deep red scales, Vraximyor is a young and impulsive dragon who is always quick to action. |\n| 3 | Ishythus | A silver dragon who is known for his wisdom and his penchant for riddles. |\n| 4 | Krorthax | A black dragon who relishes in spreading fear and chaos amongst humans and elves. |\n| 5 | Quor'dumal | An intimidating presence, Quor'dumal is a brutish blue dragon who is always surrounded by a crackling aura of static electricity. |\n| 6 | Grakkarion | Grakkarion, a white dragon with a cold, icy stare, is known to reign over the snowy cliffs. |\n| 7 | Shruikan | Shruikan, a dragon of an unknown type, is infamous for his petrifying gaze and gigantic wingspan. |\n| 8 | Elimumor | An emerald green dragon, Elimumor is known for her calm demeanor and affinity with plants and herbs. |\n| 9 | Rythanthar | An old and sagely bronze dragon, Rythanthar prefers diplomacy over violence. |\n| 10 | Theraggon | A copper dragon that revels in mischief and pranks for his amusement. |\n| 11-15 | Maelthra | Maelthra, a black dragon with scales as dark as midnight, is known for her cunning and deceit. |\n| 16-20 | Aothra | A gold dragon, Aothra is revered for her benevolence and wisdom. |\n| 21-25 | Xanmyriel | Xanmyriel, a white dragon, is feared for her icy wrath and imposing presence. |\n| 26-30 | Iridyphia | A blue dragon who revels in the storms and lightning, Iridyphia is both awe-inspiring and terrifying. |\n| 31-35 | Togervithar | Togervithar, a green dragon, is known for his cunning and affinity with poisonous plants. |\n| 36-40 | Davxithar | A silver dragon, Davxithar is a resourceful and intelligent practitioner of arcane arts. |\n| 41-45 | Noromythyus | A red dragon, Noromythyus demands tribute from the mountain dwarves that live beneath his mountain. |\n| 46-50 | Sylphyria | Sylphyria, a bronze dragon, is an ambivalent watcher of the coasts and protector of seafarers. |\n| 51-55 | Balitor | A massive copper dragon, Balitor is known for his love of collecting and hoarding all kinds of treasures. |\n| 56-60 | Ybrynthor | Ybrynthor, a brass dragon, enjoys conversing in various languages and collecting stories from the various races. |\n| 61-65 | Xyrthungar | Xyrthungar, a red dragon, broods over his kingdom in the heart of an active volcano. |\n| 66-70 | Lorrithak | With scales that shimmer like the night sky, Lorrithak is an ancient, peace-loving silver dragon. |\n| 71-75 | Brornigath | A black dragon, Brornigath lives in the deepest part of the forest, unfriendly to any who dare intrude. |\n| 76-80 | Yllaetha | A serene sea-green dragon, Yllaetha is known for her mesmerizing, hypnotic eyes. |\n| 81-85 | Grorgharesh | Grorgharesh, an imposing blue dragon, has an insatiable curiosity that leads him to explore human cities in disguise. |\n| 86-90 | Zerthumanth | A brass dragon, Zerthumanth loves riddles and will generously reward any who can solve his. |\n| 91-95 | Fyrzarrin | With scales that gleam like emeralds, Fyrzarrin is a green dragon who rules over the forest creatures. |\n| 96-100 | Helrathum | Helrathum, a gold dragon, is revered by mountain-folk for his wisdom and fierce protection. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Akrash | An elder gold dragonborn with a regal bearing, bearing the scars of a warrior. |\n| 2 | Balasar | A blue dragonborn, gruff and quiet, known to breathe lightning when angered. |\n| 3 | Crag | A silver dragonborn, tall and mysterious, often seen staring at the stars. |\n| 4 | Drokan | A red dragonborn with a hot temper, but a faithful ally. |\n| 5 | Erak | A muscular and green dragonborn with a scar running across his face. |\n| 6 | Fenris | A golden dragonborn with a gentleness that belies his warrior's physique. |\n| 7 | Ghesh | An old black dragonborn with a sense of humor as dry as his scales. |\n| 8 | Heskan | A silver dragonborn, still young and enthusiastic about everything. |\n| 9 | Irgan | A white dragonborn with an icy demeanor and a haughty laugh. |\n| 10 | Jhank | A green dragonborn, quiet and scholarly, with an insatiable curiosity. |\n| 11 | Kriv | A rare bronze dragonborn blacksmith known for his master craftsmanship. |\n| 12 | Lansar | A noble gold dragonborn with a deep voice that commands respect. |\n| 13 | Mogan | A young red dragonborn, eager for adventure and glory. |\n| 14 | Norixius | A wise old bronze dragonborn with a heavy wisdom in his gaze. |\n| 15 | Ophinshtalajiir | A blue dragonborn sailor with a love for the high seas and a good story. |\n| 16 | Paela | A young and energetic copper dragonborn with a carefree personality. |\n| 17 | Qurash | A black dragonborn with a sly smile who mistrusts magic. |\n| 18 | Rorn | A silver dragonborn, wise and peace loving, well versed in history and lore. |\n| 19 | Siberys | A bronze dragonborn warrior with a stoic demeanor. |\n| 20 | Torinn | A golden dragonborn, a respected cleric with a booming laugh. |\n| 21-100 | Repeat the above | Similar Dragonborn NPCs with similar backgrounds and characteristics. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Verin | A male drow with silvery eyes and an uneasy smile, skilled in illusion magic. |\n| 2 | Isolde | A female drow cleric with a scar across her left eye, who worships Lolth. |\n| 3 | Rolen | A somber male drow fighter with intricate tattoos, skilled with a whip. |\n| 4 | Elara | An aloof female drow enchantress with delicate features and a hypnotic gaze. |\n| 5 | Zephyr | A male drow ranger, exiled from his house for refusing to partake in a ritual. |\n| 6 | Nyla | A female drow rogue, notorious for repeatedly escaping from Menzoberranzan. |\n| 7 | Eldrin | A male drow sorcerer with a penchant for theatrics and a fascination with spiders. |\n| 8 | Deidra | A female drow artisan, known for crafting specialized weapons with mithril. |\n| 9 | Theran | A brooding male drow, decorated warrior of his house, but doubting his morality. |\n| 10 | Seraphina | A noble-blooded female drow bard with a voice as entrancing as her personality. |\n| ... | ...... | .............. |\n| 100 | Ysolde | An elderly female drow mystic with deep knowledge of the Underdark’s secrets. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Krarag Ironfist | A stout duergar with a glossy beard, Krarag is a stonemason who takes immense pride in his creations. |\n| 2 | Gormar the Stern | Gormar is a duergar blacksmith, known for his brows that are always furrowed in deep thought. |\n| 3 | Korlen Graymantle | Fiery and determined, Korlen is a duergar poet who captures the stark beauty of the Underdark in her verses. |\n| 4 | Erdek Stonebeard | A firm and stoic duergar cleric, Erdek devotes all of his time to serving his deity. |\n| 5 | Thulnum Hardhelm | Thulnum is a duergar warrior known for his unbreakable will in the heat of battle. |\n| 6 | Gura Deeproot | A quiet yet sharp-eyed duergar ranger, Gura is a proficient tracker in the labyrinthine tunnels of the Underdark. |\n| 7 | Durnar Flintarm | Durnar is a duergar alchemist, known for his potent poisons and ironclad health potions. |\n| 8 | Thane Ironhewer | The prodigious architect Thane is responsible for many of the sturdy duergar fortifications dotting the Underdark. |\n| 9 | Durdek Steelshadow | A duergar rogue known for his silent footfalls and unseen strikes, Durdek is an expert in stealth. |\n| 10 | Khardun Darkdelver | Khardun, a daunting duergar sorcerer, holds command over ancient and intricate spells of the earth. |\n| ... | ... | ... |\n| 97 | Dhulark Hammerhands | A burly, hardened duergar warrior, whose hands seem forged from steel. |\n| 98 | Gralgar Frostbeard | Gralgar is a duergar survivor, his frosty beard a testament to his chilling ordeals in the upper world. |\n| 99 | Thordran Deephelm | Thordran, a reclusive duergar scholar, is an expert in ancient Underdark history and lore. |\n| 100 | Skarag Goldvein | Skarag is a wealthy duergar merchant, who earned his fortune from underdark mineral trading and his ear, always attune to the stone’s whisper of gold. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| Dice Value | Name       | Description                                                                                   |\n|------------|------------|-----------------------------------------------------------------------------------------------|\n| 1-2        | Thargrim   | An elder and wise dwarf, Thargrim was once a respected blacksmith in his underground community |\n| 3-4        | Dain        | A grizzled veteran of numerous battles, Dain has a stern demeanor and a disciplined mind        |\n| 5-6        | Balgor     | An isolated hermit, Balgor prefers having conversations with his pet wolverine rather than people      |\n| 7-8        | Fargus     | Self-claimed master of ale brewing, Fargus is known for his hearty laughter and never-ending tales                  |\n| 9-10       | Norik       | An eminent scholar, Norik has dedicated his life to the chronicles of dwarven history                                   |\n| 11-12      | Hogni      | Chief of his clan and a skilled tactician, Hogni commands respect and admiration from his kin                          |\n| 13-14      | Kili         | A young dwarf with dreams of venturing into the surface world and seeking out new allies                                |\n| 15-16      | Durin       | A stone mason known for his intricate carvings, Durin is a renowned artisan in his town                               |\n| 17-18      | Ghim       | Former miner, Ghim carries a heavy pickaxe and tells tales of a mysterious gemstone he found in the deepest tunnels            |\n| 19-20       | Thror      | A charismatic trader, Thror is skilled in bartering and haggling with even the shrewdest merchants                      |\n| 21-22       | Nogrim   | A recluse, Nogrim spends his days cataloging his extensive collection of precious metals and rare minerals                 |\n| 23-24      | Orik        | A no-nonsense dwarf who advocates discipline and order, Orik is known to enforce the rules strictly in his community                |\n| 25-26      | Krak       | A dwarf with a passion for forging weapons, Krak can often be found near the fiery warmth of his forge                           |\n| 27-28      | Rurik       | A successful gemstone merchant, Rurik is a dwarf who understands the value of a well-cut gemstone                             |\n| 29-30      | Byrnjar   | Known as a daring explorer, Byrnjar has a penchant for finding hidden paths and secret passages                      |\n| 31-32      | Dargun    | A skilled dwarf engineer, Dargun has constructed numerous innovative devices for his community                       |\n| 33-34      | Thrond   | Although he's lost one eye to a cave bear, Thrond is one of the finest rangers known to his people                     |\n| 35-36      | Skar     | A fiercely competitive dwarf, Skar loves to challenge his peers in tests of strength and endurance                           |\n| 37-38      | Borgakh | A skilled healer, Borgakh displays a calm and reassuring presence during troubled times                                   |\n| 39-40      | Ulfgar   | A dwarf with a deep love for music, Ulfgar often lifts the spirits of his community with his soulful tunes                      |\n| ....       | ....        | ....                                                                                                                          |\n| 97-98      | Mangrim  | A veteran dwarf warrior. Despite his old age, his fighting skills are still matchless in his community                    |\n| 99-100     | Yngvar    | As head of the dwarven council, Yngvar is a respected figure known for his wisdom and fairness                             |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Althidon | A stern-faced elf with sharp features and piercing blue eyes, known for his unrivaled bow skills. |\n| 2 | Beledir | A charismatic elf with golden hair and eyes, known for his diplomacy and peacemaking efforts. |\n| 3 | Carrindil | A silent, stealthy elf ranger with a dark hood and eyes that have seen too many battles. |\n| 4 | Daelenna | A wise, raven-haired elf enchantress, highly respected for her knowledge of arcane arts. |\n| 5 | Evandor | An old, contemplative elf scholar, lost in the study of ancient texts and knowledge. |\n| 6 | Firion | A young, boisterous elf warrior, eager to etch his name in the songs of bards. |\n| 7 | Galathil | A cunning elf rogue known for his quick fingers and quicker daggers. |\n| 8 | Hadriel | A silver-eyed elf seer, preciously rare, acknowledged for her many accurate prophecies. |\n| 9 | Idril | A serene, soft-spoken elf cleric devoted to the preservation and healing of her kin. |\n| 10 | Jora | A steadfast elf guard who remains at her post regardless of the danger she faces. |\n| 11 | Kaelis | A seasoned elf commander, known for his strategic brilliance and exceptional swordsmanship. |\n| 12 | Lorindol | An elusive elf spy whose true work and identity remain a mystery to all. |\n| 13 | Merilin | A renowned elf bard, whose enchanting voice can soothe even the most savage hearts. |\n| 14 | Neldor | An elf blacksmith of unmatched skill, his crafted weapons desired by all. |\n| 15 | Oriena | An arrogant elf noblewoman, her power and influence masked by her breathtaking beauty. |\n| 16 | Penna | A seemingly aloof elf trader with an uncanny knack for always getting the best deals. |\n| 17 | Querion | A scarred elf veteran, his tales of bravery and combat inspire the younger generation. |\n| 18 | Rigan | A jovial, yet humble elf minstrel, often found entertaining at taverns and inns. |\n| 19 | Silivren | An elf herbalist known for her healing poultices and herbal remedies. |\n| 20 | Talindra | A fiery, and sometimes impulsive elf sorceress, revered for her mastery over the elemental forces. |\n| ... | ... | ... |\n| 100 | Zireael | A mysterious, enigmatic elf assassin, whose reputation precedes her lethal skills. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1-2 | Zephyra | A quiet air genasi woman with long white hair that always seems to float. |\n| 3-4 | Pyrrhus | An energetic fire genasi man who constantly flickers like a torch |\n| 5-6 | Icyra | A shy and reserved ice genasi woman who never seems to get warm. |\n| 7-8 | Dolmite | A stoic earth genasi man, chiseled and firm, with a gentle heart. |\n| 9-10 | Windgust | A whimsical air genasi with hair that whips around erratically. |\n| 11-12 | Searing Ember | A fire genasi quick to action and quicker to anger. |\n| 13-14 | Tundra | A stoic and reserved ice genasi who rarely shows any emotion. |\n| 15-16 | Aralee | A young and curious air genasi with twinkling blue eyes. |\n| 17-18 | Vulcano | A brutish fire genasi, always ready for a fight. |\n| 19-20 | Rimy | A friendly yet distant ice genasi who loves crafting tiny ice sculptures. |\n| 21-22 | Bouldergrip | A steadfast earth genasi with a great pride in his family’s gemstone quarry. |\n| 23-24 | Stryatus | An air genasi cartographer who is always lost in thoughts. |\n| 25-26 | Flashflame | A playful fire genasi jester who is everybody’s friend. |\n| 27-28 | Glace | An ice genasi with affinity for magical artifacts. |\n| 29-30 | Stoneblood | An earth genasi known for his formidable strength. |\n| 31-32 | Turbulence | A charismatic air genasi bard, always with a song on her lips. |\n| 33-34 | Sunderscorch | A fire genasi blacksmith, as passionate as the flames he employs. |\n| 35-36 | Subzero | A stoic and mysterious ice genasi who talks very little. |\n| 37-38 | Terra | An earth genasi cleric, dedicated to the service of the gods. |\n| 39-40 | Cloudpath | An air genasi poet known for his depth and creativity.|\n| 41-42 | Emberdread | A menacing fire genasi with great magical prowess. |\n| 43-44 | Hoarfrost | A witty and cunning ice genasi rogue. |\n| 45-46 | Geode | An earth genasi merchant with a flair for finding valuables. |\n| 47-48 | Galeheart | A serene air genasi monk, forever in tune with the winds. |\n| 49-50 | Redflare | A fire genasi ranger, known expert tracker. |\n| 51-52 | Frostsheen | A graceful ice genasi dancer with mesmerizing movements. |\n| 53-54 | Rubblegrim | An earth genasi veteran of many battles. |\n| 55-56 | Mistral | An air genasi historian who knows too many secrets. |\n| 57-58 | Scorchwind | A fire genasi with a warm and welcoming personality. |\n| 59-60 | Hailstone | A solemn ice genasi enforcer for a local guild. |\n| 61-62 | Geo | An Earth Genasi who loves to tinker with mechanical things. |\n| 63-64 | Breezewolf | An adventurous air genasi druid, with a special bond to soaring creatures. |\n| 65-66 | Cinderclash | A quick-witted fire genasi innkeeper. |\n| 67-68 | Icegrip | A calm and composed ice genasi advocate. |\n| 69-70 | Slabcrusher | A mature earth genasi judge known for his impeccable judgement. |\n| 71-72 | Azuregust | A youthful air genasi, eager to explore the world. |\n| 73-74 | Blazing Echo | A quiet and contemplative fire genasi cleric. |\n| 75-76 | Frostspar | An ice genasi berserker, known for her ferocious battle fury. |\n| 77-78 | Deepcrust | An earth genasi miner, always looking for the next big vein. |\n| 79-80 | Nimbus | An air genasi acrobat who performs with unparalleled grace. |\n| 81-82 | Wildfire | A fire genasi bard, famous for his tales of adventure. |\n| 83-84 | Icevein | A diligent and patient ice genasi artisan. |\n| 85-86 | Pebble | A jovial and optimistic earth genasi shopkeeper. |\n| 87-88 | Aeris | An air genasi explorer who loves heights and flying creatures. |\n| 89-90 | Inferno | An ambitious fire genasi warrior, seeking honour and glory. |\n| 91-92 | Frostwhisper | An ice genasi librarian who prefers the company of books. |\n| 93-94 | Grit | An earth genasi farmer who values hard work and determination. |\n| 95-96 | Windsong | An air genasi scholar, known for their insights and knowledge. |\n| 97-98 | Caldera | A fire genasi mage whose magic is wild and unpredictable. |\n| 99-100 | Snowdrift | An ice genasi hunter who loves the thrill of the hunt. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| d100 | Name | Description |\n|---|---|---|\n|1|Nodal Rumbleshank|An elderly gnome with great knowledge about magical enchantments. |\n|2|Foddet Pickgrudge|A blacksmith known for his outstanding armors made of unique materials. |\n|3|Bevel Nimblecogs|A hard-working miner with keen eyes for valuable ores. |\n|4|Zarpor Dellfrizzle|A skilled mapmaker who has traveled to many mysterious places. |\n|5|Borkat Balkshiv |A cynical gnome who is also a renowned bard in the region. |\n|6|Perxidel Gussettsprocket|A young gnome with wild ideas about clockwork constructions. |\n|7|Thakovar Brickfizzle|A former adventurer turned tavern keeper. |\n|8|Wigget Mosslock|A gnome with an uncanny ability to communicate with animals. |\n|9|Sarnget Baywrench|A sailor who knows extensive nautical maps and sea routes. |\n|10|Toggler Diamonddelve|A gem cutter with great ability to distinguish fake gems. |\n|11|Kargen Bouldercore|A veteran military strategist who served in many wars. |\n|12|Fuzzle Timbergrasp|A gnome who is an excellent wood carver and carpenter. |\n|13|Zoddick Bottleview|An expert potion maker with recipes of several rare potions. |\n|14|Jimgar Fizzleshank|A skilful goldsmith known for his intricate craftsmanship. |\n|15|Nargel Pebblebrow|A knowledgeable librarian who has vast information about various topics. |\n|16|Zarpiddel Coppergrip|A proficient knife thrower and a charismatic circus performer. |\n|17|Lopyddel Stonegleam|An experienced gem miner who has spent decades in the mountains. |\n|18|Flink Woldwhisper|An herbalist with a vast knowledge of medicinal and poisonous plants. |\n|19|Wigdert Nickeltapper|A gnome with a sharp understanding of economics and commerce. |\n|20|Doddle Billbottle|A distiller with recipes of exquisite gnome liquors. |\n|21-100|*Repeat the pattern, replacing the occupations and names appropriately.*| |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1-2 | Skirk | This goblin is wiry and mischievous, with patchy skin and pointed ears.\n| 3-4 | Ximra | Short statured, with scars from numerous battles. Favors dual blades.\n| 5-6 | Grob | A goblin shaman with vibrant red eyes, often seen with a Viper staff.\n| 7-8 | Znix | Large for a Goblin, with numerous broken teeth and an impressive nose.\n| 9-10 | Pex | This goblin is slender and flexible, known for his agility.\n| 11-12 | Vreek | A goblin with a cruel laughter and a wicked Shortsword.\n| 13-14 | Mork | A heavyset goblin with a club, brutish and loud.\n| 15-16 | Gnarl | A one-eyed goblin with weathered skin and a jagged Dagger.\n| 17-18 | Yizzik | A runt of his brood, and a surprisingly adept Rogue.\n| 19-20 | Krokk | A Goblin leader, feared for his iron discipline and tough hide armor.\n| 21-22 | Bix | This goblin is known for his sharp wit and scrawny physique.\n| 23-24 | Quokk | Silent and calculating, with a morbid fondness for daggers.\n| 25-26 | Brak | A goblin bard whose jarring voice belies his words' charm.\n| 27-28 | Durk | This burly goblin is infamous for his brawling prowess.\n| 29-30 | Grint | A clever Goblin tinkerer, known for his odd contraptions.\n| 31-32 | Snip | This goblin often sneaks around and is known for his pickpocketing skills.\n| 33-34 | Uzrir | Fast and unpredictable, this goblin hunter is at home in the wilderness.\n| 35-36 | Fik | A goblin warrior with a fierce temper and a broadsword.\n| 37-38 | Zilp | A small goblin but a talented thief, underestimated by many.\n| 39-40 | Tork | A taciturn goblin who can communicate effectively with wolves.\n| 41-42 | Vlork | A paranoid goblin who distrusts others and often looks over his shoulder.\n| 43-44 | Kliv | This goblin is brilliant but weak-bodied, relying on cunning for survival.\n| 45-46 | Ratch | A frail goblin with a quick mind and the ability to cast minor illusions.\n| 47-48 | Pigknot | Known for his oddly human-like features and brute strength.\n| 49-50 | Tink | This goblin loves to tinker, often seen repairing or modifying weapons.\n| 51-52 | Squee | A goblin ranger, expert at tracking and laying traps for his prey.\n| 53-54 | Nipper | Known for his swift fingers, Nipper is an adept pickpocket.\n| 55-56 | Gnash | A crude goblin who's as likely to eat his fallen foes as he is to loot them.\n| 57-58 | Sulk | Renowned for his sullen demeanor and sardonic humor, he's surprisingly shrewd.\n| 59-60 | Pox | A goblin cleric who's unusually interested in diseases and their uses.\n| 61-62 | Skab | A goblin with a twisted sense of humor, often seen crafting harmful pranks.\n| 63-64 | Grack | A leather-clad goblin with a taste for setting deadly traps.\n| 65-66 | Weez | This skinny goblin is known for his incredible speed and agility.\n| 67-68 | Zik | A rambunctious, green-skinned goblin with a penchant for explosives.\n| 69-70 | Blech | A toothless old goblin with strange concoctions and a vague knowledge of magic.\n| 71-72 | Nog | This goblin carries a twisted cane and often talks in riddles.\n| 73-74 | Xag | A goblin who, freakishly, has a third eye in the center of his forehead.\n| 75-76 | Grem | A goblin berserker, powerful yet reckless in his battle rage.\n| 77-78 | Snag | This scrawny goblin collects shiny trinkets and is fiercely protective of them.\n| 79-80 | Ezk | This hulking goblin is more brawn than brain with an appetite for destruction.\n| 81-82 | Yik | A short, chunky goblin who is a natural leader amongst his peers.\n| 83-84 | Pritch | A scarred goblin warrior who's seen more battles than most.\n| 85-86 | Teek | This small goblin, easily overlooked, is a master of stealth and thievery.\n| 87-88 | Wart | Wart is a plump goblin with a volatile temper and a love of cooked meat.\n| 89-90 | Skatch | Known for his skinny physique and yellowish skin, he is a timid individual.\n| 91-92 | Klek | This goblin holds himself with an unusual gravitas and shows signs of magic use.\n| 93-94 | Vex | A goblin who takes pleasure in the suffering of his enemies, often by poison.\n| 95-96 | Grit | This goblin, muscular and tall, favors the use of a heavy mace.\n| 97-98 | Brik | Known for his cunning traps and the numerous blades hidden on his person.\n| 99-100 | Nux | This clever goblin is observant and scheming, always planning his next move. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Aukan | A hulking, grey-skinned goliath warrior with jet black hair and cold eyes. |\n| 2 | Eglath | A stern, serious-looking goliath cleric with an imposing presence. |\n| 3 | Gathak | A focused, disciplined goliath fighter who rarely speaks and communicates through actions. |\n| 4 | Ilikan | A goliath ranger with a quiet demeanor and a keen eye for detail. |\n| 5 | Keothi | An agile, dauntless goliath rogue who moves with cat-like grace. |\n| 6 | Lo-Kag | A goliath bard with a deep, resonating voice and a charismatic presence. |\n| 7 | Maveith | A skilled and reliable goliath blacksmith with stern features and powerful hands. |\n| 8 | Nalla | A goliath druid with an affinity for the mountainous wilderness, her skin colour resembles the colour of rocks. |\n| 9 | Pethani | A goliath sorcerer with mystical tattoos covering her body. |\n| 10 | Thotham | A massive goliath barbarian who is often seen boastfully flexing his muscles. |\n| 11 | Aati | A slender goliath monk who moves with fluid agility.  |\n| 12 | Ogolai | A broad shouldered goliath, part of the local garrison with a stoic face. |\n| 13 | Kavaki | A goliath warrior known for his tactical acumen, has several battle-scared tattoos.  |\n| 14 | Vaunea | A healer with an imposing figure and earthy eyes, garners respect from the tribe. |\n| 15 | Thalai | A goliath tribal leader, inspires her tribe through respect rather than fear. |\n| 16-100 | *Reserved for DM customization.* | *Reserved for DM customization.* |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Aldenar Quickshadow |A laconic and introspective half-elf ranger with chestnut hair cut short. |\n| 2 | Rennia Stardrift | Practical and stern cleric with swirling silver tattoos spiralling down her arms.|\n| 3 | Thelbran Moonbreeze | A respected scholar who possesses a nearly endless curiosity about the world. |\n| 4 | Seraphina Leafstep | Talented half-elf bard, using her performances to bring stories alive in captivating ways. |\n| 5 | Ilden Silverleaf | A skilled blacksmith with a stubborn loyalty to his friends. |\n| 6 | Nindrol Oceanwhisper | Sharp-tongued and calculating, he is a master of political maneuvers. |\n| 7 | Galanthiel Nightsong | A stoic and skilled fighter with an eternally calm demeanor. |\n| 8 | Thienna Windgast  | Unfailingly polite and diplomatic wizard adorned with sapphire amulets. |\n| 9 | Carilis Seabreeze | A roguish charmer with a wit as sharp as his blade. |\n| 10 | Daelen Falconhand | An unwavering paladin with a steely gaze and a heart full of courage.|\n| 11 | Theren Rainwhisper | Cynical warlock with a sarcastic sense of humor and dark, secretive eyes.|\n| 12 | Elenwe Fieldwater | A carefree druid who tends the forests with a nurturing hand. |\n| 13 | Haldir Starweaver | Elusive and mysterious, he gifts only cryptic advice to those who seek him.|\n| 14 | Pharyndel Dawntracker | A courageous warrior who braves any danger for those he cherishes. |\n| 15 | Thranduil Elfsinger  | A deeply spiritual monk following the path of tranquility. |\n| 16 | Vanorian Dreamdancer | A harbor master with a thousand tales of the sea, retelling them with a dreamy gaze. |\n| 17 | Quarion Sunshard | Esteemed diplomat known for his shrewd negotiations and wise counsel. |\n| 18 | Yenlara Goldflower | A charismatic merchant with a knack for trade and profitable business ventures. |\n| 19 | Niphon Ghostarrow  | An adept ranger cloaked in a mantle of silence, skillfully blending with the shadows. |\n| 20 | Olorin Windtreader  | A resourceful scout with an unerring knack for finding the quickest path. |\n| ... | ... | ... |\n| 100 | Faelivrin Twilightshine | A noble archmage known for her powerful spells and arcane wisdom.|\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Agrat | Standing at 6.5 feet tall with muscular scarring on body. Keeps a serious demeanor and wears chainmail armor. Specialists in weaponry. |\n| 2 | Krothu | Shorter and leaner than most other half-orcs. Tactful, silent and observant. Skilled rogue with a specific taste for daggers. |\n| 3 | Gruul | Massive and intimidating presence, knows how to bend the crowd's will. Adept leader with great strategy skills. |\n| 4 | Verok | A talisman bearer with deep knowledge of ancient rituals and magic. Possesses a more pacifist nature compared to other orcs. |\n| 5 | Zog | Agile and versatile, Zog was once part of a circus troupe. His acrobat skills still serve him in combat and exploration. |\n| 6 | Oghash | Lost her right eye in a duel. Oghash is a respected warrior, possessing relentless stamina and strength. |\n| 7 | Grok | An impeccable blacksmith, Grok is built like a tank and she uses her art to create weapons and armor for her clan. |\n| 8 | Borak | A charismatic and influential figure, Borak spent time among humans gaining social skills uncommon among his tribe. |\n| 9 | Lug | Blindingly quick with a rapier, Lug relies on his speed and cunning in combat. He has a sly grin and darting eyes. |\n| 10 | Ushak | Known for her healing abilities, Ushak has a calm demeanor and an ever present will to aid her allies. |\n| 11 | Kradak | Full of raw power. Kradak is slow, but every strike from him counts. Whether with axe or hammer, few can stand against him. |\n| 12 | Blorg | A tracker and scout, Blorg prefers his isolation while providing vital information about potential threats to his tribe. |\n| 13 | Brotor | With a scar running from cheek to cheek, Brotor is a classic no-nonsense half-orc, who keeps his promises and expects you to do the same. |\n| 14 | Mishnag | Old and having covered in ritualistic tattoos, Mishnag is a mysterious figure with vast knowledge and mystical abilities. |\n| 15 | Dreshna | Agile and an unmatched archer. Silent and deadly, she is a nightmare from the shadows. |\n| ... | ... | ... |\n| 96 | Thrumnak | A culinary enthusiast, Thrumnak can cook up a decent meal even in the roughest environment. His kindness is well-known. |\n| 97 | Dulk | A lumberjack with a heart of gold. Known for his strength, dedication to his work and friendly demeanor. |\n| 98 | Grishnak | A burly brute with a love for arm-wrestling. His strength is only rivaled by his surprisingly warm-hearted nature. |\n| 99 | Norrok | Skilled in herbalism and potion brewing, Norrok is an important figure among his tribe. Often considered as the community's medic. |\n| 100 | Zargath | Once a slave, Zargath is now a freedom fighter with an indomitable will. He is keen on fighting for the rights of the oppressed. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n|Dice Value|Name|Description|\n|---|---|---|\n|1|Belba Whitfoot|A reticent halfling with an affinity for maps|\n|2|Meriadoc Goodbarrel|A scribe with a knack for useful note-taking|\n|3|Lobelia Goldworthy|A stern herbalist known for her potent brews|\n|4|Falco Goodchild|A reliable blacksmith with firm business ethics|\n|5|Perry Greenbottle|A reserved carpenter working with unique woods|\n|6|Rosie Fairbairn|A stern midwife respected for her expertise|\n|7|Samwise Hearth|A diligent farmer with a love for simple life|\n|8|Marmaduke Burrowes|A weathered stonemason with a discerning eye|\n|9|Pippin Orchard|A reserved brewer who takes his craft seriously|\n|10|Doderic Grassfoot|A focused miner rarely seen topside|\n|11|Celandine Maggot|A stern weaver known for her meticulous work|\n|12|Ferdibrand Brownlock|An upstanding banker with a trusted reputation|\n|13|Angelica Hornblower|A diligent beekeeper always prepared with honey|\n|14|Wilimar Baggins|A focused jeweller crafting beautiful artefacts|\n|15|Bandobras Brockhouse|A serious scholar having vast historical knowledge|\n|16|Marroc Cotton|A reticent baker respected for his traditional recipes|\n|17|Tomacca Proudfoot|An unyielding town guard firm in his duties|\n|18|Hugo Boffin|A reliable trader selling essential goods|\n|19|Togo Rumble|An austere librarian with a vast collection of scrolls|\n|20|Peony Took|A modest seamstress known for intricate designs|\n|21|Bilbo Bracegirdle|A reverent priest offering spiritual guidance|\n|22|Ponto Baggins |A serious lawyer believed to never lose a case|\n|23|Drogo Chubb|A dedicated shipwright building sturdy boats|\n|24|Berilac Noakes|A stoic postmaster ensuring prompt deliveries|\n|25|Elanor Twofoot|A diligent butcher known for prime cuts|\n|26-100|*Repeated or Variation of Above*|*Repeated or Variation of Above*|\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Garok | Military leader with scars from many battles |\n| 2 | Vurok | A herbalist skilled in using plants for medicine and poisons |\n| 3 | Mogat | Young wannabe warrior eager to prove his strength |\n| 4 | Skurra | Hobgoblin drone tasked with foraging duties |\n| 5 | Thrak | Boisterous blacksmith known for crafting high-quality armor and weapons |\n| 6 | Rugar | Former slave who has sworn revenge against his oppressors |\n| 7 | Zog | Cynical spy who collects secrets for the highest bidder |\n| 8 | Gritgor | Aloof and quiet ranger specialized in stealth operations |\n| 9 | Bruk | Hunter known for tracking and capturing dangerous beasts |\n| 10 | Ukkad | Ancient strategist known for his cunning and wisdom |\n| 11 | Gozzak | Ambitious interpreter tasked with bridging diplomatic connections |\n| 12 | Fugot | Healer well respected for his compassion and skill |\n| 13 | Korug | Battle-hardened warrior with a gruff exterior |\n| 14 | Shrag | Scholar fascinated by ancient history and lost cultures |\n| 15 | Kret | Cruel slave master who rules with an iron fist |\n| 16 | Rog'k | Archer skilled in shooting from great distances |\n| 17 | Kruk | Guard notorious for his abuse of power |\n| 18 | Trokkun | Priest who serves with blind obedience to his deity |\n| 19 | Zok | Cook who possesses a surprisingly good taste for fine cuisine |\n| 20 | Grurk | Slave who yearns for freedom from his cruel masters |\n| 21 | Pogg | Loudmouthed musician who dreams of stardom |\n| 22 | Vogg | Artist known for creating beautiful murals with natural pigments |\n| 23 | Blok | Stoic scout who rarely speaks, but observes everything |\n| 24 | Grok | Skilled thief who can slip in and out without being noticed |\n| 25 | Krukk | Old wise archmage renowned for his powerful spells |\n| ... | ... | ... |\n| 100 | Ulgat | Matriarch revered for her wisdom and leadership |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Arrick Stonehaven | A tall robust human with a dark beard, carries the distinct musky scent of timber from his work as a woodcutter. |\n| 2 | Bellas Quickhand | An agile figure with an irregular scar crossing over his pecan eyes, a rogue known for his nimble fingers in the city's underbelly. |\n| 3 | Carim the Steadfast | A knight of the realm, strong and regal in golden armor that seems untouched by age or war, with greying hair that testifies to his seasoned experiences. |\n| 4 | Dora the Alchemist | A scholarly girl, glasses perched on the edge of her nose, alchemical concoctions leaving a trail of distinctive aroma around her. |\n| 5 | Endor Ironfoot | A gruff looking blacksmith, muscles rippling from years of hammering away at weapons and armor, his skin marked with cinder burns. |\n| 6 | Faelwen Leafdancer | A slender girl with an ethereal grace, her eyes carry the hue of fall leaves, she is a bard who can calm even the wildest tempest with her melody. |\n| 7 | Garling Hardjaw | A grizzled veteran of the king's army with a jaw set in determination, his gaunt figure is a testament to the numerous battles he has survived. |\n| 8 | Hazel Clearwater | A maiden fair with azure eyes as clear as a summer sky, she has a penchant for the art of healing. |\n| 9 | Igan Stonebender | A craggy-faced individual who has spent more time in mountains than in cities, his strong arms have bent many a stone to his will. |\n| 10 | Jerrick Fairwind | A tall, charismatic trader with a charming smile that can convince anyone to part with their gold. |\n|...|...|...|\n| 91 | Vestra Goldeneye | A well-known sage with a gazelike cerulean eye, her reputation precedes her in the circles of divination and prophecy. |\n| 92 | Xarion Thunderhand | A stocky man with a thunderous presence, his hands have empowered many a warrior through enchantments. |\n| 93 | Yagna Demonsbane | A toughened scarred figure, his name echoes fear in the hearts of demons due to his relentless pursuit. |\n| 94 | Zephyr Lightfoot | A roguish character with a light footprint, he specializes in espionage and recognizance tasks. |\n| 95 | Aldara Blackquill | A mature woman full of wisdom, she is the city's best scholar and scribe. |\n| 96 | Borin Hammerfist | A smith with biceps like boulders, his work on weapons and armor is coveted by warriors across the realm. |\n| 97 | Cirina Stormwhisper | A tempestuous sorceress with a calm face, her tranquil whispers can call upon the fury of storms. |\n| 98 | Draven Crowshadow | A figure shrouded in mystery, his connection with the secretive Crowshadow clan makes him an unnerving acquaintance. |\n| 99 | Elean Wildheart | A ranger with the heart of a lioness, her expertise in tracking and hunting are rivalled by few. |\n| 100 | Fargrim Stonegrip | A stern geologist with calloused hands, his understanding of rocks and minerals is unmatched in the city. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Zik | A male kobold, guard captain, has scars over many parts of his body |\n| 2 | Praxes | Female kobold, healer, uses herbs and poultices |\n| 3 | Drix | Male kobold scout, has particularly bright eyes |\n| 4 | Kiknas | Elder male kobold, tribe's soothsayer, carries lots of tokens |\n| 5 | Skrix | Male kobold, rogue, particularly stealthy |\n| 6 | Ignika | Female kobold, seamstress, unusually tall |\n| 7 | Kti | Elder female kobold, chief, severe looking |\n| 8 | Ikri | Male kobold, hunter, always carries a spear |\n| 9 | Kail | Male kobold, blacksmith, has a sturdy body |\n| 10 | Prat | Child kobold, curious, always asking questions |\n| 11 | Grisk | Male kobold, cook, surprisingly fat for a kobold |\n| 12 | Sluk | Elder male kobold, warrior, always vigilant |\n| 13 | Ikra | Female kobold, gatherer, always carries a basket |\n| 14 | Viskt | Male kobold, storyteller, has a flare for the dramatic |\n| 15 | Skuddle | Female kobold, shaman, wears lots of jewelry |\n| 16 | Trip | Male kobold, trap maker, always has a grin on his face |\n| 17 | Slatt | Female kobold, sentinel, very alert |\n| 18 | Crack | Male kobold, carpenter, very good with his hands |\n| 19 | Clack | Child kobold, lumberjack, likes to climb trees |\n| 20 | Vex | Female kobold, brew master, makes the best ale in the tribe |\n| 21 | Ix | Male kobold, elder, very wise and respected |\n| 22 | Trik | Female kobold, artisan, makes pottery for the tribe |\n| 23 | Brisk | Male kobold, miner, very strong and hardworking |\n| 24 | Pil | Female kobold, chieftain's personal assistant, very meticulous |\n| 25 | Yip | Child kobold, fisherman, always on the river |\n| 26-100 | Reflavor previously listed names and descriptions as required |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n| Dice Value | Name | Description |\n| ------ | ------ | ------ |\n| 1-2 | Zzark | A tall and slender lizardfolk, his green scales slightly mottled. He has keen yellow eyes and a notable scar across his snout. |\n| 3-4 | Lizza | A muscular lizardfolk, with a bluish hue to her scales. Her jaw is powerful and her gaze is extremely focused. |\n| 5-6 | Chit-Tark | This lizardfolk is smaller than most, with brown and green scales. His movements are quick and twitchy. |\n| 7-8 | Szizzik | This lizardfolk's scales are a vibrant red. His eyes are intelligent, and he carries a staff adorned with bones. |\n| 9-10 | Krita | Standing tall and proud, Krita has an imposing presence. Her scales are a deep dark green and she bears distinctive tribal marking on her cheeks. |\n| 11-12 | Grark | One of Grark's eyes is milky white, the other a bright golden. His scales are of an ordinary green hue and he has a savage demeanor. |\n| 13-14 | Mizzak | Mizzak is an aged lizardfolk with gray scales. Though old, his sharp gaze possess wisdom and experience. |\n| 15-16 | Chark-Zit | Chark-Zit is much larger than the average lizardfolk, with thick, raw, stone-like scales. His muscles are ripped and his strength is apparent. |\n| 17-18 | Zizza | This lizardfolk has a slender build. Her blue-green scales are glossy and her eyes are an alluring turquoise. |\n| 19-20 | Rikka | This compact lizardfolk is covered in dark green scales. His eyes are a piercing yellow and he exudes a quiet, menacing aura. |\n| 21-22 | Tzikk | An elder lizardfolk with a grizzled appearance. Despite his age, he gives off an aura of authority and strength. |\n| 23-24 | Slizza | Slizza's frame is sleek and her movements fluid. Her scales have a hint of silver, and she has a mischievous glint in her eyes. |\n| 25-26 | Grik | Grik is burly with deep-set yellow eyes. His jaw ticks when he is agitated and his thick skin is marred with old battle scars. |\n| 27-28 | Skrika | This lizardfolk's scales are a pale, almost white shade of yellow. Skrika has an air of quiet contemplation and measured calm. |\n| 29-30 | Glizz | With unusually long arms, Glizz has a hunched over appearance. His blue-gray scales are marked with scores from past fights. |\n| 31-32 | Zark | This lizardfolk is on the small side, with a sinewy build and keen, alert eyes that miss very little. |\n| 33-34 | Vrisk | Distinguished by a prominent crest, Vrisk is a warrior. His red-orange eyes glitter with a feral light. |\n| 35-36 | Trizzak | A wandering lizardfolk with a bedraggled appearance. His scales have lost some of their color but his spirit remains untamed. |\n| 37-38 | Qrizz | This lizardfolk carries himself with a confident swagger. His scales are a deep red and his sharp eyes are the color of steel. |\n| 39-40 | Grizzt | Grizzt is imposing and charismatic. His scales are of a rare bluish hue and his piercing gaze holds an unnerving intensity. |\n| ... | ... | ... |\n| 99-100 | Drizzik | A unique lizardfolk with transparent looking scales, allowing you to see some of his inner workings. Despite his unusual appearance, he is regarded as a wise leader. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Gorbag | A grizzled orc warrior with countless scars and a missing ear. |\n| 2 | Mogg | A wise old orc shaman with graying hair and a gnarled staff. |\n| 3 | Snaga | A skinny orc scout with keen eyesight and quick reflexes. |\n| 4 | Ugluk | A hardy orc chieftain with battle-worn armor. |\n| 5 | Grishnakh | An orc blacksmith with strong muscles and a grim demeanour. |\n| 6 | Narzug | A hulking orc brute with a menacing presence. |\n| 7 | Radbug | A cunning orc spy skilled in hiding and silent killing. |\n| 8 | Zogdash | A devoted orc priest with ritual tattoos. |\n| 9 | Gorgul | An orc hunter with one blind eye but an uncanny aim. |\n| 10 | Buglak | An orc cook with a passion for exotic and sometimes questionable ingredients. |\n| 11 | Nazdug | A cheerful orc bard with a surprisingly soft voice. |\n| 12 | Zogug | A burly orc sailor with stories of sea creatures and distant lands. |\n| 13 | Durbuk | A mysterious orc mage shrouded in a dark cloak. | \n| 14 | Lugor | A skilled orc tracker renowned for his unerring sense of direction. |\n| 15 | Gashnakh | A brutish orc guard known for his cruelty. |\n| 16 | Krugbuk | A young orc warrior eager to prove his strength. |\n| 17 | Urgat | A wily orc thief with nimble fingers. |\n| 18 | Begzul | An optimistic orc merchant known for his sharp trades. |\n| 19 | Nabgut | A fierce orc berserker with a thirst for battle. |\n| 20 | Durgat | An elderly orc historian obsessed with the past. |\n| 21-100 | Reshuffle and re-roll on this table | |\n\n *Please note: The description of the orc characters are made keeping the traditional orc characteristics from Dungeons and Dragons 5e into consideration.*\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Zephyr | A stoic Tiefling, with maroon skin and brilliant golden eyes. A life of discipline is evidenced by his firm demeanor. |\n| 2 | Lysander | A blue-skinned Tiefling, his eyes an unsettling violet. He carries an air of nobility and his silken garments bear the crest of an unknown house. |\n| 3 | Malice | A robust and muscled Tiefling, her deep red skin seems tough as leather.  She exhibits an unusual honor for a mercenary. |\n| 4 | Nemo | A slim Tiefling, standing tall, with inviting eyes and a cerulean skin that clashes against his crimson hair. |\n| 5 | Mercy | Short for a Tiefling, her azure skin is almost luminous in the dark. Her timid demeanor hides a guileful mind. |\n| 6 | Faustus | A surly Tiefling with greyish skin and a disheveled mop of violet hair. He tend to keep to himself. |\n| 7 | Oberon | This gargantuan Tiefling shrouded in deep black skin. His silver eyes like moons in the darkness. |\n| 8 | Selene | A Tiefling adorned in noble attire, her skin sparkles cerulean beneath her garments. Her golden eyes gaze sternly from beneath her hood. |\n| 9 | Icarus | A frail-looking Tiefling, with almost translucent skin. He seems to always be smiling, even when there’s nothing to smile about. |\n| 10 | Thorne | A burly Tiefling warrior with reddened skin that looks hard as stone. He wields a gleaming greatsword. |\n| 11 | Seraphim | Porcelain-skinned with sun-bleached hair. She has a quiet strength about her, eyes seem distant, lost in thought. |\n| 12 | Hades | Sapphire skin glows eerily under his hood. The depths in his eyes gleam of ancient knowledge. |\n| 13 | Uriel | A chestnut-skinned Tiefling, with silver eyes as cold as winter. His chiseled features and noble attire suggest high birth. |\n| 14 | Shiva | Tall and willowy, her cerulean skin seems to shimmer. A sapphire diadem rests lightly on her brow. |\n| 15 | Vesper | This ink-skinned Tiefling's crimson eyes spark with intelligence. A scribe by trade, he is ever surrounded by scrolls and books. |\n| 16 | Mephistopheles | A bald-headed Tiefling, with sapphire skin covered in faded scars. His lavender eyes hold a thousand yard stare. |\n| 17 | Elysium | Rose-petal skin and magenta eyes that seem to glow in the dark. Her tail lashes when she's deep in thought. |\n| 18 | Malachi | This hulking Tiefling has midnight black skin and glowing, crimson eyes. He wears the garb of a woodsman. |\n| 19 | Vulcan | A sienna Tiefling, with thick set features and molten eyes. He toils in the heat of the blacksmith's forge with unwavering dedication. |\n| 20 | Echo | A young Tiefling with sun-touched skin and azure eyes that dance with mischief. Quick with a smile, she travels as a bard. |\n| 21-100 | - | _(Reserve for your additional Tiefling NPCs)_ |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}