{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "5e Rolltables",
  "description": "Prompt generated entities from ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n| d20 Roll | Mishaps Due to a Critical Failure on a Melee Attack |\n| --- | --- |\n| 1 | You lose your grip and your weapon flies out of your hand, landing 1d4 x 5 feet away in a random direction. |\n| 2 | You miss your enemy and instead hit an unintended object, which sends a shockwave up your arm. You have disadvantage on all attack rolls until the end of your next turn. |\n| 3 | You overextend yourself, leaving you not just open, but off-balance. You have disadvantage on your next saving throw. |\n| 4 | The miss throws you off, causing your next attack to be at disadvantage. |\n| 5 | You slip and fall prone. |\n| 6 | As you swing your weapon, a strap or buckle fails and a piece of your armor falls free. Your AC reduces by 1 until repaired. |\n| 7 | You swing so hard that you spin around, losing sight of the battlefield. You are surprised until your next action. |\n| 8 | Your missed strike leaves you yet more vulnerable. You provide advantage on the next attack made against you. |\n| 9 | Your weapon becomes lodged in the ground or a nearby object. You must use an action to free it. |\n| 10 | You exhaust yourself with the failed attack. You suffer one level of exhaustion. |\n| 11 | You accidentally strike yourself in the recoil. Roll your damage die and take half the rolled damage. |\n| 12 | You harmlessly strike a nearby creature who wasn't in melee with you, making yourself their new target. |\n| 13 | You let your guard down. The next attack against you has advantage. |\n| 14 | You lose your footing and your movement speed is reduced by half until the end of your next turn. |\n| 15 | Your swing wildly off-course, and your vision blurs from the off-balance maneuver. You are blinded until the end of your next turn. |\n| 16 | In your overzealous offense, you leave your defense wide. The enemy you attacked can make an opportunity attack against you. |\n| 17 | You miss your mark and hit a sensitive spot on a nearby ally. Roll weapon damage minus your Strength modifier. Your ally takes that damage (minimum of 1). |\n| 18 | Your weapon strikes a nearby hard surface causing a shower of sparks. This catches your eye, distracting you. You are dazed until your next turn. |\n| 19 | Your overextended attack leaves you open to a sound blow. The next attack against you automatically hits. |\n| 20 | Your missed attack leaves an opening for your enemy. They receive a free immediate melee attack against you. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Melee"
    },
    {
      "rawText": "## Ranged\r\n| d20 | Ranged Attack Critical Failure Mishap |\n|--------|-----------------------------------|\n| 1 | The string on your bow snaps, rendering it unusable until a replacement string is found or mended. |\n| 2 | Your unleashed projectile errantly strikes an ally instead of the intended target, dealing normal damage. |\n| 3 | Your arrow or bolt shatters on release sending sharp splinters into your hand, causing 1d4 piercing damage. |\n| 4 | After an improper release, your thrown weapon ends up too far away to be easily retrieved. |\n| 5 | Your launched attack not only misses the target but ricochets dangerously — all creatures within 10ft of the target must make a Dexterity saving throw or take 1d4 damage. |\n| 6 | Your weapon slips from your grasp and is hurled 10 feet in a random direction. |\n| 7 | The pull of the bowstring throws you off-balance – you lose your next reaction. |\n| 8 | Your off-target missile accidentally ignites a small, unattended flammable object within range. |\n| 9 | An unlucky flick of the wrist leaves your projectile weapon embedded in a nearby tree or wall, out of reach until you spend an action to recover it. |\n| 10 | Your poorly loosed ammunition breaks upon impact – subtract that ammunition from your inventory permanently. |\n| 11 | Your wild throw or shot scares a local wildlife causing a loud noise that attracts nearby enemies or causes a general disturbance. |\n| 12 | Your released projectile inaccurately hits and breaks an object in your pocket, potion, scroll, etc. |\n| 13 | Your weapon becomes tangled in your gear. You must spend your next action freeing it. |\n| 14 | The physical strain of the botched attack has stressed the weapon – the range of your next shot is halved. |\n| 15 | Your ammunition is ruined on the misfire. You lose an additional piece of ammo from your inventory. |\n| 16 | A pulled muscle from your effort leaves you temporarily weakened – subtract 1 from all ranged attack rolls until you complete a short rest. |\n| 17 | The strong recoil of the attack stumbles you backwards, moving you 5 feet away from your original position. |\n| 18 | The weapon is dislodged from your grip, falling to your feet. You must use your next action to retrieve it. |\n| 19 | Your aim was so poor that your projectile loops around and lands near the enemy, providing them with an improvised ranged weapon. |\n| 20 | Your blundering attack has left you temporarily disoriented – you are Stunned until the end of your next turn. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| \\#  | Mishaps due to a critical failure on an arcane attack |\n|---|---|\n| 1  | Your spell backfires, causing you to take damage equal to the spell level |\n| 2  | A surge of wild magic causes you and all around you to become invisible for 1 round |\n| 3  | The spell targets a random ally within range instead of your intended target |\n| 4  | Your attack misses wildly, damaging any cover or obstacles near the enemy |\n| 5  | You unexpectedly teleport 10 feet in a random direction. If you appear in an occupied space, take 1d6 force damage |\n| 6  | Your spell fizzles out entirely. You lose the spell slot without effect |\n| 7  | Arcane energy leaks out, causing an antimagic field in a 10-foot radius around you for 1d4 rounds |\n| 8  | You accidentally strengthen the enemy, giving them advantage on their next attack |\n| 9  | You are momentarily silenced, unable to cast spells that require verbal components for 1 turn |\n| 10 | The magical energies you conjure are too volatile, you are stunned until the end of your next turn |\n| 11 | Suddenly, you can't remember how to cast any spells. For the next round, you are unable to cast any spells |\n| 12 | A gust of wind blows out any lights and sends small unattended objects flying |\n| 13 | Arcane energy surges, draining your magical strength. All your spells are at disadvantage for the next turn |\n| 14 | A subtle change in the weave of magic around you causes every creature within 10 feet to gain 1d6 temporary hit points |\n| 15 | You are knocked prone from the force of the botched spell |\n| 16 | A mishap in the casting process causes you to speak only in a foreign language until you next long rest |\n| 17 | The ground beneath you becomes difficult terrain from an unexpected outburst of magical energy |\n| 18 | You unintentionally create a minor illusion of yourself, that immediately runs away |\n| 19 | The spell energy turns inward, absorbing into your weapon making it magical for the next 1d4 rounds |\n| 20 | Your spell ricochets back towards you. Make a Dexterity saving throw to dodge it |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Arcane"
    },
    {
      "rawText": "## Melee\r\n| D20 Roll | Boon |\n|---|---|\n| 1 | Your critical strike lands in a vital area. Double your damage dice rolled. |\n| 2 | Your attack sends shockwaves through your opponent's body. They're stunned until the end of their next turn. |\n| 3 | You find an opening in your opponent's defenses. Your next attack against them has advantage. |\n| 4 | Your attack is so forceful it knocks your enemy prone. |\n| 5 | Your superior technique allows you to recover a weapon use. |\n| 6 | The ferocity of your strike forces your opponent to drop their weapon. |\n| 7 | You exploit a weakness in your opponent's armor. They have a -2 penalty to AC until repaired. |\n| 8 | The intensity of your attack inflicts a bleeding wound. Your opponent takes 1d4 damage at the start of their turn for the next three rounds. |\n| 9 | Your melee attack lands with such accuracy, your enemy's speed is halved until the end of their next turn. |\n| 10 | Your forceful attack pushes your enemy back 5 feet. |\n| 11 | You disrupt your enemy's attack by attacking their weapon hand. They have disadvantage on their next attack roll. |\n| 12 | Inflict an additional 1d6 damage due to precision. |\n| 13 | Your opponent is left open after your attack. Allies have advantage on the next attack roll against your opponent. |\n| 14 | Your fierce fight style scares nearby enemies. Enemies within 10 feet of you take a -1 penalty to their next attack roll. |\n| 15 | You break your enemy's concentration. They cannot cast spells until the end of their next turn. |\n| 16 | Your flawless technique lets you make another attack as a bonus action. |\n| 17 | Your opponent is so surprised by your attack they are unable to take reactions until their next turn. |\n| 18 | Your attack empowers you, restoring 1d4 hit points. |\n| 19 | Your devastating strike makes your opponent lose their next bonus action. |\n| 20 | Inflict maximum damage on your attack roll, and the target must succeed on a DC 15 Strength saving throw or be knocked unconscious. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Melee"
    },
    {
      "rawText": "## Ranged\r\n| d20 Roll | Boon Due to Critical Success on Ranged Attack |\n|---|---|\n| 1  | Arrow/bolt sparks a chain reaction, causing small, additional explosions (additional 1d6 fire damage to all enemies within a 5-foot radius). |\n| 2  | A precision strike disrupts the target's spellcasting. They must succeed a concentration check or lose any spell they are preparing. |\n| 3  | Strike hits a vital organ, inflicting an additional 1d4 ongoing bleed damage for 3 rounds. The target can make a DC10 Constitution saving throw to stop the bleeding. |\n| 4  | Your projectile ricochets off the target and strikes an additional enemy, roll for attack and damage for the second target. |\n| 5  | The sheer power of the shot knocks the enemy back 10 feet, possibly causing falling damage. |\n| 6  | Target's extravagant jewelery is hit, causing bits of the expensive material to embed in the target's flesh for an additional 1d4 damage. |\n| 7  | Projectile splits into multiple shards upon impact, hitting nearby enemies for half of the initial damage up to 10 feet away. |\n| 8  | A quick and nimble shot snatches the weapon out of an enemy's hand, disarming them. |\n| 9  | Arrow/bolt goes straight through a weak spot in the enemy's armor, reducing their AC by 1 for the duration of the combat. |\n| 10 | With perfect precision, you shoot the enemy's mouth shut, preventing them from casting verbal spells for 1 round. |\n| 11 | Your attack scares the enemy, giving them a disadvantage on their next attack roll. |\n| 12 | The audacious feat of your shot inspires allies, giving them advantage on their next attack roll. |\n| 13 | Your strike results in an intimidating wound, causing other enemies to make a Wisdom saving throw or become frightened. |\n| 14 | Passionate power behind the shot results in the target being stunned for their next turn. |\n| 15 | An almost impossible shot breaks the opponent's defense, giving your allies an advantage in their attacks against the target until the end of your next turn. |\n| 16 | Target's spell component pouch/sacred symbol/component is destroyed, preventing spellcasting requiring these components. |\n| 17 | A blindingly quick shot knocks an important object (GM's choice) from the target's possession. |\n| 18 | Your shot forces the target to drop prone. |\n| 19 | Long-lasting pain distracts the target, giving them a disadvantage on concentration checks until the end of combat. |\n| 20 | Your shot is so impressive, it leaves an enduring impression on witnesses. You gain advantage in Intimidation or Persuasion checks (your choice) against them. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| d20 Roll  | Boon Due to a Critical Success on an Arcane Attack |\n|-------------|-----------------------------------------------------|\n| 1   | The target is stunned until the end of your next turn.                             |\n| 2   | The target is thrown back 10 feet and is knocked prone.                            |\n| 3   | The spell's area of effect doubles in size.                                        |\n| 4   | The arcane energy leaves the target vulnerable to the spell damage type until the end of your next turn. |\n| 5   | The arcane energy heals you for a number of hit points equal to your spellcasting modifier. |\n| 6   | Arcane energy remains in the area, acting as difficult terrain for your enemies until the end of your next turn. |\n| 7   | The shocking force of the spell inhibits the target's vision, causing their attacks to be at disadvantage until the end of your next turn. |\n| 8   | The spell's damage die upgrades one step (i.e., a d6 becomes a d8). |\n| 9   | The arcane energy severs the target’s connection to their own magic, preventing them from casting spells until the end of their next turn. |\n| 10  | By harnessing the spell's residual energy, your next spell cast before the end of your next turn has its spell level increased by one. |\n| 11  | The spell penetrates defenses, ignoring any resistance or immunity the target has to its damage type. |\n| 12  | Arcane resonance with the target grants you insight into their vulnerabilities, granting you advantage on your next attack against them. |\n| 13  | The spell's arcane energy shields you, providing +2 to your AC until the start of your next turn. |\n| 14  | The spell's potency frightens nearby enemies, causing them to have disadvantage on saving throws until the end of your next turn. |\n| 15  | The spell's power cascades, dealing half of its original damage to an additional enemy within range. |\n| 16  | The extreme precision of your spell allows you to repeat the attack on your next turn using the same roll. |\n| 17  | The energy of your spell bolsters allies within 10 feet, giving them a +1 bonus to their next attack roll. |\n| 18  | Arcane backlash from the spell tears into otherworldly creatures, dealing additional damage equal to your spellcasting modifier to any summoned or extraplanar beings within the spell's area. |\n| 19  | The raw arcane power intimidates your enemies, reducing their speed by half until the end of their next turn. |\n| 20  | The target takes damage equal to twice your spellcasting ability modifier at the start of each of their turns for the next minute until they receive magical healing or succeed on a Constitution saving throw at the end of their turn. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Krito | A fiercely loyal Aarakocra soldier with proud, colorful plumage. Skilled in spear combat. |\n| 2          |Silaris| A quiet and solemn scholar. Her feathers are a muted grey, matching her serious demeanor. |\n| 3          | Pivek | A stern scout with battle-scarred wings. Known for his unerring sense of direction. |\n| 4          | Tiroth | An Aarakocra elder, frail but wise. His once vibrant plumage fades more each day. |\n| 5          | Lianara | A nimble and agile messenger renowned for her speed. Her feathers are sky blue. |\n| 6          | Norath | A hardened warrior, scars crisscrossing his body and wings telling tales of numerous battles. |\n| 7          | Hantor | A silent and mysterious hermit. Very few have seen the beautiful, emerald-green of his plumage. |\n| 8          | Riala | An experienced healer with soft, calming white feathers. She is deeply respected by her community. |\n| 9          | Verath | A patient and persistent hunter. His feathers blend perfectly with the night sky, making him an excellent predator. |\n| 10         | Glinara | A knowledgeable navigator renowned for her intricate and accurate maps. Her feathers are a bright yellow. |\n| 11         | Thorek | An unyielding guardian known for his incredible strength. His feathers are as grey and solid as stone. |\n| 12         | Fesha | A quiet and composed tailor known for crafting the finest clothes and accessories. She has ginger feathers. |\n| 13         | Kerith | An Aristocratic Aarakocra, his pristine, white plumage a sign of status. Known for his strict but fair rule. |\n| 14         |Meraia| A renowned wind singer. Her soft voice carries over miles, her plumage a vibrant red. |\n| 15         | Varial | A heroic figure in the Aarakocra community known for his bravery. His feathers are bronze. |\n| 16         | Eliri | Eliri is a promising young scholar. Her feathers are a mix of beautiful purples and blues. |\n| 17         | Parvan | Parvan is a skilled blacksmith, respected for his quality work. He has smoky grey feathers. |\n| 18         | Antaris | A weather-worn ocean navigator, his feather's color match the frothy ocean waves. |\n| 19         | Quinar | Quinar's feathers have lost their color with age, but not his spirit. A storyteller of great importance. |\n| 20         | Nalara | An agile huntress, her feathers a blending grey allowing her to disappear into the shadows. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Elysia | A solemn Aasimar Paladin in gleaming armor, she holds a profound sense of justice. |\n| 2 | Galathiel | A reserved Aasimar Cleric, he brings comfort and healing to all in need. |\n| 3 | Seraph | A dutiful Aasimar Ranger, her celestial heritage can be seen in her glowing eyes. |\n| 4 | Orion | A hardened Aasimar Fighter, he wears battle scars with pride and dignity. |\n| 5 | Altariel | A composed Aasimar Wizard, she hands down divine knowledge with composure. |\n| 6 | Nemara | A serene Aasimar Monk, her movements are fluid and filled with quiet power. |\n| 7 | Telindra | A calm Aasimar Druid, she’s in perfect harmony with the nature around her. |\n| 8 | Luminor | A watchful Aasimar Rogue, his moral compass never wavers. |\n| 9 | Thaliel | A stoic Aasimar Sorcerer, her magic hums with a celestial energy. |\n| 10 | Sariel | A steadfast Aasimar Bard, her songs fill listeners with a sense of peace and hope. |\n| 11 | Elanis | A solemn Aasimar Warlock, his celestial pact allows him to channel divine energy. |\n| 12 | Ithariel | A composed Aasimar Artificer, she constructs intricate mechanisms blessed by divine hands. |\n| 13 | Arisa | A watchful Aasimar Mystic, her celestial lineage is clearly visible in her astral powers. |\n| 14 | Caelum | A calm Aasimar Oracle, his visions are bestowed by celestial deities. |\n| 15 | Deliah | An unwavering Aasimar Knight, she’s the shining beacon amidst bleak battles. |\n| 16 | Uriel | A sturdy Aasimar Paladin, he serves celestial hosts with undying loyalty. |\n| 17 | Solaria | A dutiful Aasimar Healer, her gentle touch can relieve the most severe wounds. |\n| 18 | Celestia | A serene Aasimar Seer, her prophetic visions are blessings from celestial planes. |\n| 19 | Archael | A watchful Aasimar Guardian, his celestial might is induced by divine justice. |\n| 20 | Evandor | A composed Aasimar Prophet, he foresees the divine will with uncanny precision. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n| Dice Value | Name            | Description                                                                                 |\n|------------|-----------------|---------------------------------------------------------------------------------------------|\n| 1          | Culdrak         | A tall, rancorous Bugbear with sharp teeth and red eyes. He has distinctive tribal tattoos. |\n| 2          | Broken Tooth    | A menacing, one-eyed Bugbear. He is missing his left canine, giving him his name.            |\n| 3          | Thokk           | A massively built Bugbear snarling with malice. Covered in scar tissue from many battles.   |\n| 4          | Snarl           | A hulking Bugbear with a harsh and raspy voice. His eyes brim with undisguised hatred.      |\n| 5          | Kreeg           | A lean, fast Bugbear with a cunning gaze. He's responsible for numerous raids.              |\n| 6          | Grizzle         | An old and lighter-colored Bugbear. His experience and wisdom make him deadly.             |\n| 7          | Bone-Nose       | A hunchbacked Bugbear with an eerie bone piercing his broad nose. Terrifying and mysterious.|\n| 8          | Flesh-Tearer    | A Bugbear with vicious claws and a notorious reputation for savagery.                       |\n| 9          | Skrug           | A Bugbear brawler with an intimidation factor that matches his immense size.                |\n| 10         | Iron Hide       | A Bugbear with an unusually thick skin that has thwarted many sword strokes.                |\n| 11         | Ravage          | A brutal Bugbear warrior who revels in the heat of battle. Marred with numerous tattoos.    |\n| 12         | Sneer           | A treacherous Bugbear with a nasty smile, always planning something sinister.               |\n| 13         | Blight          | An eerie Bugbear shaman, marked with ritualistic scarring. His gaze holds a dark promise.   |\n| 14         | Gutwrench       | A hideous Bugbear butcher known for his cruel and unusual methods.                          |\n| 15         | Crackle         | A Bugbear who has perfected the art of torture. His maniacal laughter is the stuff of legends.    |\n| 16         | Rend            | An agile Bugbear striker, silent and deadly, his foes often don't know they're targeted until too late.    |\n| 17         | Blackclaw       | A ruthless Bugbear with onyx-black claws, his reputation of terror precedes him.    |\n| 18         | Crag            | A Bugbear with a weathered and rugged exterior, his cold stare speaks of countless battles. |\n| 19         | Flint           | A scarred Bugbear, his flint-hard countenance has seen it all and fears none.   |\n| 20         | Gorefix         | A hulking Bugbear chief, his brutal strategies have led to widespread fear and respect among his clan. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Hrix | A stoic Changeling who tends to mirror the attitudes and behaviors of those around them—whether for better or worse. |\n| 2 | Adeya | A watchful Changeling spy with an array of carefully practiced faces. Known for carrying out covert operations with serious precision. |\n| 3 | Bris | A hardened Changeling bounty hunter who has an uncanny ability to track their prey across wildly disparate environments. |\n| 4 | Japha | A weary Changeling penman who has perfected the handwriting of hundreds of royal scribes, clerks, and dignitaries over the years. |\n| 5 | Thell | A quiet Changeling cleric who serves the god of change and transition, striving in every action to act as a reflection of their deity's desire for flux and evolution. |\n| 6 | Dez | A ruthless Changeling mercenary known for their cruel efficiency on the battlefield. Perfectly blending into enemy ranks only to wreak havoc within them. |\n| 7 | Nalma | A diligent Changeling herbalist with a deep understanding of vegetation from across the realm, frequently used to concoct useful potions and incense. |\n| 8 | Yil | A cautious changeling wanderer who has mastered the mannerisms of a broad spectrum of races, both common and rare, in their wealth of travels. |\n| 9 | Unin | An agile Changeling thief who uses their transformative abilities to evade capture and infiltrate high-security areas with near faultless accuracy. |\n| 10 | Eirz | A shrewd Changeling tradesman whose ever-changing appearance allows them to negotiate with clients of various races and backgrounds, always offering the perfect deal. |\n| 11 | Vola | A renowned Changeling fencer known both for the elegance of her movements and her intimidating, cold focus in combat. |\n| 12 | Host | A meditative Changeling shapeshifter renowned for their mastery over their body's transformations, reputed to have studied under ancient druids. |\n| 13 | Gan | A pious Changeling devotee who serves a mysterious deity and mirage of appearances, depending on the religious persuasion of those they encounter. |\n| 14 | Shire | A self-controlled Changeling courtier who leverages their unique racial abilities to subtly manipulate court politics behind the scenes. |\n| 15 | Zont | A determined Changeling archaeologist who uses their shape-changing abilities to decipher ancient texts and explore dangerous ruins. |\n| 16 | Reem | A dutiful Changeling knight who keeps their true identity hidden beneath the suit of armor. Their name is spoken with a mix of reverence and fear. |\n| 17 | Halix | A withdrawn Changeling librarian that makes use of their shape-shifting to pose as different librarians in various libraries around the kingdom. |\n| 18 | Qilo | A somber Changeling soothsayer who uses the colors and shapes of their own body to tell fortunes - their abilities earned them a serious reputation. |\n| 19 | Omender | A meticulous Changeling investigator with an uncanny knack unleashing their transformative abilities to crack the most complex of cases. |\n| 20 | Tysh | An enigmatic Changeling who lives as a recluse on the edge of civilization—they welcome visitors but change faces with each one, creating an air of surveillance and unease. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Pyrrhus | An ancient red dragon with scales scarred from countless battles. His eyes gleam with intelligence and a fiery determination. |\n| 2 | Seraphina | A young silver dragon, curious and intelligent, but more reserved in her interactions with non-dragons. Her scales shimmer brightly, reflecting the daylight. |\n| 3 | Oculus | An adult crystal dragon, sees all and knows all within its domain. Its body almost entirely transparent, it is hard to discern its exact shape.  |\n| 4 | Tempest | A storm blue dragon with an affinity for the sea. It's rumored that Tempest controls the ocean currents and the storms that frequent the coast. |\n| 5 | Thundertail | An ancient bronze dragon with scales that have turned green due to age. Thundertail is a supernatural creature capable of casting powerful lightning attacks. |\n| 6 | Obsidian | An adult black dragon, fearsome and self-absorbed, lives in the heart of a dark swamp. Its acid breath is as notorious as its cruel cunning. |\n| 7 | Elysium | A celestial dragon maintaining the balance of life and death. It's known for its multicolored scales and eyes that resemble twin galaxies. |\n| 8 | Viridian | A green dragon renowned for its woodland camouflage, poisonous breath, and duplicitous nature. |\n| 9 | Frostguard | A white dragon known for its icy demeanor and chilling aura. It is said that breathe from Frostguard can freeze a man to death in mere moments. |\n| 10 | Solarflare | Known mostly through legends, Solarflare is a sun dragon whose golden scales are said to blaze brighter than the sun itself. |\n| 11 | Breach | A mountain dragon widely known for causing landslides and earth-shattering quakes. Breach's earth-colored scales make him blend effortlessly with rocky terrains |\n| 12 | Marina | A water dragon known to manipulate water bodies. She mostly lives in seclusion in a vast oceanic abyss. |\n| 13 | Nekros | A shadow dragon that has the capacity to step between worlds, Nekros has terrorized many realm with his chilling presence. |\n| 14 | Crystalis | A rare gem dragon whose scintillating scales are sought after for their magical properties. She is a peaceful being generally but possesses immense power. |\n| 15 | Stardust | An ageless star dragon known for its cosmic breath and wisdom spanning millenniums. Stardust's body glows with a dim light from a distance like a star. |\n| 16 | Whisper | A cloud dragon who remains hidden, creating and guiding wind currents. Her voice is said to be heard in the rustling of leaves and the howling of wind. |\n| 17 | Balefire | A volcanic dragon that dwells deep within an active volcano. The radiating heat surrounding Balefire makes it near impossible for anyone to approach.   |\n| 18 | Prism | A light dragon who has the power to bend light to its will. It is said that gazing directly at Prism is akin to staring into the sun. |\n| 19 | Vanta | Known in whispers across the lands as a void dragon, Vanta consumes all matter and energy in its path. No one knows its true appearance. |\n| 20 | Wyrmheart | A time dragon who exists between the present and future. Wyrmheart's ancient and gnarled appearance is said to be an embodiment of the passage of time itself. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Tarhun Goldentide | A seasoned warrior, Tarhun stands proudly, his golden scales catching the light brilliantly. His focus on honor is unwavering, and his stern gaze reveals a strict sense of duty. |\n| 2 | Korthiv Deepfire | Scholar and sage, Korthiv's red scales are reminiscent of deep lava flows. His knowledge in arcane is immense, bringing a sense of respect and seriousness to his character. |\n| 3 | Sivex Shadowfang | This Dragonborn rogue, with blackened scales, is full of stealth and intrigue. He may not say much, but his actions speak of a deadly precision and seriousness. |\n| 4 | Paelias Wavecrash | A blue-scaled sailor, Paelias has a commanding presence, his cool gaze as deep as the ocean. He's all about discipline, promising a severe punishment for those who dare cross him. |\n| 5 | Mireili Smokeheart | Mireili is an alchemist and healer with ash-gray scales. Her calm, composed demeanor is set off by her unwavering resolve to aid those in need with her potent concoctions. |\n| 6 | Gwennith Frozenspire | Gwennith is an icy white Dragonborn, a cleric who upholds her deity's teachings with an ardent zeal that few can match. She is formal to the point of appearing cold. |\n| 7 | Nemeia Emberclaw | This Dragonborn wizard's red scales reflect her affinity with fire magic. Her dedication to scholarly pursuits makes her a serious individual, focused on her magical research. |\n| 8 | Zephyr Windrider | His silver scales shimmering like gusty wind, Zephyr is a ranger soaring the skies. He holds himself to a rigorous code which makes his character austere and intimidating. |\n| 9 | Elysia Lightgaze | A cleric with golden scales, Elysia is devoted to her deity, embodying a clear respect for laws and order, making her a truly determined defender of the faith. |\n| 10 | Torgar Hammerfall | Torgar, a black-scaled Dragonborn, is a stern blacksmith. He is serious about his craft, producing melee weapons of exceptional quality with austere dedication. |\n| 11 | Draax Thunderroar | Draax's bronze scales echo his affinity for lightning and storms. This Paladin is disciplined and stern, using his divine powers to maintain balance and order. |\n| 12 | Tharyssa Icebound | Tharyssa is a noble fighter adept with the greatsword. Her icy blue scales mirror her austere nature and precise fighting style that she relentlessly maintains. |\n| 13 | Seraphus Skyshaper | Seraphus, a blue-scaled Dragonborn, is a storm sorcerer of great power. His solemn manner conveys the monumental weight of controlling the weather within his palms. |\n| 14 | Caladrel Moonbeam | Caladrel's silver scales reflect the moonlight, aligning with his profession as a nocturnal scout. His quiet and serious demeanor make him a trustworthy ally in dangerous tasks. |\n| 15 | Molikar Stoneheart | A heavily built earth shaper, Molikar's brown scales exude a sense of strength and resolve. This geomancer takes his role with profound gravity and utter dedication. |\n| 16 | Nortis Galewing | With silver scales, Nortis is a serious Dragonborn bard. Despite his musical talent, he is no jester, instead preferring solemn, historical epics and ballads. |\n| 17 | Kythorn Greenmantle | A green-scaled Dragonborn druid, Kythorn often keeps his emotions under close wraps, preferring to be serious and conscious of the balance in nature. |\n| 18 | Cyndor Sunbrand | Cyndor, a paladin with golden scales, holds his duty to his order in the highest regard. His solemnity is palpable, holding his convictions severely firm. |\n| 19 | Sheldrake Ironscale | Sheldrake is a red-scaled blacksmith. His craft is everything to him, and his work exudes a serious dedication to strength and resilience. |\n| 20 | Selarn Dawnbreaker | Selarn, a golden-scaled Dragonborn, is a vigilant sentinel. Her solemn demeanor and dedicated service to her group reveal an uncompromising character. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Vorn Jaelre | A stern-faced drow cleric, dedicated to the service of Lolth and her chaotic precepts. |\n| 2 | Adinida Mizzrym | A skilled and calculating drow rogue, always plotting her next move from the shadows. |\n| 3 | Aevor Brundreth | A fearless drow warrior with a brutal reputation on the battlefield. |\n| 4 | Zilarus Xorlarrin | A cunning drow wizard with a keen interest in the dark arts and forbidden knowledge. |\n| 5 | Thalynril Baenre | A stoic drow ranger, bound by a code of honor unfamiliar to most of his kin. |\n| 6 | Durza Kenafin | A drow warlock, devoted to his patron and capable of terrifying magical feats. |\n| 7 | Caelkoth Auvryndar | A respected drow noble known for his political ambition and ruthless strategy. |\n| 8 | Llaevyd Hlaund | A skilled drow craftsman renowned for his quality wares and meticulous craft. |\n| 9 | Fryrn X'larraz'et'ghaun | A disfigured drow assassin whose face is hidden behind a mask, as ominous as death. |\n| 10 | Ireara Melarn | A cold drow matriarch, ruling her family with an iron fist. |\n| 11 | Valdarin Urden | A drow bard, his captivating music hides a dark past. |\n| 12 | Aunrae T'sarran | An enigmatic drow alchemist fascinated with poisons and death. |\n| 13 | Nolovan Khalazza | A scholar, whose obsession with arcane knowledge overshadows typical drow politics. |\n| 14 | Seldraeil Nasadra | A drow druid, who communiques with the creepy-crawlies deep in the Underdark. |\n| 15 | Ziliyana Hlareth | A drow paladin, she seeks redemption for her race through virtuous acts. |\n| 16 | Elthyria Triskelion | A drow warlord, every conquest fuels her insatiable hunger for power. |\n| 17 | Villyth Ra'afan | A drow monk, his discipline is in stark contrast to the chaotic society of his kin. |\n| 18 | Baelnorn Durel | A drow mystic, his cryptic predictions are respected and feared. |\n| 19 | Zilvrae Do'Urden | A drow mercenary, she sells her blade to the highest bidder. |\n| 20 | K'lar D'thoop'ol | A drow priestess, who delivers judgement and punishment on behalf of Lolth. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Thargrim Stoneheart | A stern duergar warrior, his grey skin marked by numerous scars. His expression is hard set, weathered by the underground's harsh realities.\n| 2 | Dagnal Forgeflame | A duergar blacksmith, master in shaping the rarest of metals. Her eyes have the focused intent of a master craftsman.\n| 3 | Grunyar Shadowrift | An elusive duergar rogue, shrouded in cloaks that mimic the dark of the Underdark. Known for his silent demeanor.\n| 4 | Vondal Frostbeard | A duergar cleric of Deep Duerra, his chill breath hinting at his affiliation to cold divine powers.\n| 5 | Kurdan Bloodaxe | Battle-hardened duergar chieftain. Boasts a dark-red stained axe from defeating a mind flayer colony.\n| 6 | Baelnar Mithrilvein | A wealth obsessed duergar merchant. His insatiable craving for the glimmer of mithril is legendary.\n| 7 | Harnan Earthshaker | A duergar geomancer with control over earth and stone. His powers have led to many mining breakthroughs.\n| 8 | Orn Firehand | A stout duergar brewmaster, his strong ales famed throughout the Underdark. More cheerful than most of his kind, but fiercely protective of his recipes.\n| 9 | Zarka Stonespeaker | Female duergar lorekeeper, keeper of ancestral knowledge. Speaks in hushed whispers that echo in stone corners.\n| 10 | Nardruk Ironshield | Dutiful duergar guard captain, respected among his kind. His impenetrable shield technique is widely revered.\n| 11 | Thulgrim Flintfist | A proud duergar miner. He's devoted his life to extracting Underdark's riches and his knuckles resemble the flintstones he mines.\n| 12 | Yurak Blightbender | A deceitful duergar illusionist, feared for his mind-bending illusions. He's distrusted even among his own.\n| 13 | Druzzil Earthrender | Duergar earth savant, capable of shaping the very terrain. Her presence is often sought in duergar expansions.\n| 14 | Grozhar Diamondhide | Crafty duergar tanner with intricate knowledge of Underdark creatures. His work in diamond-hide armor is unparalleled.\n| 15 | Gruuntham Gloomseer | A taciturn duergar prophet, known for cryptic and often grim prophecies. Many duergar seek his dark wisdom.\n| 16 | Kildrak Spiderbane | Duergar beastmaster, famed for slaying giant spiders. The spider mandible necklace he wears attests to his conquests.\n| 17 | Dankil Frostforger | Duergar sorcerer specializing in cold magic. His frost-forged weapons are a marvel.\n| 18 | Thundar Steelgrip | A duergar weaponmaster, with a vice-like grip and knowledge of many weapons. His training methods are rigorous, producing efficient warriors.\n| 19 | Vistra Ghostward | A duergar mystic acknowledged for her work with ghostly energies. Her spectral wards offer protection to her kin.\n| 20 | Morgran Ironvein | The grizzled duergar king, his rule upheld by iron fist and indomitable will. His deep-rooted resolve radiates in his presence.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| Dice Value | Name           | Description                                                                                        |\n|------------|----------------|----------------------------------------------------------------------------------------------------|\n| 1          | Torin Stonearm | A veteran blacksmith; has an obsession with perfection, often remaking pieces multiple times    |\n| 2          | Durnar Ironbeard | A grumpy old miner; values hard work and has little patience for idle hands                         |\n| 3          | Grunnar Battlehammer | A seasoned war veteran; stern and reserved with scars decorating his hardened face              |\n| 4          | Dargrim Deepdelve | A knowledgeable geologist and spelunker; he has a profound respect for the earth he explores    |\n| 5          | Thrain Battleborn | A professional soldier; follows orders to the letter and expects the same of his allies          |\n| 6          | Norn Bloodaxe | A passionate weapon crafter; each weapon he creates tells a story of valor and courage           |\n| 7          | Brommear Earthshaper | A devoted cleric of the Forgefather; dedicated to his faith and his community                  |\n| 8          | Svard Broadshield | A stoic and protective city guard; always watchful, ever vigilant                               |\n| 9          | Karr Coppervein | A diligent ore trader; affable in nature but shrewd in business                                 |\n| 10         | Agnar Flintlock | A master marksman; a stern and precise teacher who demands the best from his pupils                     |\n| 11         | Arn Stouttankard | A jovial and boisterous tavern owner; his love for a good ale is only surpassed by his work ethic |\n| 12         | Urdon Bonecarver | A skilled artisan; reserved and meticulous, his work is second to none                          |\n| 13         | Fargrim Frostbeard | A wise elder; his stories of the past are as harsh and cold as his homeland                      |\n| 14         | Groth Ashenhand | A humble charcoal burner; scarred and soot-stained but proud of his honest work                 |\n| 15         | Skald Steingaze | A stoic stone mason; his hand-crafted works are the envy of all Dwarvendom                     |\n| 16         | Bellrar Barleybrew | A acclaimed brewmaster; his dedication to his craft is evident in every barrel                   |\n| 17         | Drak Silverknuckle | A Valorous warrior; his silver prosthetic hand serves as a reminder of battles past            |\n| 18         | Korz Flintfinder | An expert scout; quiet and watchful, his eyes miss nothing                                      |\n| 19         | Hurd Oathbinder | A solemn judge; his word is absolute, his decision is final                                        |\n| 20         | Boltar Thunderhorn | A charismatic bard; his ballads are as thunderous as they are captivating                          |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Eldarin Silverleaf | A stern and silent sentinel, Eldarin is a seasoned ranger with an unbreakable will. Always alert for signs of danger, his bow is never far from his grasp. |\n| 2 | Thalion Evenwind | This regal elf lord rules with a calm, fair hand. Constantly surrounded by advisors, he is as much a scholar as he is a warrior, favoring strategy and wisdom over brute force. |\n| 3 | Caelynn Moonwhisper | An ethereal and contemplative wizard, moving like a wisp of wind in her enchanted robes. Her time is often spent gazing at star maps and ancient arcane texts. |\n| 4 | Arannis Dawntracker | This intense and cunning hunter's golden eyes miss nothing in the wilderness. Though he rarely speaks, he communicates fluently with nature. |\n| 5 | Melrial Starshadow | An elusive rogue who prefers the cover of shadows. Might be seen flickering in the darkness of a fortress hallway, her intentions unknown. |\n| 6 | Eolande Fairweather | A charismatic and capable bard, Eolande's lilting songs carry tales of forgotten lore and distant lands. She often uses her music to sway the hearts of those around her. |\n| 7 | Haladon Stormwatcher | A cleric with an unwavering faith in the goddess of the storm. His solemn prayers echo with the force of the raging tempest. |\n| 8 | Thaliril Nightwind | A mystic druid who draws her power from the moon. Silent as the midnight breeze, she tends to the balance of nature in her sacred grove.|\n| 9 | Evindal Frostvein | An aloof and well-respected sorcerer. His icy demeanor masks a powerful command over cold magic, sending shivers down the spines of his enemies. |\n| 10 | Lathaiel Lightweaver | A patient and tenacious monk. Striding about barefoot, with sunlight glinting off her porcelain skin, no obstacle is too large to overcome. |\n| 11 | Aredhel Earthshadow | A sober-minded paladin, she stands as a bulwark between innocence and danger. Her emerald armor meshes perfectly with the shadows of a forest. |\n| 12 | Naelis Sunpetal | A straight-backed and dedicated warlock. In pursuit of forbidden knowledge, he has pledged himself to an ancient, godlike entity with power over the sun. |\n| 13 | Ioriele Starfall | A disciplined fighter, zealously training night and day. Her precise strikes echo with the silent fall of a shooting star. |\n| 14 | Galadon Wavedancer | A steadfast sailor who roams the seas, Galadon speaks to the waves and listens to the whispers of the deep. |\n| 15 | Lirendor Quicksilver | An agile and dexterous acrobat. Lirendor doubles as a fearsome swordsman, fleeting as a wisp of smoke in the thick of battle. |\n| 16 | Nolofinwe Firebraid | A blacksmith by trade, this fiery-haired elf tempers his weapons with the flame of his soul, producing blades that endure the test of battle. |\n| 17 | Tauriel Windwhisperer | A versatile and creative artificer with eyes brighter than her inventions. Despite her wiry frame, her machines stand as testament to her immense strength of will. |\n| 18 | Galathan Moonstalker | A stern cleric with a soft heart. His lunar blessings bring solace to allies and doom to foes disturbing the tranquility of the night. |\n| 19 | Aearon Wildfire | A ruthless barbarian with a fiery spirit. Aearon's unpredictable temper makes even the wildest beasts of the forest give him a wide berth. |\n| 20 | Iolanthe Dawnbringer | As a paladin of the dawn, her radiant aura imbues her allies with renewed vigor and hope, while striking fear into the hearts of her enemies. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n| Dice Value | Name         | Description                                \t\t\t\t\t\t\t\t\t\t |\n|------------|--------------|----------------------------------------------------------------------------------------------|\n| 1          | Caelum       | An Air Genasi with white hair-like clouds, poised and stern, a well-regarded guild master.   |\n| 2          | Ignatius     | A Fire Genasi blacksmith, his skin radiates warmth, his eyes glow like burning coals.        |\n| 3          | Vita         | An Earth Genasi herbalist with stone-like skin covered in moss, she's steadfast and solemn. |\n| 4          | Flux         | A Water Genasi sailor, his skin appears translucent, he speaks in soft-spoken tones.         |\n| 5          | Pyrrhos      | A Fire Genasi soldier with flickering hair, radiates authority, tough but just.             |\n| 6          | Arethusa     | A Water Genasi merchant, her teardrop shaped eyes change like the sea, professional and reliable. |\n| 7          | Terran       | An Earth Genasi miner, built sturdy as a mountain, reveals little emotion.                  |\n| 8          | Zephyr       | An Air Genasi bard, her voice carries the wisdom, seen as aloof but respects the truth.     |\n| 9          | Drakon       | A Fire Genasi dragon hunter, his body glows like embers, fearless and disciplined.           |\n| 10         | Petrichor    | An Earth Genasi farmer, covered in soil-like textured skin, known for his unflappable nature. |\n| 11         | Seraphina    | A Water Genasi healer, her skin shimmers like rippling water, possesses a calm temperament.  |\n| 12         | Nimbus       | An Air Genasi scribe, white hair constantly moving as if in wind, focused and meticulous.    |\n| 13         | Obsidian     | An Earth Genasi jeweler, face as hard as rock, exhibits an infallible sense of trade.        |\n| 14         | Hestia       | A Fire Genasi innkeeper, eyes flicker like candlelight, caring with a stern demeanor.        |\n| 15         | Eurus        | An Air Genasi ranger, grey eyes like storm clouds, known for his sharp wit under his quiet persona. |\n| 16         | Maelstrom    | A Water Genasi pirate, skin that ripples like waves, stern-faced and merciless in battle.    |\n| 17         | Gneiss       | An Earth Genasi architect, carries the solidity of the earth in his words and actions.       |\n| 18         | Cindera      | A Fire Genasi gladiator, her fiery spirit is as visible as the flame in her hair.            |\n| 19         | Marina       | A Water Genasi diplomat, as unpredictable as the ocean, adept at steering conversations.     |\n| 20         | Gale         | An Air Genasi weather predictor, white hair flickering like a flag, cool and focused in demeanor.|\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Alwin Tinymech | A meticulous gnome tinkerer with a serious demeanor, graying hair, and bright, focused eyes. |\n| 2 | Belenor Rockshaper | A stern and silent gnome earth-manipulator with a hardened exterior, deeply etched with stone-crafting marks. |\n| 3 | Cerali Quickbeam | An agile gnome druid, serious and dedicated to her cause, with dark eyes reflecting the depths of the forest. |\n| 4 | Delfber Wheelturn | A pragamatic gnome engineer, always logical with well-groomed hair and bits of machinery about his person. |\n| 5 | Elmeri Frostfizzle | A stern gnome cryomancer, resolute and cold with a gaze that could freeze a beholder in its tracks. |\n| 6 | Filbot Gearloose | A pragmatic and controlled gnome inventor, his fingers are smudged with ink and oil while his eyes gleam with quiet ambition. |\n| 7 | Gildri Shadowcraft | An enigmatic gnome rogue known for her seriousness and precision as much as for her stealth. |\n| 8 | Harkil Stoneheart | A stern gnome warrior, with a stone-hard countenance and an always ready posture. |\n| 9 | Imryll Frostbrook | A precise gnome scribe who meticulously documents every magic incantation and minor spell variation. |\n| 10 | Jondil Digger | A focused gnome mining expert with an expression that seems perpetually set in hardened determination. |\n| 11 | Kialdir Microbrew | An unyielding gnome brewer known for his strong beer and stronger commitment to brewing quality. |\n| 12 | Lorum Gemhand | An introverted gnome jeweler who obsessively examines every facet of his creations with a jeweler's loupe. |\n| 13 | Mekki Tinkerspark | A methodical gnome tinkerer, his beard holding clippings of his work as he labors in silence. |\n| 14 | Nastra Quickloom | A serious gnome textile artisan, her hands are swift and sure on the loom as she weaves incredible tapestries. |\n| 15 | Orim Mekkano | An unyielding gnome mechanist, he evaluates mechanisms with a stern gaze and unwavering determination. |\n| 16 | Pemnar Leafwhisper | A resolute gnome ranger, his bushy brows are furrowed in concentration as he navigates the wilderness. |\n| 17 | Quindi Flaskmaster | A clinical gnome chemist, her eyes are hidden behind protective goggles, her mind constantly churning with formulae. |\n| 18 | Rulni Silverprint | A methodical gnome cartographer, plotting out intricate maps with a steady hand and studious attention to detail. |\n| 19 | Silnora Wireweaver | A serious gnome wizard who weaves her spells together with a mix of arcane runes and wires of precious metals. |\n| 20 | Tobrin Quickgauge | A focused gnome engineer, known for his ability to assess and fix complex machinery with an unwavering concentration. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Gritsnag | A stocky, scarred goblin with grizzled, greying fur. Gritsnag has keen, yellow eyes that miss nothing. |\n| 2 | Muzgbat | A gaunt goblin with wiry muscles and a limping gait. Muzgbat's skin is pale green, and his eyes are a bright, acidic yellow. |\n| 3 | Skizzix | A small, craven goblin with a weak chin and beady red eyes. Skizzix has lost most of his teeth and is quick to surrender or flee. |\n| 4 | Grobnar | A robust goblin carrying a heavy club, Grobnar's skin is a mottled green and brown, and his dark eyes gleam with cunning. |\n| 5 | Zogwort | A wizened goblin shaman, Zogwort's grey-green skin is etched with tribal tattoos. His eyes are milky white but seems to see more than most. |\n| 6 | Blix | An eager goblin grinning ear to ear, Blix is unusually lanky. His well-kept short bow and quiver of arrows suggest he is a skilled archer. |\n| 7 | Tark | This hefty goblin has arms like small tree trunks. His skin is a deep bluish-green, and his eyes are black, gleaming with intelligence. |\n| 8 | Gorm | A wily goblin with dark green, almost black, skin. Gorm's wicked grin reveals multiple gold teeth, and his eyes glint with mischief. |\n| 9 | Krusk | This goblin is hearty and red-skinned, unusual for his kind. Krusk's eyes are an amber hue, and he wears a rugged hide armor. |\n| 10 | Pogg | Pogg is small even for a goblin, but quick and wiry. His skin is a dull yellow, and his sharp eyes are a vibrant green. |\n| 11 | Squizz | A goblin of average size and build, Squizz has a nervous twitch. His skin is a sickly green, and his large eyes are bright red. |\n| 12 | Rotgut | This goblin reeks of decay. Rotgut's green-grey skin is pockmarked with sores, and his clouded eyes are milky white. |\n| 13 | Grubnose | Stubby and plump, Grubnose is constantly sniffing the air. His skin is a dull brown, and his eyes are small and beady. |\n| 14 | Skab | This goblin is tall and wiry, with long, slim fingers. Skab's brown skin is heavily scarred, and his eyes are an unusual pale blue. |\n| 15 | Snarlfang | This stocky goblin is missing an ear. Snarlfang's grey-green skin is covered in chiseled tribal markings, and his yellow eyes gleam with malice. |\n| 16 | Nubz | Small and runty, Nubz is surprisingly swift. His skin is a muddy yellow, and his wide-set eyes are bright orange. |\n| 17 | Slak | Slak is muscular and broad-shouldered, a rarity among goblins. His dark green skin is shiny with sweat, and his eyes are a glowing crimson. |\n| 18 | Stinkrot | This goblin has a stench that turns even the toughest stomachs. Stinkrot's greenish-grey skin is covered in warts, and his small eyes are a cloudy grey. |\n| 19 | Wikk | A goblin with a wild mane of black hair. Wikk's skin is a bright green, and his squinted eyes show a disturbing charm. |\n| 20 | Yarth | A freakishly tall goblin with an elongated skull. Yarth's pale green skin stretches tight over his bones, and his eyes are jet black. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n| Dice Value | Name | Description |\n|:-:|:----------------|:-------------------------------------------------------------|\n| 1 | Thunukalathi | A Goliath known for his stern nature and unusual quietness. He's a highly-skilled guardian of his tribe, always alert and ready to defend his people. |\n| 2 | Vaunea | A female Goliath shaman, clad in intricate tribal tattoos. She's extremely serious and reserved, rarely showing any emotion. |\n| 3 | Kavaki | A solemn Goliath chieftain, his stature and silent demeanor all add to the gravity he commands in his tribe. |\n| 4 | Pethani | Former warrior, now a silent and stern weaver of the tribe. Her tapestries tell stories of the tribe's victories and losses. |\n| 5 | Ilikan | A fervently disciplined Goliath monk, known for his agility and rigorous routine. He speaks little but every word he says is carefully chosen. |\n| 6 | Lo-Kag | A dutiful Goliath hunter, known for his precise arrow shots. He's solitary and often broods alone before hunting expeditions. |\n| 7 | Nalagathi | A Goliath smith, taciturn, focused, and highly skilled. His creations are of top-notch quality and demand high respect. |\n| 8 | Gathakanathi | A Goliath historian dedicated to the preservation of her tribe's history. Her serious nature permeates all her interactions. |\n| 9 | Mawava | An incredibly disciplined Goliath scout, renowned for his stealth and tracking skills. Remains stoic, even under extreme pressure. |\n| 10 | Oovak | A Goliath artisan, known for his remarkable handiwork and meticulous attention to detail. Rarely smiles but always delivers stunning work. |\n| 11 | Egath | A seasoned Goliath storyteller known for his dry wit and tales of legendary Goliath heroes. He almost never breaks his sombre demeanor. |\n| 12 | Vano | An elder Goliath, his weathered face tells of harsh winters and challenging battles. He is wise and his words are heavy with experience and knowledge. |\n| 13 | Kanah | A wise Goliath midwife known for her unfaltering calmness during the stormiest of births. Her stern but kind nature brings comfort to many. |\n| 14 | Eglath | A young Goliath warrior, whose courageous heart outshines his slightly grim demeanor. He carries the quiet determination of a seasoned fighter. |\n| 15 | Thoragauthak | A Goliath druid whose deep connection with the land makes him reserved, serious, and incredibly wise. His quiet counsel is highly valued within the sanctuary. |\n| 16 | Anavak | A Goliath bard, whose epic sagas are told with such gravity that the whole room hushes when she starts recounting them. She is reserved and respectful of her tradition. |\n| 17 | Aukan | A Goliath herbalist. Her demeanor is typically serious and focused. Her vast knowledge of mountain flora is invaluable to the tribe. |\n| 18 | Imai | A dedicated Goliath healer whose stern face has brought both reassurance and discipline to her patients. Her silence speaks volumes of her dedication. |\n| 19 | Thotham | A Goliath potter. His pieces are practical and sturdy yet bear a sombre beauty. He's quiet and focused, rarely breaking his concentration. |\n| 20 | Paavu | A Goliath elder, known for her wisdom, she guides her tribe with a stern but fair hand. Her presence commands respect, and her words are listened to with utmost seriousness. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Erevan Sunshadow | This serious half-elf cleric maintains a stoic demeanor, only letting her guard down amongst those she trusts. She displays her sun-themed holy emblem with pride. |\n| 2 | Ivellios Starcatcher | Stern and observant, this half-elf rogue's many successful heists have earned him a notorious reputation. His quick wit is as sharp as his blade. |\n| 3 | Liadon Silverfrond | A disciplined half-elf fighter, always ready to protect those unable to protect themselves. His unwavering commitment to his duty precedes him. |\n| 4 | Enna Moonwhisper | A quiet but insightful half-elf druid. Listening more than she speaks, animals seem to trust her implicitly. |\n| 5 | Miriath Brightwind | A disciplined scholar of magic, this half-elf wizard has dedicated countless years to learning new spells. Persistent and pensive in her pursuit of arcane knowledge. |\n| 6 | Thamior Quicksilver | An accomplished half-elf bard, his stage performances are serious and full of emotion. His intense expressions while performing are a testament to his passion. |\n| 7 | Gwennith Windrider | A half-elf paladin of the winds. Valorous, stern, and unyielding, she brings swift justice to those who exploit the weak. |\n| 8 | Arannis Duskwanderer | A thoughtful and persistent half-elf ranger. With every sunset, he continues his quest for justice, cultivating a prestigious reputation within his guild. |\n| 9 | Eldrin Stormchaser | This half-elf sorcerer carries a dignified air around him. Being born amidst the tumult of a storm, he has a deep connection with the energy it emanates. |\n| 10 | Faen Mistrunner | Unflickering and relentless, this half-elf warlock is always seen surrounded in an eerie mist. His pact with an ancient entity is a fiercely guarded secret. |\n| 11 | Lorawin Nightbreeze | A disciplined half-elf monk, her movements are fluid and precise. After a tragic incident, she seeks inner peace through her daily practices. |\n| 12 | Rolen Raindrifter | Taciturn and methodical half-elf barbarian. His stoic facade hides a torrent of emotions akin to the heaviest of rains he often finds solace in. |\n| 13 | Ariawyn Shadowsong | Half-elf blood hunter, solemn and intuitive. Her soft melodies are whispers of haunting tales, aimed at intimidating her targeted prey. |\n| 14 | Quamara Swiftstream | A taciturn half-elf artificer, she employs her ingenuity for the benefit of her community. She’s always seen working on something meticulous and intricate. |\n| 15 | Eolande Silvertongue | A stoic half-elf oracle, she communicates her prophecies with a grave tone. Her eyes are as silver as her speech, adding to her mysterious aura. |\n| 16 | Selasia Starwhisper | A dutiful Spores Druid, she communes with fungi and her trance is often interpreted as cryptic whispers. Keeps a serious (sometimes seen as eerie) demeanour. |\n| 17 | Lorix Aleblossom | A dedicated Oath of Ancients Paladin, stern in his convictions. His youthful appearance and honey-toned skin are at odds with his solemn personality. |\n| 18 | Eadric Stormheart | A committed Eldritch Knight, his fierce determination matches the storm brewing within his heart. His focus in battle is unnerving for most foes. |\n| 19 | Aelene Moonbrook | A stern Children of the Night Warlock, endowed with powers from an ancient Fey pact. Her azure gaze is captivating, often luring antagonists into their doom. |\n| 20 | Elrond Greenleaf | A seasoned Ranger, his stern gaze is a reflection of the many battles he has weathered. His sage-like demeanor is highly respected by his comrades. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| Dice Value | Name            | Description                                                                            |\n|------------|-----------------|----------------------------------------------------------------------------------------|\n| 1          | Durug           | Stoic and imposing, Durug's muscles are lined with scars from many battles.            |\n| 2          | Rorke           | With piercing green eyes, Rorke rarely smiles, preferring sternness over jollity.       |\n| 3          | Gharn           | Gharn is imposing, with tusk-like teeth protruding from his lower lip.                 |\n| 4          | Sharn           | A towering figure, Sharn's eyes are wary and watchful, ever ready for any threat.       |\n| 5          | Brom            | Respectful and disciplined, Brom is an intimidating sight, standing tall at seven feet. |\n| 6          | Borog           | Skilled fighter Borog's face is etched with determination, despite his scarred visage. |\n| 7          | Thokk           | Whitened by age, Thokk's woven hair serves as a stark contrast to his dark green skin.  |\n| 8          | Ungart          | Though silent and brooding, Ungart's monstrous figure warns of his formidable strength. |\n| 9          | Karg            | Scowling and cold, Karg's muscular form is a testament to his life as a gladiator.     |\n| 10         | Narg            | Rugged and resilient, Narg's hard face bears the rawness of his orcish ancestry.       |\n| 11         | Dreg            | Dreg's large frame looms ominous, his intense eyes reflecting a brutal past life.       |\n| 12         | Brak            | Skilled blacksmith Brak's brawny arms are products of years spent by the forge.        |\n| 13         | Durrak          | Durrak's demeanor is serious, his heavily carved skin announcing a life of war.         |\n| 14         | Ogrok           | With an impressive stature, Ogrok's brawn suggests he is not to be trifled with.        |\n| 15         | Yarg            | Taciturn and troubled, Yarg's scarred face is often cloaked in a grim expression.       |\n| 16         | Zodd            | Zodd's intimidating size and meticulous discipline command respect from friends and foes.|\n| 17         | Grog            | With a cross-gnarled face, Grog's demeanor demonstrates the perils of his chosen path.  |\n| 18         | Arg             | Wide-shouldered and muscular, Arg's gaze is as piercing as it is unwelcoming.           |\n| 19         | Brog            | Scars map out Brog's life struggles on his skin, each one earned in a hard-fought battle.|\n| 20         | Skarn           | Penned face Skarn's unflinching gaze and harsh mouth points to a life of hardship.      |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Beryl Goodbarrel | A halfling with sharp eyes and a stern demeanor. He is a respected blacksmith in his village. | \n| 2 | Pimpernel Greenbottle | An old, hardened halfling woman, Pimpernel is known for her strength and wisdom as a community elder. |\n| 3 | Meriadoc Hilltopple | A halfling rogue with an elusive past. He always has a serious look in his deep-set eyes. |\n| 4 | Isengrim Underborough | An austere spellcaster, his sharp mind is just as prominent as his icy gaze. |\n| 5 | Odovacar Whitfoot | A reserved halfling scholar, known for his vast knowledge and dedication to ancient lore. |\n| 6 | Primrose Sandydowns | A solemn halfling cleric. She takes her religious duties very seriously. |\n| 7 | Togo Longbottom | This halfling has a regimented life as the captain of the local militia, respected and feared by many. |\n| 8 | Celandine Brookbank | A stern halfling matron known for her unwavering commitment to law and order. |\n| 9 | Holman Clayhanger | A serious-minded herbalist, his remedies are as renowned as his relentless diligence. |\n| 10 | Fosco Overhill | Fosco is a farmer who leads a simple life with almost monastic discipline. |\n| 11 | Esmeralda Hardbottle | A no-nonsense halfling with a reputation for her fair judgments as local magistrate. |\n| 12 | Bingo Baggins | Considered a recluse, Bingo spends most of his time researching arcane artifacts with obsession-like focus. |\n| 13 | Belladonna Bracegirdle | A halfling woman who runs a mercantile business with a disciplined hand and hawk-like vigilance. |\n| 14 | Isumbras Took | A serious and stern halfling warrior with a formidable reputation in battle. |\n| 15 | Drogo Fairbairn | A quiet halfling, Drogo has worked his way up the ranks of the local thieves’ guild without ever causing a stir. |\n| 16 | Camellia Sackville | Known as a solemn healer, her poise commands respect and inspires confidence. |\n| 17 | Fredegar \"Fatty\" Bolger | A hefty halfling whose serious and meticulous nature makes him an incredible chef. |\n| 18 | Adalgrim Goodbody | This halfling is the stern, dedicated brewmaster whose ale is the acclaimed best in the region. |\n| 19 | Lalia Bracegirdle | Rumored to be a spymaster, Lalia is as mysterious as she is serious. |\n| 20 | Gorbadoc Haywood | A stern halfling, known as a master archer with a keen eye and even keener mind. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name  | Description |\n|-------------|-------|-----------------------------------|\n| 1  | Zargrim the Stern | A fierce general with metal-gray eyes, known for his strategic brilliance in warfare. |\n| 2  | Rukhash the Silent | A stoic scout, with a collection of scars and a knack for staying unseen. |\n| 3  | Maglubiyet's Hand| A hobgoblin so devoted to their chief deity they forwent a personal name. Distinguished by the religious tattoos covering their body. |\n| 4  | Yagrush the Iron Willed | A battle-wizened sergeant who never backs down, notable for his unwavering determination. |\n| 5  | Brogash the Painbringer | A bloodthirsty warrior, feared for his savage prowess in battle. |\n| 6  | Skarlag the Unbowed | A warrior who refuses to surrender, known for enduring tremendous pain in battle. |\n| 7  | Khardush the Patient | A guard with unwavering vigilance, respected for his patience and resolve. |\n| 8  | Tharkul the Strong | A powerful chieftain, marked by his muscular build and commanding presence. |\n| 9  | Urgoth the Cunning | A trapper known for his elaborate and deadly snares, and his sly smirk. |\n| 10 | Bruglir the Fearless | A renowned hobgoblin champion unafraid of death, admired and feared by many. |\n| 11 | Fargrim the Steadfast | A disciplined knight with a reputation for his strong strategic mindset. |\n| 12 | Khurzuk the Relentless | A persistent hunter who never lets his prey escape, terrifyingly relentless. |\n| 13 | Dargu the Devout | An unwavering cleric, regarded for his fervent devotion to the hobgoblin deities. |\n| 14 | Mughrabi the Iron Fist | A stern enforcer known for his harsh punishments and absolute control. |\n| 15 | Drarga the Cold | A ranger known for her icy demeanor and efficient dispatching of enemies. |\n| 16 | Gazhur the Wary | A suspicious overseer whose piercing gaze misses nothing. |\n| 17 | Kurmak the Silent | An executioner whose ominous quiet has cowed many prisoners. |\n| 18 | Nashga the Impassive | A seasoned soldier known for her stoic presence on the battlefield. |\n| 19 | Zarghul the Bloodied | A survivor of many battles, his scars speaking of countless close encounters with death. |\n| 20 | Kharzak the Unbroken | A revered hero who has faced many challenges, yet stands resolute and undeterred. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Sir Erik Blackburn | Veteran knight known for strategic prowess and stoic demeanor. Keeps his silver hair trimmed short, scars visible on his face. |\n| 2 | Mother Rowena Harte | The elderly and respected high-priestess of a major temple. Has a kind yet austere face, her eyes sharp and deep. |\n| 3 | Jester Baelin Lockfire | Spy under the guise of a court jester. His jokes often hold a hidden edge. Always twirling a fire-bright scarf. |\n| 4 | Lord Ulric Thornfield | A powerful and ambitious nobleman, always carefully dressed and newly shaven. Renowned as a ruthless ruler. |\n| 5 | Dame Alys Fairwind | Young, vivacious knight, praised for her unrivalled archery skill. Sports a long braid of blonde hair. |\n| 6 | Grandmagister Eadric Spellweaver | An elderly and wise wizard, his silver beard reaches his waist. Known for his magical prowess in illusion. |\n| 7 | Elara Moonsinger | A scholar of ancient lore, her glasses rest on a nose long-weathered by dust and old parchment. |\n| 8 | Marcus Ironfist | Captain of the city guard - relentless, steadfast, and no-nonsense. Scar runs down one eye, a badge of honor. |\n| 9 | Lady Seraphina Brighteye | Noblewoman known for her tremendous charity work. Peach blonde hair, often with a diadem of pearls. |\n| 10 | Durin Stonefoot | Blacksmith who serves under the royal court, feared for his strength in arm-wrestling. Always smudged with soot. |\n| 11 | Maestro Bardic Strummings | Renowned bard who prefers the company of the common folk. Always a lute at his side. |\n| 12 | Helga Stewpot | Matriarch of the largest inn within the city. Her meat stew is famous as it is hearty. |\n| 13 | Master Roderick Quickhand | Famous thief master. Keen green eyes that miss nothing, with nimble, ever-moving fingers. |\n| 14 | Brother Thibault, The Silent | Monk sworn to silence, communicates through writings. Known for his calm and peaceful aura. |\n| 15 | General Amara Ironshield | Gender-neutral leader of a mercenary legion, known for tactical genius and unyielding determination. |\n| 16 | Oracle Delphi Tremorvoice | Blinded by her own prophetic abilities, her voice shakes the hearts of the bravest men. |\n| 17 | Inspector Alastair Crane | City detective known for solving the most confounding mysteries. Always alert and watching. |\n| 18 | Dr. Mordecai Flaskbearer | Eccentric but highly sought-after alchemist, his potions and remedies a thing of legend. Always smells faintly of lavender. |\n| 19 | Captain Harald 'Grizzly' Bearhide | Renowned sailor and explorer, his tales as large as his burly, barrel-chested stature. |\n| 20 | Executor Morwen Nightshade | Executioner hidden behind a hood, only her silver eyes visible. Her silence carries a chill in the air. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Krikit | A thin, wiry Kobold with a quiet demeanor and sharply focused eyes. Walks with a slight limp due to a past injury. |\n| 2 | Gnash | scarred and muscular. Dominant in nature, has a particular affinity for setting traps and ambushes. |\n| 3 | Tiktak | A Kobold with a knack for mechanical contraptions and devices. Wears thick goggles that magnify his bright eyes. |\n| 4 | Skrazz | A shy, solitary Kobold who is dedicated to scholarly pursuits and alchemical endeavors. |\n| 5 | Klik-klak | A dexterous and nimble Kobold, often sent to scout ahead due to his excellent stealth skills and quick reflexes. |\n| 6 | Grizzt | A Kobold who has distinguished himself as a hunter and tracker. His body is honed from the unforgiving wilderness conditions. |\n| 7 | Fiznik | Stooped, cunning, and fond of magic tricks and illusions. Despises direct confrontation but excels in deception. |\n| 8 | Snaggle | A battle-hardened veteran. Carries numerous scars from past battles and wears a patch over one eye. |\n| 9 | Krazik | Has proficiency in weaponsmithing and is responsible for maintaining the tribe's weapon stocks. Muscular arms testify his long hours at the forge. |\n| 10 | Grezzik | A quiet observer in the shadows. His quietness is disconcerting, often leaving others to wonder what he is planning. |\n| 11 | Slink | A nimble thief by nature. Exceptionally good at slithering out of difficult situations with quick thinking and nimble fingers. |\n| 12 | Xikxik | Does not talk much, also has a stout body. Shows great interest in honing his skills as a warrior. |\n| 13 | Zrizzt | The elder Kobold, who carries a staff decorated with tribal symbols, possesses rich wisdom and knowledge about the tribe's history and traditions. |\n| 14 | Krezzik | Lowest in the social pecking order, often bullied by others. However, she is known for her determination and resilience. |\n| 15 | Tiktok | A thin Kobold with interest in magic, often seen clutching a sparkling orb and murmuring incantations quietly in a corner. |\n| 16 | Zixzix | Appear stoic and stone-faced, but is highly perceptive and has an uncanny ability to detect threats before they materialize. |\n| 17 | Krazzt | Shows interest in the culinary arts, known for preparing most of the tribe's meals, has plump cheeks and a jolly demeanour. |\n| 18 | Krakle | The tribe's storyteller, who carries scrolls and books in his bag. Enjoys sharing tales of valor and lore by the firelight. |\n| 19 | Fizzit | The tribe's healer, responsible for tending to the sick. Despite his profession, he carries a solemn, haunted gaze. |\n| 20 | Ziktik | A guard of the tribe's treasure trove. Possesses a muscular body and a no-nonsense attitude. Often found dozing off during his shift. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n|  Dice Value | Name | Description |\n|---|---|---|\n| 1 | Zokath | A stern lizardfolk warrior with weathered green scales, missing an eye, carries a spear inset with jagged obsidian shards. |\n| 2 | Ssargh | A tall, silent figure in ragged robes, dark scales far more scarred and pitted than is usual for your kind. Hands constantly at work cleaning and repairing a precious set of bone throwing knives. |\n| 3 | Ashz | An older lizardfolk with a forked tongue that constantly tastes the air. Ash gray scales that betray his age, serves his tribe as a strategist. |\n| 4 | Lissk | A green-scaled, strong lizardfolk with piercing yellow eyes, known for his fierce loyalty to the tribe and his mastery with a bone blowgun. |\n| 5 | Xsi | A cold-blooded lizardfolk seer, wrapped in colorful tribal garments. Known for her uncanny ability to commune with spirits and decipher the future from the stars. |\n| 6 | Nashra | A decorated lizardfolk huntress with striking blue scales. Armed with a jagged-edged bone sword and a shield crafted from the shell of a giant tortoise. |\n| 7 | Qharr | A hulking figure clad in tanned hide armor, bares a jagged scar running from his lower jaw down to his scaly chest, serves as an enforcer for his tribe. |\n| 8 | Iksar | A lean figure with fiery red scales, serves his tribe as a scout and tracker. Famous for his swift and silent movement through the underbrush. |\n| 9 | Zathriss | A blue-scaled lizardfolk of a more intellectual nature, serves his tribe as an alchemist, known for concocting bizarre potions. |\n| 10 | T'sik | A lizardfolk with copper scales and a cackling laugh, skilled in construction and credited with designing most of the tribe's defenses. |\n| 11 | Ressa | A lizardfolk with dark green scales and intense, darting eyes, quite knowledgeable about the local flora and known for her herbal medicines. |\n| 12 | H'ssa | A silver-scaled lizardfolk blacksmith, her expertly crafted weapons and tools are much sought after within the tribe. |\n| 13 | Opochtl | A lizardfolk elder with dull gray scales, known for his wisdom and calm even when confronted with the direst of threats. |\n| 14 |  Xil'neth | A strange sight in his tribe with his rare albino white skin, and has surprising gift for magical scrolls and runes. |\n| 15 | Uklat | A burly lizardfolk with deep brown scales, known for his skill as a fisherman and his peculiar underwater breathing technique. |\n| 16 | I'rri | A slender lizardfolk with turquoise hues in her scales, known for her skills in gathering resources and bartering supplies. |\n| 17 | Tuskik | A lizardfolk observer with an eye for detail and a gift for predicting opponent’s movements. His scales are a light shade of green with yellow underbelly. |\n| 18 | Skithus | A veteran warrior with his brave nature and skill with a poison-tipped javelin, his scales sport many scars from past battles. |\n| 19 | Putak | A lizardfolk with bright orange scales, with a keen sense for danger and specialize in laying deadly traps for potential enemies. |\n| 20 | Ki’sha | A spiritual leader of her tribe, with vibrant purple scales, known for her ancient chants that inspire and unite her brethren. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Thog | An imposing orc chieftain with several scars decorating his dark green skin |\n| 2 | Krug | A brooding, muscular orc with piercing red eyes |\n| 3 | Vrogash | A sinewy male orc with a frighteningly large tuselage |\n| 4 | Gruumsh | A female orc priestess who wields a holy symbol of the orc god |\n| 5 | Maglubiyet | An aging orc with a hunched back, but the wisdom of many battles in his eyes |\n| 6 | Ugarth | Young prodigy of an Orc warlock, surprisingly well-spoken for his race |\n| 7 | Zugbu | An orc blacksmith with impressive musculature and a fiery temper |\n| 8 | Kreeshna | A sly orc female specializing in stealth and thievery, known for her quick hands |\n| 9 | Turog | An orc boar rider with a grizzled beard, known for his exceptional tracking skills |\n| 10 | Durog | A veteran orc berserker, known for his controlled fury and battle prowess |\n| 11 | Grosh | Orc brewmaster, has won accolades for his potent orcish ale |\n| 12 | Sarg | An orc brawler, has a reputation around the taverns for his bare-knuckle fighting prowess |\n| 13 | Unebrion | Orc bard, a rarity amongst his race but proves their capability in arts |\n| 14 | Gruum | An orc hunter known for his falconry skills |\n| 15 | Kru'tar | A tusked orc leader who is feared and respected by his tribe |\n| 16 | Vorgak | An orc herbalist, known for his skills in potion making |\n| 17 | Thurg | The tribe's cook, a rotund orc who can always be found near a roaring fire |\n| 18 | Drugar | The elder of the tribe, the source of its lore and tradition |\n| 19 | Zogar | A mute orc with an intimidating aura, his actions speak louder than his words |\n| 20 | Bûth | An orc ranger known for his stealth and close ties with wolves |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Malphas | A stern Tiefling warrior. His crimson skin is adorned with intricate black tattoos depicting battles of the past. |\n| 2 | Euryale | A studious Tiefling enchantress. Her horns have curious etchings signifying her deep understanding of arcane lore.|\n| 3 | Mordai | A secretive Tiefling rogue. His eyes, devoid of pupils, gleam in the dark, haunting the nightmares of his targets.|\n| 4 | Akmenos | A brooding Tiefling cleric. She wears sacred symbols on a sash across her chest, her devotion evident in her stern gaze. |\n| 5 | Kairon | A reserved Tiefling bard. His lyre is as silver as his hair and his haunting melodies elicit deep emotions. |\n| 6 | Naris | A stoic Tiefling paladin. His tail has been wrapped in holy scripture, with each verse representing an oath upheld. |\n| 7 | Ophelia | A cunning Tiefling rogue. Her horns are adorned with gems and precious stones, trophies from successful heists. |\n| 8 | Barakas | An elusive Tiefling ranger. His eyes reflect the wilderness, concealing a lifetime of survival and adaptation. |\n| 9 | Therai | A diligent Tiefling artificer. Her steely gaze betrays a focused mind, constantly conspiring to create and innovate. |\n| 10 | Samael | A reclusive Tiefling warlock. His voice echoes with a strange resonance, as though speaking with the authority of his patron. |\n| 11 | Akta | A disciplined Tiefling monk. Her silent presence and focused energy make a stronger statement than any words ever could. |\n| 12 | Morthos | An austere Tiefling sorcerer. His imposing horns generate an aura of mystical energy, amplifying his arcane authority. |\n| 13 | Shax | An intimidating Tiefling fighter. His muscular frame strikes fear into his opponents, making them question their resolve. |\n| 14 | Kallista | A pragmatic Tiefling druid. She carries an aura of the wild, a silent testament to her harmony with nature. |\n| 15 | Pelaios | A stoic Tiefling knight. His resolute expression resonates with the scars of many hard-fought battles. |\n| 16 | Raum | A quiet Tiefling necromancer. His presence chills the air, exuding a dreadful aura of death and decay. |\n| 17 | Vasago | A disconcerting Tiefling blood hunter. His crimson eyes gleam menacingly, fueled by the thrill of the hunt. |\n| 18 | Iados | A noble Tiefling bard. His golden lute speaks a language of its own, every note echoing his tales of valor. |\n| 19 | Calim | An unyielding Tiefling barbarian. His horned silhouette on a battlefield is a harbinger of fury and vicious combat. |\n| 20 | Lorelei | A cautious Tiefling scout. Her alert eyes miss no detail, revealing a lifetime spent stalking the dangerous outskirts. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}