{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "5e Rolltables",
  "description": "Prompt generated entities from ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n## d20 Mishaps due to a Critical Failure on a Melee Attack\n\n1. Your weapon gets lodged in a nearby object, taking an action to free it.\n2. You lose your grip on your weapon, causing it to fly 10 feet in a random direction.\n3. You trip over your own feet and fall, becoming prone.\n4. You accidentally strike an ally within 5 feet of you.\n5. You overextend and leave yourself open to an enemy's attack, granting them advantage on their next attack against you.\n6. Your weapon becomes damaged and takes a -1 penalty to damage until repaired.\n7. The overwhelming force of your swing causes you to spin around and become disoriented, granting enemies advantage on attacks against you until the end of your next turn.\n8. You smash a nearby object, alerting any enemies within 30 feet of your location.\n9. Your attack causes you to stumble backwards, moving you 5 feet away from your target.\n10. You injure yourself, taking 1d6 damage.\n11. Your weapon becomes lodged in a nearby enemy's shield, taking an action to free it.\n12. Your reckless attack causes you to hit a nearby object instead of your intended target.\n13. Your attack is so powerful it leaves you off-balance, giving all enemies within 5 feet of you opportunity attacks.\n14. You lose your footing and fall prone.\n15. You accidentally hit your armor or shield, dealing 1d4 damage to yourself.\n16. Your wild attack causes you to strike an ally adjacent to you instead.\n17. Your weapon breaks, becoming useless until repaired.\n18. You are disarmed, your weapon flies 10 feet in a random direction.\n19. Your attack is so powerful it knocks you off your feet, causing you to become prone.\n20. You miss your target and deal damage to yourself, taking 1d6 damage.\r\n## Ranged\r\n**Mishaps due to a Critical Failure on a Ranged Attack**\n\nRoll a d20 to determine the mishap that may occur if a creature rolls a critical failure on a ranged attack.\n\n1. Your weapon jams and requires a full action to clear.\n2. You trip and fall prone.\n3. Your weapon string snaps and requires mending before it can be used again.\n4. You hit an ally instead, causing damage.\n5. Your weapon ricochets off a nearby surface and hits you.\n6. You shoot yourself in the foot.\n7. Your weapon breaks and becomes useless.\n8. You hit a valuable object, causing damage.\n9. Your weapon flies out of your hand and lands a short distance away.\n10. You lose your balance and fall prone.\n11. Your weapon misfires and deals damage to you instead.\n12. You hit a civilian in the distance.\n13. Your weapon explodes in your face, dealing damage.\n14. You accidentally drop a valuable item from your inventory.\n15. Your weapon's bowstring snaps and recoils against you, dealing damage.\n16. You hit the nearest NPC, causing damage.\n17. Your weapon gets stuck in a nearby tree or wall.\n18. You miss your target and hit a flammable object, starting a small fire.\n19. Your weapon is damaged by the misfire and requires a repair before it can be used again.\n20. You hit yourself in a sensitive area, causing significant pain.\r\n## Arcane\r\n## d20 Arcane Attack Mishaps\n\n1. **Backfiring Magic:** The spell you just cast shifts suddenly, and you become the target. Roll d6 for damage.\n2. **Elemental Explosion:** The elemental forces within you destabilize. An explosion of arcane energy deals d8 damage to you and anyone within 5 feet.\n3. **Wild Magic Surge:** Roll on the Wild Magic table (PHB 104) to determine the effect. \n4. **Creature Summon:** A random creature from any table in the Monster Manual appears as if summoned by the mage. The creature is not considered friendly.\n5. **Self-Immolating Spell:** The magic energy ignites, and minor magical pyrotechnics spiral out and around you. You are blinded for 1 minute.\n6. **Nervous Ticks:** You develop a nervous tic that lasts for 1d6 hours. Each time you cast a spell or make an attack roll, roll a d20. On a 1, you automatically miss. The DC for your spells is now 1 higher.\n7. **Veil of Shadows:** A magical darkness spreads from your extremities, and you can no longer see beyond 5 feet.\n8. **Magic Misfire:** You expend the spell slot and components, but no magic effect follows. Target gains an advantage on attacks against you until the end of your next turn.\n9. **Fumble Fingers:** Your spell-casting gestures are off, and the spell fizzles. You cannot cast the same spell again for 1d4 hours.\n10. **Magical Drain:** You feel lethargic and drained of energy. You suffer a -1 penalty to all skill checks and attack rolls until your next long rest.\n11. **Polymorph Predicament:** The spell catches you off guard, and instead of an enemy, you transform yourself into a small, harmless creature. \n12. **Mana Burn:** The spell you cast consumes more magical energy than expected. Roll a d6 and subtract it from your total spell slots available for the day.\n13. **Weapon Misdirection:** The arcane energy causes your weapon to fly out of your hand 30 feet in a random direction.\n14. **Loud Boom:** The spell creates an unnaturally loud boom, alerting everything within 120 feet to your general location.\n15. **Spell Stutter:** The words of the spell twist in your mouth. You cannot speak or cast spells requiring a vocal component. The effect lasts until the end of your next turn.\n16. **Stressful Backlash:** Your spell fails, but the energy still has to go somewhere. You take d6 psychic damage.\n17. **Antimagic Field:** An antimagic field appears around you and lasts for 1 minute. All magical effects within the area are suppressed.\n18. **Temporarily Inept:** You lose the ability to cast spells for the next 1d6 rounds.\n19. **Magic Beacon:** A beacon of charged magical energy appears above you, signaling your location to all nearby enemies.\n20. **Spell Shutdown:** You are unable to cast spells of any level for the next day.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee Attack",
        "Ranged Attack",
        "Melee Attack"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables"
    },
    {
      "rawText": "## Melee\r\n# d100 Melee Attack Mishaps\n\nRoll a d100 to determine the result of a critical failure during a melee attack in a Dungeons and Dragons 5e fantasy game:\n\n1. You trip, fall and land face first into a nearby monster's crotch.\n2. You swing your weapon so wildly, it flies out of your hand and into the distance.\n3. You accidently poke yourself in the eye with the sharp end of your weapon.\n4. Your swing causes a chain reaction with nearby objects, creating a comedic domino effect.\n5. You loudly pass gas, causing the enemy to be momentarily disgusted, but not incapacitated.\n6. Your weapon becomes stuck in the ground, leaving you weaponless for the remainder of the combat.\n7. You accidentally hit your own foot, dealing significant damage.\n8. Your character screams uncontrollably for the next minute, alerting any nearby enemies to your presence.\n9. You slip and fall, ending up prone and vulnerable to enemy attacks for one turn.\n10. Your weapon shatters into a million pieces, leaving you without a weapon.\n11. You accidentally hit a nearby ally, dealing damage to them instead of the enemy.\n12. You perform a combat maneuver that causes your pants to fall down, leaving you embarrassed and vulnerable.\n13. Your weapon ricochets off the enemy and hits you in the face, dealing damage to yourself.\n14. You accidentally trigger a trap that was hidden in the vicinity.\n15. You become overwhelmed with an intense case of hiccups, making it difficult to accurately attack.\n16. Your weapon gets caught in an enemy's clothing, making it difficult for them to move, but leaving you unable to attack.\n17. You fall to the ground and begin crying, making it difficult to attack for the next 2 rounds.\n18. You accidentally call out the wrong name when performing a combat maneuver, causing an adjacent NPC to become hostile towards you.\n19. Your own strength causes you to spin like a top, ending up in a disoriented position.\n20. You suffer a wardrobe malfunction, leaving you with a ripped shirt and no armor class for one turn.\n21. You accidentally expose a hidden escape route to your enemies.\n22. Your weapon becomes lodged in an enemy's piece of armor, rendering it temporarily immobile.\n23. You become distracted by an attractive member of your party, causing your attack to miss.\n24. You accidentally hit a nearby bird or animal, causing it to become hostile and attack you instead.\n25. Your character suddenly has an allergic reaction, making it difficult to see and making you more vulnerable to enemy attacks.\n26. You become tangled in your own capes, leaving you vulnerable to attack for one round.\n27. You hit a nearby rock with your weapon, causing a rockslide and trapping the party.\n28. You attempt to cave in the enemy's skull but end up hitting him in the groin instead.\n29. You trip over your own shoelaces, ending up in a vulnerable position.\n30. You accidentally fart loudly, causing your enemies to be momentarily stunned.\n31. Your weapon ricochets off an enemy and hits a nearby piece of architecture, causing it to crumble.\n32. You accidentally swallow a nearby insect, causing you to be distracted and vulnerable for one turn.\n33. You become entranced by your own reflection, leaving you open to attack.\n34. Your weapon gets caught in nearby bushes, leaving you weaponless for one round.\n35. You swing your weapon so hard, you end up slipping and falling, ending up prone.\n36. You accidentally hit a fire, causing it to spread around the combat zone.\n37. You perform a combat maneuver that causes your pants to split, leaving you with no armor class for one turn.\n38. Your weapon moves too quickly, causing you to become dizzy and disoriented.\n39. You hit the enemy so hard, their weapon becomes lodged into an nearby obstacle.\n40. You accidentally grab the wrong weapon from your inventory, leaving you with an ineffective attack.\n41. You become afraid of your own weapon, rendering you unable to attack with it for one round.\n42. You become so tired from the effort put into your swing, that you fall asleep for one round.\n43. Your weapon ricochets off a wall and hits a nearby object, rendering it useless.\n44. You become overwhelmed with the desire to dance, leaving you vulnerable to attack for one turn.\n45. You accidentally hit a nearby insect, causing a swarm of insects to attack you instead.\n46. You become nauseous mid-attack, leaving you stumbling and vulnerable.\n47. Your weapon gets caught on a nearby obstruction, leaving you weaponless for one turn.\n48. You slip and fall, causing you to drop your weapon and fall prone.\n49. You accidentally insult a nearby NPC and must take an extra turn to diffuse the situation.\n50. Your weapon becomes completely destroyed, leaving you without any weapon for the remainder of combat.\n51. You trip on an enemy's armor, leaving you vulnerable and prone for one turn.\n52. You become overwhelmed with laughter, leaving you vulnerable to attack for one round.\n53. You accidentally hit a nearby explosive, causing significant damage to nearby objects and characters.\n54. You become disoriented, making it difficult to accurately attack.\n55. Your weapon bounces off the enemy and hits a nearby ally, dealing damage to them instead.\n56. You become entranced by a nearby object, leaving you open to attack.\n57. Your weapon gets caught in an enemy's piece of clothing, but the enemy is temporarily immobilized.\n58. You become overwhelmed with grief, leaving you vulnerable to attack for one round.\n59. You hit the enemy so hard, they become dizzy and disoriented for one turn.\n60. You hit the enemy so hard, they accidentally hit a nearby ally.\n61. Your weapon becomes stuck in the ground, rendering you temporarily without a weapon.\n62. You accidentally slice nearby objects into dangerous shrapnel.\n63. You slip in a nearby puddle, leaving you vulnerable for one turn.\n64. You accidentally hit a nearby NPC, causing them to become temporarily hostile.\n65. Your weapon hits a nearby object, causing it to become possessed and turn against you for one turn.\n66. You hit a nearby tree, causing a family of birds to become disturbed and attack you instead.\n67. You accidentally ignite a nearby object, causing significant damage to the combat zone.\n68. Your weapon becomes stuck in an enemy's armor, making it difficult for them to move.\n69. You slip and fall, causing you to accidentally hit a nearby ally.\n70. You become distracted by a nearby object, leaving you open to attack.\n71. You hit the enemy so hard, they become stunned for one turn.\n72. Your weapon becomes stuck in a nearby piece of architecture, rendering it useless for the remainder of combat.\n73. You accidentally insult a nearby deity, causing them to become hostile towards you.\n74. You become overwhelmed with sadness, leaving you vulnerable to attack for one turn.\n75. Your weapon gets caught on a nearby tree branch, leaving you weaponless for one turn.\n76. You become overwhelmed with a desire to eat, leaving you vulnerable to attack for one turn.\n77. You accidentally hit a nearby rock formation, causing a rockslide and trapping the group.\n78. Your weapon becomes stuck in a nearby piece of furniture, leaving you weaponless for one turn.\n79. You accidentally hit a nearby illusion, causing it to become real and attack you instead.\n80. You become disoriented, making it difficult to accurately attack for one turn.\n81. You accidentally hit a nearby food cart, causing food to spill everywhere and encouraging nearby animals to become hostile.\n82. Your weapon hits a nearby object, causing shrapnel to hit randomly causing potentially harmful wounds.\n83. You trip over an uneven surface, ending up prone and vulnerable to enemy attacks.\n84. You accidentally hit a previously unnoticed enemy, causing another unnecessary enemy to join the fight.\n85. Your weapon becomes stuck in thick mud, leaving you weaponless for one turn.\n86. You become distracted by nearby scenery, leaving you open to attack.\n87. You become disoriented, making it difficult to determine who the enemy is.\n88. You accidentally hit a mirror, causing shards of glass to become potential weapons for the enemy.\n89. Your weapon hits a nearby object, causing a chain reaction that causes a nearby tree to become a behemoth.\n90. You hit an enemy over the head so hard, they become stupid and disoriented for one turn.\n91. You accidentally hit a potted plant, causing it to seek vengeance and attack you instead.\n92. Your weapon becomes stuck in a nearby tree, leaving you weaponless for one turn.\n93. You become disoriented, making it difficult to determine which way to attack.\n94. You accidentally hit a previously hidden object, causing it to become animated and turning against you.\n95. You hit the enemy over the head so hard, they forget why they were even fighting you in the first place.\n96. Your weapon gets stuck in a nearby wall, rendering it useless for the remainder of the fight.\n97. You accidentally hit a previous ally, causing them to become temporarily hostile.\n98. You become distracted by the sunset, leaving you open to attack.\n99. Your weapon hits a nearby object, causing it to become a lethal projectile.\n100. You accidentally trigger a nearby explosive, causing severe damage to the combat zone.\r\n## Ranged\r\n# Misadventures due to a terrible Aim\n\nRoll a d100 for your ranged attack failure mishap!\n\n1. Your arrow veers off course, embedding itself in the nearest tree. It's now stuck there until you retrieve it.\n2. You accidentally launch your bow into the air instead of your arrow.\n3. You stumble and slip, accidentally firing your arrow at your ally's feet.\n4. A bird flys by and snatches your arrow right out of the air.\n5. Your quiver falls off your back, spilling arrows all over the ground.\n6. You miss your target so badly, your arrow ends up sticking out of a nearby corpse.\n7. Your bowstring snaps on the shot, leaving your bow useless until repaired.\n8. Your sudden miss startled you and you begin sweating frantically.\n9. Your arrow bounces off of an invisible magical barrier in the air.\n10. The wind picks up and carries your arrow off course into the unknown.\n11. The tension from firing the bowstring snaps your shoulder out of place.\n12. Your shot is so terrible, you accidentally hit yourself in the foot.\n13. The bowstring slaps against your arm, leaving a painful welt.\n14. You're distracted mid-shot by a nearby clown.\n15. Your nervousness causes you to wet your pants mid-shot.\n16. A sudden gust of wind turns your arrow trajectory up into the air.\n17. You trip and stumble forward, firing an arrow at random.\n18. Your magic-user ally becomes convinced your arrow is cursed because of your terrible aim.\n19. You accidentally hit your own horse instead of the enemy.\n20. You accidentally misfire into a nearby crowd, causing panic.\n21. Your quiver falls apart, sending arrows flying everywhere.\n22. You become so focused on the wrong target that you hit an ally instead of an enemy.\n23. You accidentally fire an arrow into the ground, preventing your party from crossing.\n24. A sudden swarm of butterflies blinds you at the last second.\n25. You hit someone else's target, causing your party to be blamed for the missed shot.\n26. Your shot misses by a hair, leaving a bald spot on an enemy's head instead.\n27. You hit a nearby tree, dropping coconuts all over your party.\n28. The enemy you hit, jumps aside and lets your arrow fly past unharmed.\n29. Your shot went so far off course, it bounced back and hit your party member taking cover behind you.\n30. Your grip loosens and you accidentally launch your arrow backwards.\n31. You accidentally put too much pressure on your arrow, it boomerangs back into your face.\n32. Your arrow bounces off the ground and straight into your behind.\n33. You thought you had the enemy in your sights, but realized the enemies were just old statues.\n34. Your arrow gets stuck in a nearby barrel, attracting an angry swarm of bees.\n35. Your arrow misses so badly, it hits a fish mid-jump over a waterfall.\n36. You forget to aim and fire straight up in the air.\n37. The arrow is so light, a stiff breeze knocks it off course.\n38. It turns out that the enemy you were aiming at wasn't actually an enemy, but a farmer in a bad costume.\n39. You hit your ally so hard with your arrow, they come out of alignment.\n40. You accidentally shoot into a nearby flock of birds, prompting angry retaliation.\n41. Your arrow misses by a wide margin, embedding itself in a nearby rock.\n42. Your shot ricochets off the enemy's armor, almost hitting your ally.\n43. You hit the enemy right in the eye, causing them to stumble around in a painful daze.\n44. You trip over a rock at the last second, hitting the target far behind the intended target.\n45. Your shaky hand causes your bowstring to slip and your arrow flies off course.\n46. You hit the enemy's weapon, disarming them instead of causing damage.\n47. You accidentally shoot off your own hat, revealing your rapidly thinning hairline.\n48. Your arrow hits a rotten tree, spraying putrid sap all over the party.\n49. Your shot seemed to be on target until your arrow inexplicably turned in mid-flight.\n50. You hit the enemy's cape instead of the enemy.\n51. Your marksmanship is so bad, you actually shot an ally in the back.\n52. You trip on your own untied shoelaces at the exact wrong moment.\n53. Your arrow barely misses, causing the party's horses to panic and bolt.\n54. The enemy dodges your shot so completely, they begin to laugh.\n55. Your arrow hits a nearby bumblebee, causing it to sting you in retaliation.\n56. You lose your footing and slide across the ground, firing off your arrow uncontrollably.\n57. Your arrow gets distracted and flies directly into the sun.\n58. You miss so badly, you end up hitting your own shadow.\n59. Your arrow somehow gets twisted into a knot and is rendered useless.\n60. You hit the enemy in a non-critical area, causing barely any damage.\n61. Your shot is so far off course, it embeds itself into your ally's shield instead.\n62. Your bowstring causes a blinding flash of light in the middle of your shot.\n63. You're so nervous, you accidentally shoot an arrow through your tunic.\n64. Your arrow hits the enemy's horse instead of the enemy.\n65. You finally hit your intended target, but the enemy seems more surprised than hurt.\n66. The enemy raises their shield and deflects your arrow with ease.\n67. Your arrow completely misses, hitting a nearby rock and causing it to crack.\n68. Your shot is so bad, it hits a nearby tree and birds begin to fly angrily out of it.\n69. Your arrow hits the enemy's pants instead of their leg.\n70. You accidentally shoot into a nearby puddle, causing mud to fly everywhere.\n71. Your shot is so far off course, it hits an old gravestone instead.\n72. You're so nervous, you accidentally stick yourself with your own arrow.\n73. You accidentally swap the arrowheads on two of your arrows, now both are useless.\n74. You hit the enemy so hard, their wig falls off.\n75. The enemy moves at the last second and ends up sending your arrow on a wild goose chase.\n76. Your shot shatters a nearby glass vase, enraging the store owner.\n77. Your arrow hits the enemy's shield and bounces back toward you.\n78. Your arrow bounces off a passing bird, causing it to squawk indignantly.\n79. Your nervous fumbling causes you to completely miss, embedding the arrow into a nearby shop sign.\n80. Your aim is so far off, you hit a nearby cow and agitate it.\n81. The vibrations from firing your bow cause nearby birds to panic and scatter.\n82. You swear you aimed in the right direction, but you missed by a mile and ended up hitting a nearby statue.\n83. Your shot was so bad, nearby rabbits laugh at you in derision.\n84. You accidentally shoot your arrow backwards, striking a nearby tree.\n85. Your arrow hits a nearby barrel, causing its contents to spill everywhere.\n86. You hit the enemy in the gut, causing them to wheeze painfully.\n87. You're so nervous, you accidentally fire your last remaining arrow into a nearby bush.\n88. Your arrow misses its target by millimeters and thunks harmlessly into the ground.\n89. Your foe dodges your shot with such complete ease, they don't even break stride.\n90. Your shot is so way off course, you end up hitting an animal carcass instead.\n91. You accidentally hit your ally's horse instead of the enemy.\n92. Your arrow misses completely, arcing into the sky and disappearing from view.\n93. You hit a wooden fence, causing it to splinter and shatter.\n94. Your shot is so wild, it hits a rock and causes a nearby rockslide.\n95. Your arrow misses the target entirely, embedding itself into the barn door behind it.\n96. Your arrow bounces off the enemy's armor with a loud clang.\n97. You hit a nearby bell instead of the enemy, causing a loud ringing noise.\n98. You stumble forward as you fire your arrow, sending it flying in an unintended direction.\n99. Your arrow whizzes by the enemy's ear, causing them to flinch.\n100. You're so nervous, you accidentally shoot straight up in the air and lose your final arrow forever.\r\n## Arcane\r\n# d100 Arcane Attack Mishaps\n\nRoll a d100 to determine the mishap that occurs due to a critical failure on an arcane attack!\n\n1. Your spell fizzles out and turns into harmless confetti that covers the surrounding area.\n2. Your familiar is suddenly imbued with the spell and begins to act erratically.\n3. Your spell backfires, causing you to swap bodies with the target for 1 minute.\n4. Your magical energy is misdirected, creating a magical disco ball that fills the area with dance music for 1 minute.\n5. Suddenly, a small chicken appears and begins to follow you around, clucking loudly.\n6. Your spell creates a portal to a random plane of existence, causing creatures from the new plane to pour out.\n7. Your spell creates a small thunderstorm that follows you around for 1 minute, shocking everyone within 5 feet of you with static electricity.\n8. Your spell activates an ancient curse, causing you to hiccup uncontrollably for 1 hour.\n9. Your spell summons a swarm of rats, insects, or other unpleasant creatures to attack you.\n10. Your spell creates a blinding flash of light, temporarily blinding yourself and everyone within 30 feet of you.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee Attack",
        "Ranged Attack",
        "Melee Attack",
        "Whimsical"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Whimsical"
    },
    {
      "rawText": "## Elves\r\n|Dice Value|Name|Description|\n|---|---|---|\n|1|Galadriel|This elf exudes a regal aura. Her pointed ears are set high on an angular face and her silver hair cascades down her back. Her eyes are a piercing green that seem to see through all pretense.|\n|2|Celeborn|Tall and statuesque, this elf has a noble bearing. His long white hair falls in ceaseless waves to his waist, framing a face of timeless grace. His voice conveys the wisdom of one who has seen millennia come and go.|\n|3|Thranduil|This elf is haughty and aloof, looking down his nose at lesser beings. His golden hair is braided and adorned with silver clasps, and his clothing is finely tailored. His expression is cold and disinterested.|\n|4|Althaea|A shy and curious elf, Althaea has a sprightly demeanor that belies her age. Her fair skin and green eyes shimmer with mirth, and she is quick to make friends.|\n|5|Eleri|A songbird voice and sharp wit characterize this elf. Eleri's almond-shaped eyes are a deep brown that sparkle with mischief. Her brown hair hangs in waves around her shoulders, and she wears a bright smile like a piece of jewelry.|\n|6|Nimrodel|This elf blends into the background, unassuming and quiet. Her hair is the palest blond and falls straight to her waist, while her eyes are a pale blue. She has a keen mind and a calculating air about her.|\n|7|Elvandar|Serene and gentle, this elf radiates inner peace. His hair is a deep black and is pulled back into a low ponytail. His face is unlined, and his eyes are a bright blue. He is slow to anger and quick to forgive.|\n|8|Arcadia|An elf of indeterminate gender and otherworldly charm, Arcadia is able to mesmerize with a single glance. Their features are delicate and fey, and their movements are graceful and fluid. They speak with a lilting voice, and their laughter is like music.|\n|9|Tathariel|A hunter among the elves, Tathariel is lithe and agile. Her auburn hair is pulled back in a tight braid and her green eyes scan her surroundings constantly. Her movements are precise and fluid, and she speaks almost exclusively in whispers.|\n|10|Glorfindel|This elf looks every bit the warrior of legend, with rippling muscles and a piercing gaze. His golden hair is braided and adorned with beads, and his body is covered in scars. He speaks forcefully and with conviction.|\n|11|Elenwë|A healer among the elves, Elenwë exudes warmth and compassion. Her hair is a bright red that seems to glow in the sunlight, and her eyes are a warm brown. She moves with a gentle grace and speaks with a soft, soothing voice.|\n|12|Círdan|An ancient elf, Círdan has seen the rise and fall of many civilizations. His beard is long and white, and his eyes are a deep brown. He is slow to anger and patient, speaking with a measured lilt.|\n|13|Aerin|A ranger among the elves, Aerin is clad in leather armor and carries a bow almost as tall as she is. Her movements are fluid and silent, and her senses are sharp. She speaks in a low voice and rarely smiles.|\n|14|Arwen|This elf has a gentle and kind presence, with a smile that could light up the darkness. Her hair is black as pitch and her eyes a deep blue. She moves with a fluid grace and speaks in a lilting voice.|\n|15|Elrond|A wise and learned elf, Elrond is a master of lore and magic. His hair is a silky black and falls to his waist, and his eyes are a deep brown. His voice is melodious and authoritative.|\n|16|Legolas|A lively and energetic elf, Legolas is rarely still. His light hair is worn loose and falls in unruly waves, framing a face that is almost boyish. His eyes are a bright blue, and he speaks with a lively, excited energy.|\n|17|Lúthien|An ethereal and otherworldly elf, Lúthien seems almost fragile. Her hair is a silvery-white that appears to shimmer and has delicate elven script woven into it. Her eyes are a pale lavender, and she moves with a haunting grace.|\n|18|Melian|This elf has a motherly air about her, with eyes that seem to see all and a voice that soothes all ills. Her hair is a warm brown and is woven with flowers, and her robes are simple and elegant. She speaks with a gentle cadence.|\n|19|Idril|An elf of surpassing beauty, Idril's hair is a brilliant golden color and falls in waves down her back. Her eyes are a serene blue, and her skin seems to glow. Her movements are graceful and fluid, and her voice has a musical quality.|\n|20|Amanar|A brooding elf with a dark past, Amanar's features are chiseled and sharp. His hair is a deep blue-black and falls in sharp angles. His eyes are a smoky gray, and his voice is deep and rumbling. He is quick to anger and slow to forgive.|\r\n## Dwarves\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Bofur Stonebrew | A gruff, middle-aged dwarf with a bushy brown beard and piercing green eyes, always seen wielding a heavy battleaxe. |\n| 2 | Hilda Ironheart | A jovial, red-haired lady dwarf, known for her delicious ale and her exceptional storytelling skills. |\n| 3 | Drogan Thunderfist | A stocky, muscular dwarf with a shaved head and a braided beard, who wears a suit of shiny plate armor. He has a reputation for being a fierce warrior and a loyal friend. |\n| 4 | Grimgar Hammerfist | An elderly and wise dwarf with a long, white beard, who serves as a respected advisor to his clan's leaders. |\n| 5 | Krag Stonebreaker | A boisterous, adventurous dwarf with a love for treasure and a knack for getting into trouble. He carries a trusty pickaxe and a bag of explosives wherever he goes. |\n| 6 | Fjorna Oakenshield | A young and ambitious dwarf, who dreams of becoming the greatest blacksmith in the land. She is always tinkering with new designs and techniques for forging unmatched weapons and armor. |\n| 7 | Grimbold Steelbeard | An intimidating and imposing dwarf, with a deep voice and an even deeper grudge against orcs and goblins. He has many scars on his face and arms, and his beard is adorned with many iron rings. |\n| 8 | Durnan Stoneborn | A quiet and reserved dwarf, who spends most of his time studying ancient texts and researching forgotten spells. He wears a hooded robe and carries a wand made of crystal. |\n| 9 | Osk Stonefist | A friendly and gregarious dwarf, who owns a bustling tavern and inn in the heart of the dwarven city. He loves to hear tales from travelers and adventurers, and often hires them to do odd jobs around the establishment. |\n| 10 | Kilnir Ironforge | A skilled and meticulous dwarf artisan, who specializes in crafting intricate clockwork constructs and automatons. He has a perfectionist streak and is known to be very particular about his work. |\n| 11 | Bruenor Battlehammer | A grizzled and battle-hardened dwarf, with a long scar running down his face and a missing eye. He is the leader of a powerful dwarven clan, and is feared and respected for his cunning tactics and his unyielding will. |\n| 12 | Gristle Ironbreak | A rugged and independent dwarf, who prefers to work alone in the wilderness. He is an expert scout and tracker, and is often hired to guide travelers through treacherous mountain paths. |\n| 13 | Barin Stonebeard | A scholarly and thoughtful dwarf, who spends most of his time in his private library. He is a master of ancient languages and lore, and is often consulted by other scholars seeking his wisdom. |\n| 14 | Thorin Oakenshield | A regal and charismatic dwarf, with a thick beard and a crown of gold. He is a legendary warrior and leader, and his name is known and feared throughout the land. |\n| 15 | Varric Blackwall | A mysterious and elusive dwarf, who associates mostly with rogues and mercenaries. He is known to be skilled in both combat and diplomacy, and is often called upon for his expertise in smuggling and deception. |\n| 16 | Drakka Ironhand | A gruff and no-nonsense dwarf, who runs a successful blacksmithing business in the dwarven city. He is known for his simple and sturdy designs, and for his skill in repairing even the most battered of weapons and armor. |\n| 17 | Balin Stonehelm | A jovial and friendly dwarf, who enjoys singing and playing his lute in the local tavern. He is also a skilled healer, and often offers his services to those in need. |\n| 18 | Urg Ironback | A proud and stubborn dwarf, who is known for his fiery temper and his unyielding loyalty to his clan. He carries a massive warhammer and wears a suit of dwarven-forged plate armor. |\n| 19 | Thrain Rockseeker | An adventurous and curious dwarf, who is always in search of legendary treasures and artifacts. He carries a map of the ancient dwarven ruins, and is often accompanied by a team of experienced adventurers. |\n| 20 | Gundren Fireheart | A charismatic and charming dwarf, who is well-liked by all who meet him. He is a successful merchant and entrepreneur, and is always looking for new business opportunities. He wears a bright red cloak and carries a small, ornate pistol. |\r\n## Tieflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Akmenos | This tiefling has piercing green eyes and long, curly black hair. He wears a set of fine leather armor and carries a crossbow at his side. |\n| 2          | Bray | This tiefling has ruby red skin and short black horns. He wears a simple tunic and trousers, and carries a longsword strapped to his back. |\n| 3          | Calaith | This tiefling has jet black skin and glowing yellow eyes. She wears a flowing black robe and carries a wand of arcane power. |\n| 4          | Delthar | This tiefling has bright blue skin and a row of small, sharp horns. He wears a suit of black plate armor and carries a shield. |\n| 5          | Eryndor | This tiefling has ashen grey skin and piercing violet eyes. He wears a long, flowing robe of crimson and carries a staff adorned with a glowing purple crystal. |\n| 6          | Faust | This tiefling has deep crimson skin and blood red eyes. He wears a black leather coat and carries a pair of pistols. |\n| 7          | Gideon | This tiefling has sandy brown skin and long, pointed ears. He wears a tattered cloak and carries a curved dagger at his hip. |\n| 8          | Harkon | This tiefling has metallic silver skin and short, sharp horns. He wears a suit of gleaming chainmail and carries a mace. |\n| 9          | Isadora | This tiefling has dusky purple skin and long, flowing hair. She wears a form-fitting black dress and carries a silver mirror. |\n| 10         | Jarek | This tiefling has auburn skin and striking amber eyes. He wears a suit of studded leather armor and carries a shortbow. |\n| 11         | Kael | This tiefling has iridescent scales and a long, serpentine tail. He wears an intricately woven robe and carries a wand of acidic energy. |\n| 12         | Lirien | This tiefling has alabaster skin and deep black hair. She wears a suit of gleaming white armor and carries a longsword. |\n| 13         | Malleus | This tiefling has a twisted, angular face and long, jagged horns. He wears a black cloak and carries a flail. |\n| 14         | Narissa | This tiefling has lustrous copper skin and long, pointed talons. She wears a flowing orange skirt and carries a small vial of poison. |\n| 15         | Orion | This tiefling has midnight blue skin and piercing white eyes. He wears an elegant suit and carries a slim rapier. |\n| 16         | Pyra | This tiefling has blazing red skin and a pair of small, fiery wings. She wears a simple tunic and trousers, and carries a fiery whip. |\n| 17         | Quinn | This tiefling has iridescent green skin and long, flowing hair. She wears a flowing green gown and carries a silver wand. |\n| 18         | Raze | This tiefling has ebony skin and sharp, angular features. He wears a set of black studded leather armor and carries a pair of vicious-looking daggers. |\n| 19         | Sariel | This tiefling has shimmering golden skin and a pair of glistening wings. She wears a flowing white robe and carries a holy symbol. |\n| 20         | Xander | This tiefling has obsidian black skin and a pair of curved horns. He wears a fine black suit and carries a cane adorned with a ruby. |\r\n## Half-Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Ariaea | A bardic half-elf with long, curly hair who sings tales of long-lost love. |\n| 2          | Calathiel | A quiet and reserved half-elf who spends most of their time reading ancient tomes in their secluded hut. |\n| 3          | Darien | A friendly half-elf who runs a small garden in the middle of the city, tending to a variety of herbs. |\n| 4          | Erellis | A mischievous half-elf who loves to play pranks on people passing by their home in the forest. |\n| 5          | Finellen | A half-elf who works as a trader, traveling between towns to sell exotic goods and species. |\n| 6          | Galadriel | A highly respected half-elf who is a skilled fighter and dedicated leader of her clan. |\n| 7          | Hurin | A half-elf who has made his life's work the restoration and preservation of ancient ruins and artifacts. |\n| 8          | Iliandra | A half-elf bard who writes ballads and songs that inspire love and romance. |\n| 9          | Jaela | A half-elf who works as a healer, providing care and comfort to the sick and injured in the surrounding area. |\n| 10         | Kethryllia | A half-elf sorcerer who specializes in illusions, making her living as a street performer. |\n| 11         | Liriel | A half-elf who spends most of her time in the forest, communing with the spirits of nature. |\n| 12         | Maeglin | A half-elf who is known for their incredible archery skills and often participates in archery competitions. |\n| 13         | Nessa | A half-elf who works as a guide and adventurer, leading expeditions into the wilderness. |\n| 14         | Orin | A half-elf who has devoted his life to the study of alchemy and can often be found tinkering in his laboratory. |\n| 15         | Patrin | A half-elf rogue who makes their living as a thief, stealing from the wealthy and powerful. |\n| 16         | Quenya | A half-elf who is a skilled tracker and hunter, often hired by local leaders to deal with troublesome beasts. |\n| 17         | Rhiannon | A half-elf who is well-known for her incredible singing voice and often performs at festivals and gatherings. |\n| 18         | Sariel | A half-elf druid who has dedicated her life to the protection and restoration of the forest and its inhabitants. |\n| 19         | Tariel | A half-elf who has trained extensively in the art of swordplay and can often be found practicing his moves. |\n| 20         | Vaelen | A half-elf ranger who is an expert at tracking and survival, known to guide adventurers through the wilderness. |\r\n## Orcs\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Gruumsh's Fury | An Orc war chief driven by their devotion to the one-eyed god. They wear black plate armor and carry a ferocious battleaxe. |\n| 2          | Grimgor Ironhide | An infamous and feared Orc warboss with a deep, gravelly voice. They are known for their strength and cunning tactics in battle. |\n| 3          | Uzguk the Unyielding | An Orc warrior with scars covering their face and arms, evidence of their many battles. They wear chain mail and wield a large, two-handed sword. |\n| 4          | Krogath Skullcrusher | A hulking Orc brute with a bald head and spiked gauntlets. They delight in crushing the skulls of their enemies and have a cruel sense of humor. |\n| 5          | Drogath the Bloody | An Orc berserker covered head-to-toe in war paint. They wield dual battleaxes and have no fear of death. |\n| 6          | Gnarsh One-Eye | An Orc shaman with a single glowing red eye. They specialize in dark magic and can call upon the spirits of the dead to aid them in battle. |\n| 7          | Haroth the Swift | An Orc rogue with a shifty demeanor. They wear leather armor and wield a pair of wickedly sharp daggers. |\n| 8          | Brugoth the Mauler | An Orc gladiator known for their devastating attacks with a large maul. They are covered in scars and wear studded leather armor. |\n| 9          | Grukk One-Tusk | An Orc hunter with a fierce loyalty to their clan. They wear furs and carry a longbow and a quiver full of arrows poisoned with deadly toxins. |\n| 10         | Vorgoth the Warchief | An Orc leader with a booming voice who inspires their warriors to greatness. They wear ornate plate armor and wield a large greatsword. |\n| 11         | Snikch the Silent | An Orc assassin who takes pride in their ability to kill without being seen or heard. They wear black leather armor and wield a pair of poisoned daggers. |\n| 12         | Brogath the Brute | An Orc enforcer who uses their massive size and strength to intimidate others. They wear no armor, only a loincloth, and wield a large iron club. |\n| 13         | Grimgosh Red-Eye | An Orc pirate who sails the seas, pillaging and plundering. They wear a captain's hat and an ornate red coat, and carry a cutlass and a flintlock pistol. |\n| 14         | Krug the Vicious | An Orc gladiator who loves the thrill of battle. They wear a spiked helm and wield a pair of curved swords with deadly precision. |\n| 15         | Grunk One-Ear | An Orc bounty hunter who always gets their mark. They wear studded leather armor and carry a crossbow and a hunting knife. |\n| 16         | Skarnak the Skinner | An Orc who specializes in flaying their enemies alive. They wear a cloak made of human skin and carry a set of sharp knives and a whip. |\n| 17         | Grakthar Bloodfist | An Orc warlord who has never lost a battle. They wear plate armor and wield a large, intimidating warhammer. |\n| 18         | Grom the Slayer | An Orc gladiator who takes on opponents much larger than themselves. They wear a helmet adorned with horns and wield a pair of hand axes. |\n| 19         | Zul'Tar the Barbarian | An Orc who prefers raw strength over tactics in battle. They wear little more than furs and wield a large greataxe with ease. |\n| 20         | Grishnak the Wise | An Orc who has risen to the top of their clan through cunning and intelligence rather than brute strength. They wear no armor, only robes, and carry a staff that can unleash powerful arcane spells. |\r\n## Half-Orcs\r\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:-----------:|:---------------------------------------:|\n| 1              | Raguk        | A half-orc with a scar across his cheek. He wears leather armor and carries a battleaxe. He is constantly muttering to himself. |\n| 2              | Grimgor      | A heavily muscled half-orc with a shaven head and a thick beard. He wears chain mail and wields a greatsword. He is quick to anger but also quick to forgive. |\n| 3              | Krogg        | A half-orc with a large nose and a wicked smile. He wears studded leather and has a handaxe at his side. He enjoys telling stories of his adventures. |\n| 4              | Thok         | A tall and lanky half-orc with long, braided hair. He wears a breastplate and carries a longsword. He is quiet and contemplative. |\n| 5              | Gromm       | A half-orc who is missing one of his tusks. He wears plate armor and carries a flail. He is always looking for a good fight. |\n| 6              | Drog         | An overweight half-orc with a big belly and a jovial grin. He wears scale mail and carries a morningstar. He enjoys eating and drinking more than anything else. |\n| 7              | Uzguk       | A half-orc with a bald head and a large scar above his left eye. He wears hide armor and carries a longbow. He is quiet and serious. |\n| 8              | Garzuk      | A half-orc with a wild beard and unkempt hair. He wears chain mail and carries a mace. He is prone to fits of rage. |\n| 9              | Krak         | A half-orc with a sharp, angular face. He wears plate armor and carries a halberd. He is calm and collected in combat. |\n| 10            | Gruumsh  | A half-orc with a distinctive eye patch over his left eye. He wears full plate armor and wields a greatsword. He is a fearsome warrior and respected leader. |\n| 11            | Korgath   | A half-orc with a scarred face and a short temper. He wears leather armor and carries two shortswords. He is fiercely loyal to his friends. |\n| 12            | Norkor    | A half-orc with a bald head, a pointed nose, and a toothy smile. He wears chain mail and carries a warhammer. He is always looking for a bargain. |\n| 13            | Vrogar     | A half-orc with a rugged face and a thick beard. He wears studded leather and carries a greataxe. He has a soft spot for animals. |\n| 14            | Skarrg    | A half-orc with a gruff voice and a bad attitude. He wears hide armor and carries a battleaxe. He has a history of getting into trouble with the law. |\n| 15            | Thurg     | A half-orc with a large scar on his neck. He wears plate armor and carries a spear. He is a devout follower of Gruumsh. |\n| 16            | Drogath  | A half-orc with a shaved head and a muscular build. He wears chain mail and carries a longsword. He enjoys singing bawdy drinking songs. |\n| 17            | Zhulg    | A half-orc with a broad nose and a crooked smile. He wears scale mail and carries a morningstar. He is a skilled blacksmith. |\n| 18            | Drak     | A half-orc with a missing front tooth and a thick neck. He wears hide armor and carries a shortbow. He is a survivalist and a skilled tracker. |\n| 19            | Grommash | A half-orc with a regal bearing and a bushy beard. He wears full plate armor and wields a mace. He is a member of a noble family. |\n| 20            | Thrakgar | A half-orc with a long beard and a grim countenance. He wears plate mail and carries a battleaxe. He is haunted by the memory of a fallen comrade. |\r\n## Halflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Bixby Boxtree | A portly halfling with rosy cheeks and a jovial laugh. He runs the local inn and loves nothing more than seeing his guests happy and well-fed. |\n| 2          | Lolly Loxley | A young halfling with a mop of unruly brown hair and bright green eyes. She wanders the countryside, collecting herbs and selling them to healers and alchemists. |\n| 3          | Peregrin Tumbleweed | An adventurous halfling with an insatiable curiosity. He travels the world, seeking out new experiences and making friends everywhere he goes. |\n| 4          | Chancy Goodfellow | A wily halfling with a quick smile and a faster wit. He's a skilled thief and con artist, always ready with a clever scheme to relieve the unsuspecting of their valuables. |\n| 5          | Cora Cottonblossom | A kind-hearted halfling with a gentle voice and a healing touch. She's a skilled herbalist and midwife, and is always there when her community needs her. |\n| 6          | Fenton Applewood | A stoic halfling with a weathered face and calloused hands. He's a skilled farmer who takes great pride in his produce, and is always willing to share a story or two with those who stop by his farm. |\n| 7          | Poppy Featherfoot | A bubbly halfling with a bright pink bow in her hair and a purse full of coins. She's a successful businesswoman who runs a thriving bakery, and her cinnamon rolls are legendary. |\n| 8          | Wilfred Bramblebush | A gruff halfling with a bushy beard and suspicious eyes. He's a retired adventurer who now spends his days as a blacksmith, creating weapons and armor for the local militia. |\n| 9          | Clover Greenhill | A shy halfling with a talent for music. She plays the lute beautifully, but is nervous about performing in public. She's content to play for small gatherings of friends and family. |\n| 10         | Breezy Meadowlark | A free-spirited halfling with a love of nature. She lives in a cozy hobbit hole in the woods, and spends her days tending her garden and communing with the animals. |\n| 11         | Rascal Longbottom | A mischievous halfling with a twinkle in his eye and a spring in his step. He delights in playing pranks on his friends and family, but never means any harm. |\n| 12         | Tilly Buckleberry | A no-nonsense halfling with a stern expression and a booming voice. She runs the local militia with an iron fist, but is respected and loved by all who serve under her. |\n| 13         | Skipper Berryfoot | An effervescent halfling with a love of the sea. He's a skilled sailor and fisherman, and has traveled the world over. He always has an exciting story to tell. |\n| 14         | Sable Underhill | A brooding halfling with a deep, gravelly voice. He's a skilled assassin who plies his trade in the shadows. He'll work for anyone who can pay his high fees. |\n| 15         | Pippin Moss | A cheerful halfling with a quick wit and a love of good food. He runs a successful restaurant with his wife, and takes great pride in his culinary creations. |\n| 16         | Tansy Brownlock | A studious halfling with a keen intellect. She's a renowned scholar and historian, and has written several treatises on the history of halflings. |\n| 17         | Huck Smallwood | A boisterous halfling with a booming laugh and a love of adventure. He's a skilled ranger who roams the countryside, protecting his community from monsters and bandits. |\n| 18         | Rosie Baggins | A plump halfling with a warm smile and a kind heart. She's a skilled healer who runs a clinic for the sick and injured. She never turns anyone away, no matter how large or small the fee. |\n| 19         | Brandy Sandyman | A suave halfling with a taste for the finer things in life. He's a successful merchant who deals in rare and valuable goods. He's always looking for new business opportunities. |\n| 20         | Bilbo Bolger | A legend among halflings. He's a retired adventurer who discovered a magical ring that made him invisible. He now spends his days writing his memoirs and entertaining visitors with his stories. |\r\n## Drow\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n|  1         |   Alyndrae   |  An arrogant drow noble who looks down upon others with disdain, but will do whatever it takes to maintain their high position.  |\n| 2          |  Kelnozz   | A charismatic and suave drow who is a master at manipulation and deception. They use their skills to get what they want, often at the expense of others.  |\n| 3          |  Najala   | A powerful and dangerous drow priestess who is fiercely loyal to Lolth, and will do anything to further her dark deity's goals.  |\n| 4          |  Zosia   |  A drow ranger who prefers the solitude of the wilderness to the politics of drow society. They are a skilled tracker and survivalist who is not to be underestimated. |\n| 5          |  Fandral   | A drow warrior who follows a strict code of honor and takes pride in their combat prowess. They are fiercely loyal to their clan and will do whatever it takes to defend them.  |\n| 6          |  Xullrae   | A cunning and ambitious drow merchant who is always looking for opportunities to expand their business and influence. They are not above using underhanded tactics to get what they want.  |\n| 7          |  Nym   | A drow assassin who is a master of stealth and infiltration. They are cold, calculating, and utterly ruthless in their pursuit of their targets.  |\n| 8          |  Korin   | A drow sorcerer who is fascinated by the darker aspects of magic. They are always experimenting with new spells and rituals, and are not afraid to take risks to achieve their goals.  |\n| 9          |  Zirithian   | A drow bard who uses their musical talents to entertain and manipulate those around them. They are intelligent and quick-witted, and always seem to have a plan up their sleeve.  |\n| 10         |  Jezzara   | A drow rogue who is a skilled thief and infiltrator. They are always on the lookout for their next score, and are not above double-crossing their associates to get what they want.  |\n| 11         |  Zarae   | A drow druid who has a deep connection to the natural world. They are fiercely protective of the wilderness and will not hesitate to defend it with force if necessary. |\n| 12         |  Liriel   | A drow monk who has mastered the discipline of body and mind. They are humble and reserved, but their inner strength is formidable.  |\n| 13         |  Vhaeraun   | A drow warlock who serves the god of thievery and shadow. They are always plotting and scheming, and are not above making pacts with powerful entities to gain more power. |\n| 14         |  Zilvra   | A drow cleric who serves the goddess of love and beauty. They are kind and compassionate, and use their healing magic to aid those in need.  |\n| 15         |  Yathlanae   | A drow paladin who is devoted to the ideals of justice and righteousness. They are a fierce warrior who will not hesitate to smite evil wherever it is found.  |\n| 16         |  Pharaun   | A drow wizard who is a master of the arcane. They are arrogant and condescending, but their skill with magic is unmatched.  |\n| 17         |  Sorn   | A drow fighter who is a veteran of many battles. They are gruff and taciturn, but their experience makes them a valuable asset in any fight. |\n| 18         |  Zevith   | A drow rogue who has a knack for finding hidden treasures and secret passages. They are always on the lookout for their next big score.  |\n| 19         |  Eilistraee   | A drow cleric who serves the goddess of dance and song. They are kind and compassionate, and use their healing magic to aid those in need. They also have a love of art and beauty. |\n| 20         |  Zephyrus   | A mysterious drow who keeps their motives and goals hidden. They seem to have knowledge of many secrets, but are not willing to share them easily. |\r\n## Gnomes\r\n| **Roll** | **Name** | **Description** |\n|:--------:|:--------:|:----------------|\n|    1     |  Bimple  | A jolly gnome with a penchant for mischief and pranks, often seen with a twinkle in their eye. |\n|    2     |  Fizzle  | A highly intelligent gnome wizard, whose experiments frequently explode in their face. |\n|    3     |   Nix    | A reclusive gnome who spends most of their time tinkering with small machines and gadgets. |\n|    4     |  Puckett | A gnome bard with a talent for playing the lute, whose songs can lift the spirits of even the most downtrodden adventurers. |\n|    5     |  Tockle  | A gnome artificer who creates wondrous clockwork contraptions, and is always on the lookout for new parts and components. |\n|    6     |  Quipper | A gnomish rogue with a quick wit and slick fingers, who is always ready for a heist or a good prank. |\n|    7     |  Wizzle  | An eccentric gnome inventor whose latest invention always seems just on the verge of working. |\n|    8     |  Snicket | A diminutive gnome druid who is often found communing with small animals and plants. |\n|    9     |  Snappy  | A boisterous gnome fighter who loves nothing more than a good brawl, and is always itching for a fight. |\n|   10     |  Flicker | A gnome sorcerer with a talent for manipulating fire, whose presence is often accompanied by flickering flames. |\n|   11     |  Mimsy   | A kind-hearted gnome cleric who dedicates their life to helping others, no matter how small the task may seem. |\n|   12     |   Glim   | A curious gnome scholar who is always seeking out new knowledge, whether from books or firsthand experience. |\n|   13     |  Puddin  | A jovial gnome chef who creates the most delectable pastries and treats, with a secret recipe handed down through their family for generations. |\n|   14     |  Twillip | A fastidious gnome who takes great pride in their appearance and always looks immaculate, no matter the situation. |\n|   15     |  Grinner | A prankster gnome who often wears a mischievous grin, and can find humor in even the most dire circumstances. |\n|   16     |  Zephyr  | A swift-footed gnome ranger who is always on the move, scouting out unknown territories and mapping new areas. |\n|   17     |  Crankle | An irritable gnome hermit who prefers the company of animals over people, and is downright hostile to those who disturb their solitude. |\n|   18     |   Dink   | A curious gnome alchemist who experiments with all sorts of strange potions and concoctions, often with unexpected results. |\n|   19     |  Gadget  | A brilliant gnome engineer who constructs complex machines and devices, and is always on the lookout for new challenges to solve. |\n|   20     |  Sparkle | A gnome enchantress whose magic is imbued with a powerful spark, making her spells particularly vibrant and dazzling to behold. |\r\n## Genasi\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Aerin  | An air Genasi with wispy hair and eyes that change color with the wind. |\n| 2          | Geyrin | An earth Genasi with rocky features and a steady, grounded presence. |\n| 3          | Marideth | A water Genasi with flowing blue hair and a calm, soothing voice. |\n| 4          | Pyrro | A fire Genasi with burning red eyes and fiery orange hair. |\n| 5          | Zephyra | An air Genasi with graceful movements and a love for dance. |\n| 6          | Terra | An earth Genasi with a greenish hue and a connection to nature. |\n| 7          | Maelstrom | A water Genasi with a wild energy and a tendency towards chaos. |\n| 8          | Ignatia | A fire Genasi with a sharp wit and a fiery temper. |\n| 9          | Galadrielle | An air Genasi with a regal bearing and a love of beautiful things. |\n| 10         | Onyx | An earth Genasi with dark features and a mysterious demeanor. |\n| 11         | Isadora | A water Genasi with mermaid-like qualities and crystalline blue eyes. |\n| 12         | Blaze | A fire Genasi with a cocky attitude and a constant flicker of flames around them. |\n| 13         | Cyclone | An air Genasi with a playful spirit and a tendency to cause breezes wherever they go. |\n| 14         | Gaia | An earth Genasi with a deep connection to the earth and a strong sense of responsibility. |\n| 15         | Kailani | A water Genasi with a love of the ocean and a deep sense of calm. |\n| 16         | Vulcan | A fire Genasi with a love of metalworking and a steely gaze. |\n| 17         | Mistral | An air Genasi with a love of travel and a desire for adventure. |\n| 18         | Sylphrena | An earth Genasi with a gentle smile and a calming presence. |\n| 19         | Thalassa | A water Genasi with a powerful singing voice and a love of stories. |\n| 20         | Ember | A fire Genasi with smoldering eyes and a fiery passion. |\r\n## Aarakocra\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Aera | A younger Aarakocra who is eager to prove themselves. They have bright feathers and piercing eyes. They tend to be a bit clumsy and scatterbrained. |\n| 2          | Aelius | A wise and respected member of the Aarakocra community. They have deep blue feathers and a stern look that belies their compassion. They are often consulted for advice. |\n| 3          | Vashti | A fierce warrior with bright red feathers. Despite their impressive size and strength, they are quite friendly and always willing to lend a helping talon. |\n| 4          | Kael | A curious and adventurous Aarakocra with green and yellow feathers. They are always on the lookout for new places to explore and new creatures to meet. |\n| 5          | Lirien | A kind and nurturing Aarakocra with soft gray feathers. They take great pride in caring for their nest and their hatchlings, and are always happy to offer guidance to younger Aarakocra. |\n| 6          | Zephyr | A mischievous Aarakocra with iridescent feathers that shimmer in the light. They love to play pranks on their friends and are always up for a good laugh. |\n| 7          | Thalia | A quiet and introspective Aarakocra with deep purple feathers. They spend most of their time meditating and contemplating the mysteries of the universe. |\n| 8          | Sylphrena | A graceful and elegant Aarakocra with white and silver feathers. They are a skilled musician and enjoy playing the flute. They have a calming presence that puts others at ease. |\n| 9          | Riven | A fierce and determined Aarakocra with dark brown feathers. They are a skilled hunter and take great pride in providing for their community. |\n| 10         | Arin | A bookish and studious Aarakocra with black feathers. They are always reading and studying, and are an excellent source of information on a wide range of subjects. |\n| 11         | Aeolus | A weathered and grizzled Aarakocra with faded blue feathers. They have seen much in their long life and have many stories to tell. They are often sought out for their wisdom and experience. |\n| 12         | Skye | A carefree and adventurous Aarakocra with vibrant blue and green feathers. They are always on the move and love to explore new places. They have a contagious enthusiasm that inspires others. |\n| 13         | Lyra | A gentle and compassionate Aarakocra with soft pink feathers. They are a healer and take great pride in easing the suffering of others. |\n| 14         | Talis | A fierce and loyal Aarakocra with deep red feathers. They are a skilled fighter and will stop at nothing to protect their community. |\n| 15         | Phoenix | A fiery and passionate Aarakocra with bright orange and red feathers. They have a quick temper but are fiercely loyal to those they consider allies. |\n| 16         | Aurora | A mystical and otherworldly Aarakocra with shimmering rainbow feathers. They are a powerful spellcaster and have a deep connection to the supernatural. |\n| 17         | Avian | An aloof and enigmatic Aarakocra with dark gray feathers. They keep to themselves and are often misunderstood by others. |\n| 18         | Eryndor | A brooding and melancholy Aarakocra with jet black feathers. They are haunted by a tragedy from their past and are slow to trust others. |\n| 19         | Nimbus | A lighthearted and jovial Aarakocra with white and gray feathers. They are a skilled acrobat and love to perform daring feats of aerial agility. |\n| 20         | Garran | A gruff and no-nonsense Aarakocra with brown and gold feathers. They are a skilled blacksmith and are always willing to craft or repair equipment for their community. |\r\n## Kobold\r\n| Dice Value | Name | Description |\n|-|-|-|\n| 1 | Yib | Yib is a scrawny kobold with beady eyes and a constant sniffle. They're always cold and usually wrapped in a well-worn shawl, but they're surprisingly nimble and dexterous. They're easily intimidated, but will fiercely defend their companions if necessary. |\n| 2 | Gerrak | Gerrak has a perpetual sneer on their face and isn't afraid to show their teeth. They're one of the larger kobolds in their pack and their claws are always sharp. Gerrak is fiercely competitive and likes to exert their dominance, but they'll back down if they sense a true threat. |\n| 3 | Sif | Sif is quiet in nature and seems to blend into shadows with ease. They're always watching, always assessing. Though they're not the strongest fighter, their intelligence and quick thinking has saved the party more than once.|\n| 4 | Fagin | Fagin is a shrewd kobold who acts more like a thief than a fighter. They're always hatching schemes and haggling with merchants to get the best deal. Sometimes they can be a little too quick to abandon their allies if it means protecting their own interests. |\n| 5 | Kixer | Kixer may not be the most physically imposing kobold, but what they lack in strength they make up for in charm. Kixer is never afraid to spin a tall tale or sweet-talk their way out of a tight spot. Sometimes they're a bit too trusting of strangers who flatter them. |\n| 6 | Grik | Grik is a bit of a wild card. They're unpredictable and always eager to jump into battle, even if it means putting themselves in danger. They're fiercely loyal to their pack, but sometimes their impulses can lead them astray. |\n| 7 | Zin | Zin is a little obsessed with shiny objects. They're constantly tinkering with bits of metal and glass, trying to find ways to make them more eye-catching. They're not the most talkative of creatures, but they'll wax poetic about the beauty of a well-crafted trinket. |\n| 8 | Crix | Crix may be young, but they're already showing signs of being a great leader. They're always taking charge and making decisions for the good of the group. Their confidence sometimes borders on arrogance, but their heart is in the right place. |\n| 9 | Nix | Nix is the consummate planner. They're always trying to anticipate the next move of their enemies and devise counter-strategies. They can be a bit intimidating to those who don't appreciate their meticulous nature, but they're always looking out for the group's best interests. |\n| 10 | Vex | Vex is a bit of a troublemaker. They're always pushing boundaries and testing the limits of what's allowed. They're not always the most reliable in a fight, but they bring a certain energy to the group that can't be ignored. |\n| 11 | Plix | Plix is a bit of an oddball. They're always mumbling to themselves and seem to be a little out of touch with reality. But when it comes to casting spells, Plix is a force to be reckoned with. Their magic is unpredictable and often surprising. |\n| 12 | Snik | Snik is a bit of a brute. They prefer to solve problems with sheer strength rather than cleverness or strategy. They can be a bit impatient and hotheaded, but their passion and loyalty make up for it. |\n| 13 | Chur | Chur is a good-natured kobold who always seems to have a smile on their face. They're not the most skilled fighter, but their positivity and enthusiasm are infectious. They're always happy to lend a hand or offer words of encouragement when the group needs it. |\n| 14 | Krel | Krel is a bit of a loner. They keep to themselves most of the time and only speak when necessary. But when they do weigh in, their insights are often valuable. They're not easily ruffled and seem to be able to keep their emotions in check. |\n| 15 | Vorn | Vorn is the ultimate survivalist. They're always on the lookout for sources of food and shelter, and they can find a use for just about anything. They're not the most social of packmates, but their practicality and resourcefulness make them indispensible. |\n| 16 | Blat | Blat is a bit of a con artist. They're always looking for angles and ways to come out ahead in any deal. They don't necessarily mean any harm, but they're not above a little shady business from time to time. |\n| 17 | Trak | Trak has a bit of a chip on their shoulder. They're always sizing up others and trying to establish their dominance. They can be a bit confrontational and quick to anger, but they're also fiercely loyal and will go to great lengths to protect their packmates. |\n| 18 | Hix | Hix is a bit of a neat freak. They're always fussing over their appearance and their personal belongings. They can be a bit high-strung and demanding, but their attention to detail can be extremely helpful on a mission where accuracy counts. |\n| 19 | Wrix | Wrix is a bit of a philosopher. They're always pondering the meaning of life and getting into deep conversations with anyone who will indulge them. They're not the most practical of kobolds, but their big-picture thinking can be insightful. |\n| 20 | Snax | Snax is a bit of a gourmand. They're always on the lookout for the tastiest morsels and are never one to pass up a free meal. They can be a bit absentminded when their stomach is growling, but their love of flavors can actually be quite useful in certain situations. |\r\n## Bugbear\r\n| Dice Value | Name          | Description                                                                                                                                                                                                                       |\n|------------|---------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1          | Grimgnash     | Grimgnash the Unbreakable is a towering Bugbear with rippling muscles and a permanently furrowed brow. His eyes glitter with menace and his voice rumbles like thunder. He's never lost a fight and doesn't plan on doing so anytime soon. |\n| 2          | Urgok         | Urgok is a fierce Bugbear with a thick mane of black fur and sharp claws that glint in the light. His matted fur ripples with each movement, and his growling voice is deep and menacing.                                                       |\n| 3          | Grommok       | Grommok the Ironclaw is a tall, broad-shouldered Bugbear with an intimidating demeanor. He's battle-hardened and grizzled, with scars criss-crossing his thick hide. His gravelly voice carries authority and strikes fear into those around him.          |\n| 4          | Snarltooth    | Snarltooth is a lean and wiry Bugbear with a short fuse and bad attitude. His razor-sharp claws and teeth glisten in the sun as he prowls around his territory, always on the lookout for a challenge. His voice is sharp and full of menace.                 |\n| 5          | Thokk        | Thokk is a massive Bugbear with a quiet, introspective nature. He towers over most creatures, with a thick mane of fur and piercing eyes that seem to see right through you. His voice is deep and rumbling, like distant thunder.                             |\n| 6          | Krogash      | Krogash is a cunning Bugbear with a sharp mind and even sharper claws. He moves with grace and precision, stalking his prey in the shadows. His voice is low and silken, with a hint of danger lurking beneath the surface.                                |\n| 7          | Grumbar      | Grumbar the Crusher is a massive Bugbear with a reputation for brute strength and crushing blows. He's towering and muscular, with a battle-scarred hide and eyes that smolder with barely restrained fury. His voice is deep and rumbling.                        |\n| 8          | Basher       | Basher is a stocky Bugbear with a thick neck and a wide, toothy grin. He loves nothing more than a good scrap, and will gleefully trample anyone who gets in his way. His voice is booming and filled with mirth.                                          |\n| 9          | Nashara      | Nashara is a sleek and agile Bugbear with an unquenchable thirst for adventure. Her nimble fingers can pick any lock, and her keen intellect can solve any puzzle. Her voice is smooth and charming, with a hint of danger lurking beneath the surface.          |\n| 10         | Grizznak     | Grizznak the Mauler is a hulking Bugbear whose reputation precedes him. He's a force to be reckoned with, with rippling muscles and a thick hide that can deflect even the sharpest blades. His voice is low and dangerous, like a growling bear.                     |\n| 11         | Snikch       | Snikch is a wiry and agile Bugbear with lightning-fast reflexes and sharp, intelligent eyes. His voice is quick and full of wit, and his sly grin is never far from his lips. He's a master of disguise and knows how to blend in wherever he goes.            |\n| 12         | Fendar       | Fendar the Ruthless is a ruthless Bugbear with a fearsome reputation for violence and cruelty. His massive frame towers over most creatures, and his eyes are cold and calculating. His voice is low and steady, with a hint of sadistic pleasure.                 |\n| 13         | Grunk        | Grunk is a grizzled and battle-worn Bugbear with a deep, booming voice and a menacing presence. He's a veteran of a hundred battles, with scars covering his thick hide and a fierce determination burning in his eyes.                                 |\n| 14         | Gorzuk       | Gorzuk the Mauler is a massive Bugbear with arms thick as tree trunks and a voice that rumbles like an earthquake. His presence on the battlefield is overwhelming, and his enemies quake in fear at the mere sight of him.                                |\n| 15         | Klarg        | Klarg the Butcher is a ferocious Bugbear with a reputation for hacking his enemies to pieces with his massive battle-axe. His gruff voice and surly demeanor don't hide the cold fury burning within him.                                            |\n| 16         | Snarl        | Snarl is a wiry and taunting Bugbear who delights in tormenting his enemies. His quick wit and sharp tongue are matched only by his razor-sharp claws and teeth. His voice is high-pitched and sing-songy, filled with mocking laughter.                     |\n| 17         | Grimgor      | Grimgor the Slayer is a fearless Bugbear with a thirst for blood and a battle-lust that never seems to satiate. His voice is a guttural roar that echoes across the battlefield, and his fierce presence commands respect and fear from all who face him.     |\n| 18         | Grokk        | Grokk the Hunter is a stealthy Bugbear who prowls the forests and mountains, hunting down his prey with deadly accuracy. His voice is low and smooth, with a hint of danger lurking beneath the surface.                                           |\n| 19         | Uthgar       | Uthgar the Destroyer is a towering Bugbear with a massive hammer that he wields with deadly precision. His voice is deep and rumbling, and his eyes smolder with barely restrained fury. He's a force to be reckoned with on the battlefield.                |\n| 20         | Thragok      | Thragok the Devourer is a massive Bugbear whose appetite for destruction is matched only by his insatiable hunger for flesh. His voice is deep and booming, and his bloodshot eyes glint with mad, uncontrollable fury. He's a force of nature unleashed. |\r\n## Hobgoblin\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Krogmar | Krogmar is a hulking hobgoblin with bulging muscles and a short temper. He wields a large battleaxe and is covered in scars from past battles. |\n| 2 | Gruznak | Gruznak is a hobgoblin ranger who is known to be an excellent tracker. He prefers to use his longbow to take down foes from a distance, but he's not afraid to jump into battle if necessary. |\n| 3 | Drogath | Drogath is a hobgoblin cleric who worships Maglubiyet, the god of hobgoblins. He wears black robes and carries a staff that glows with a faint red light. |\n| 4 | Throg | Throg is a hobgoblin bard who loves to perform for anyone who will listen. He plays a lute and sings songs about hobgoblin heroes of the past. |\n| 5 | Zogar | Zogar is a hobgoblin rogue who specializes in infiltration and sabotage. He wears dark clothing and carries a set of thieves' tools. |\n| 6 | Grimgor | Grimgor is a hobgoblin warlord who commands a small army of goblins. He wears spiked armor and wields a mighty greatsword. |\n| 7 | Kragh | Kragh is a hobgoblin mercenary who will work for anyone who pays him enough coin. He's a skilled fighter who's always looking for his next job. |\n| 8 | Skarr | Skarr is a hobgoblin shaman who communicates with the spirits of the earth. He wears leather armor and carries a wooden staff adorned with animal bones. |\n| 9 | Urguk | Urguk is a hobgoblin wizard who has spent years studying the arcane arts. He wears flowing robes and carries a wand that crackles with magical energy. |\n| 10 | Grizzt | Grizzt is a hobgoblin druid who prefers the company of animals to that of other humanoids. He can shapeshift into a bear and is often accompanied by a group of wolves. |\n| 11 | Snik | Snik is a hobgoblin alchemist who spends most of his time concocting strange potions and explosives. He wears goggles and carries a bag full of unusual ingredients. |\n| 12 | Gruumsh | Gruumsh is a hobgoblin who has lost an eye in battle. He wears a black patch over the missing eye and is known for his fierce temper. |\n| 13 | Azruk | Azruk is a hobgoblin monk who has spent years training in martial arts. He wears light clothing and moves with an almost supernatural grace. |\n| 14 | Gorthok | Gorthok is a hobgoblin engineer who specializes in creating siege weapons. He's always tinkering with something and can often be found covered in soot. |\n| 15 | Grimgnash | Grimgnash is a hobgoblin fighter who has taken an oath of vengeance against a rival tribe. He wears warpaint and carries a battered shield. |\n| 16 | Nomog | Nomog is a hobgoblin paladin who fights for the glory of Maglubiyet. He wears gleaming plate armor and carries a holy symbol of his deity. |\n| 17 | Skruk | Skruk is a hobgoblin assassin who is rarely seen but often feared. He moves silently and strikes with deadly precision. |\n| 18 | Zorgath | Zorgath is a hobgoblin necromancer who's obsessed with death and decay. He wears a black hood and carries a staff adorned with human bones. |\n| 19 | Krazh | Krazh is a hobgoblin hunter who's never without his trusty hunting hound. He wears a cloak made from animal skins and carries a bow. |\n| 20 | Groznack | Groznack is a hobgoblin artificer who creates magical artifacts for his hobgoblin brethren. He wears a leather apron and carries a toolbox full of strange devices. |\r\n## Changeling\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Kaela | Kaela is a charming changeling bard who often dazzles her audience with her enchanting music and charismatic personality. |\n| 2 | Oryn | Oryn is a mysterious changeling who can expertly blend into any crowd, making him an ideal spy or scout. |\n| 3 | Desi | Desi is a soft-spoken changeling who prefers to keep to herself. She works as a healer and has a kind and gentle demeanor towards those in need. |\n| 4 | Erevan | Erevan is a cunning changeling rogue who uses his shapeshifting abilities to infiltrate and steal from his enemies. |\n| 5 | Risa | Risa is a confident changeling fighter who is not afraid to get her hands dirty. She is fiercely loyal to those she considers friends. |\n| 6 | Thalia | Thalia is a sly changeling sorceress who specializes in illusion and trickery magic. She enjoys playing games with others and often uses her abilities to prank her friends. |\n| 7 | Gethen | Gethen is a stoic changeling monk who lives a life of discipline and spirituality. He often keeps to himself, but will offer guidance to those who seek it. |\n| 8 | Lirien | Lirien is a cheerful changeling druid who sees the beauty and magic in everything around her. She spends most of her time communing with nature and helping others understand its wonders. |\n| 9 | Torin | Torin is a gruff changeling ranger who has a deep connection with animals. He prefers the company of nature over that of civilization and can be fiercely territorial when his home is threatened. |\n| 10 | Sarai | Sarai is a confident and ambitious changeling warlock who has made a pact with a powerful entity. She is not afraid to use her dark powers to achieve her goals. |\n| 11 | Nessa | Nessa is a mischievous changeling rogue who loves to play pranks and pull off daring heists. She is quick on her feet and can talk her way out of almost any situation. |\n| 12 | Tynan | Tynan is a reserved changeling paladin who is deeply committed to his faith. He sees his shapeshifting ability as a gift from his deity and uses it to protect the innocent and hunt down evil. |\n| 13 | Riven | Riven is a fierce changeling barbarian who revels in the thrill of battle. She has a short fuse and can be prone to violent outbursts. |\n| 14 | Kiri | Kiri is a wise changeling wizard who has dedicated her life to studying magic. She has a vast amount of knowledge and is always eager to learn more. |\n| 15 | Nihlus | Nihlus is a mysterious changeling rogue who has a dark past. He rarely talks about himself and prefers to keep to the shadows. |\n| 16 | Sienna | Sienna is a friendly changeling bard who loves to entertain and make new friends. She has a gift for storytelling and can captivate her audience with ease. |\n| 17 | Branwen | Branwen is a confident changeling cleric who believes in the power of her faith to heal and protect others. She is not afraid to stand up to those who would do harm to her or her friends. |\n| 18 | Corin | Corin is a determined changeling ranger who has made it his mission to protect nature and all of its creatures. He has a strong sense of justice and is not afraid to fight for what he believes in. |\n| 19 | Elara | Elara is a mischievous changeling sorceress who enjoys playing pranks and causing mayhem. She has a wicked sense of humor and is always looking for a good time. |\n| 20 | Zephyr | Zephyr is an eccentric changeling wizard who sees magic in everything around him. He is easily distracted by shiny objects and loves to experiment with new spells. |\r\n## Aasimar\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Amarael  | An aasimar with golden hair and fierce eyes, who is known for their unwavering commitment to justice and righteousness. |\n| 2          | Uriel   | This aasimar is known for their stoic expression and intimidating presence, making them an effective leader and guardian. |\n| 3          | Raziel    | Raziel is a wise and contemplative aasimar with a penchant for ancient lore and mysterious magic. |\n| 4          | Alyndra | This aasimar is a gentle healer, with a kind smile and a soothing demeanor that puts others at ease. |\n| 5          | Gabriel | Gabriel is a fierce warrior, with a powerful build and a driven sense of purpose. They will stop at nothing to see justice served. |\n| 6          | Seraphine | Seraphine is a beautiful aasimar with a voice like an angel. They use their gifts to inspire and uplift those around them. |\n| 7          | Zariel  | Zariel is a bold and fearless aasimar, unafraid to take risks and fight for what they believe in. |\n| 8          | Azrael  | This aasimar is a skilled diplomat, able to navigate even the most complex political situations with ease. |\n| 9          | Nuriel   | Nuriel is a calm and collected aasimar, with a serene aura that sets others at ease. They radiate inner peace. |\n| 10         | Ramiel  | Ramiel is a fierce and unpredictable aasimar, with a wild streak that sometimes leads them into trouble. |\n| 11         | Israfel | This aasimar has a deep sense of empathy, able to connect with others on a level that few can match. |\n| 12         | Sariel   | Sariel is a wise and thoughtful aasimar, able to see through complex problems and find elegant solutions. |\n| 13         | Remiel   | This aasimar is a passionate and driven warrior, who throws themselves into battle with reckless abandon. |\n| 14         | Evangeline | Evangeline is a confident and charismatic aasimar, able to rally others to her cause with ease. |\n| 15         | Barachiel | This aasimar is a patient and understanding mentor, helping others to hone their skills and reach their full potential. |\n| 16         | Cassiel   | Cassiel is a thoughtful and introspective aasimar, always seeking to understand the deeper meaning behind events. |\n| 17         | Jeremiel  | Jeremiel is a fierce and zealous aasimar, who sees themselves as the instrument of divine justice. |\n| 18         | Metatron  | This aasimar is a powerful and enigmatic figure, with a mysterious past and inscrutable motives. |\n| 19         | Nathaniel | Nathaniel is a skilled and cunning strategist, able to outmaneuver opponents before they know what hit them. |\n| 20         | Azraelle  | This aasimar is a dashing and daring adventurer, with a flair for the dramatic and a thirst for excitement. |\r\n## Human\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Amos | An old, grizzled soldier who has seen too much combat. Carries a large battleaxe and wears battered plate armor. |\n| 2 | Kalina | A beautiful, young woman with long curly hair and piercing green eyes. Wields a short sword and has a mysterious air about her. |\n| 3 | Garrick | A middle-aged man who runs a local tavern. Balding with a thick beard and jovial personality. Always happy to share a pint with adventurers. |\n| 4 | Elena | A stern, no-nonsense woman who serves as a town guard. Wears a breastplate and carries a spear. Has a reputation for being tough but fair. |\n| 5 | Tristram | A flamboyant bard who loves to regale his audiences with tales of adventure and woo the ladies. Dressed in colorful clothing and carries a lute. |\n| 6 | Leif | A stoic ranger who roams the wilderness. Prefers the company of animals to people and is often accompanied by a loyal wolf or hawk. |\n| 7 | Eliza | A wealthy merchant who is always looking to make a profit. Dresses in fine silks and carries a bag of coins. Will do whatever it takes to get ahead. |\n| 8 | Gideon | A gruff blacksmith who forges weapons and armor for adventurers. Always covered in soot and has a strong handshake. |\n| 9 | Alaric | A scholarly wizard who spends most of his time in his library. Wears a long robe and carries a wand. Has a tendency to ramble on about magical theory. |\n| 10 | Isolde | A kindhearted healer who tends to the sick and injured. Wears simple robes and carries a pouch of herbs and bandages. Believes in the power of love and compassion. |\n| 11 | Roland | A seasoned knight who fights for justice and honor. Wields a longsword and wears gleaming armor. Has a deep sense of loyalty and chivalry. |\n| 12 | Tara | A mischievous thief who loves to steal from the rich and give to the poor. Dresses in dark clothing and carries a bag of stolen goods. Has a quick wit and charming smile. |\n| 13 | Edmund | A grumpy old man who lives alone in the woods. Has a long beard and carries a walking stick. Will grumble about anything and everything. |\n| 14 | Lyra | A wandering minstrel who travels from town to town. Dressed in colorful clothing and carries a harp. Has a sweet singing voice and infectious laugh. |\n| 15 | Lucian | A brooding warrior who seeks revenge against his enemies. Wears black armor and carries a wicked looking sword. Obsessed with vengeance. |\n| 16 | Fiona | A fierce barbarian who grew up in the mountains. Wears furs and carries a massive axe. Has a wild, untamed spirit. |\n| 17 | Marcus | A retired adventurer who now runs an inn. Has colorful stories to share and is always happy to lend advice. Wears comfortable clothing and carries a mug of ale. |\n| 18 | Rowena | A cunning spy who works for a powerful organization. Dresses in nondescript clothing and carries a plethora of hidden weapons. Will do whatever it takes to complete her mission. |\n| 19 | Thane | A charismatic noble who commands respect and authority. Wears fine clothing and carries a jeweled cane. Expects the best from those around him. |\n| 20 | Rosalind | A gentle druid who protects nature and all of its creatures. Wears a cloak made of leaves and carries a staff. Has a gentle spirit and calming presence. |\r\n## Goliath\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Grondar | A muscular Goliath with shaggy brown hair and piercing blue eyes. He carries a large greataxe on his back and wears a necklace made of bear claws. |\n| 2          | Kethak | A stoic Goliath with short black hair and a scruffy beard. He wears a suit of chain mail and wields a maul with deadly precision. |\n| 3          | Horgath | A gruff Goliath with wild, unkempt hair and a thick beard. He is missing several teeth and has several scars on his arms and chest. He carries a bulky shield and a handaxe at his side. |\n| 4          | Thorgar | An imposing Goliath with braided hair and a bushy beard. He wears studded leather armor and has a longbow slung over his shoulder. |\n| 5          | Gormak | A hulking Goliath with messy blonde hair and a rugged beard. His face is scarred and he wears a helmet with two large horns. He wields a greatsword with ease. |\n| 6          | Urthak | A quiet Goliath with pastel green skin and a bald head. He wears a simple robe and carries no weapons. |\n| 7          | Vrogath | An energetic Goliath with deep red skin and a braided goatee. He wields a pair of hand axes with deadly precision. |\n| 8          | Grothgar | A reserved Goliath with long white hair and a thick beard. He wears a suit of plate armor and carries a massive hammer with him at all times. |\n| 9          | Aruk | A strong-willed Goliath with a bald head and a thick beard. He wears a loincloth and wields a giant club with terrifying strength. |\n| 10         | Drondar | A friendly Goliath with curly brown hair and a neatly trimmed goatee. He wears a leather jacket and carries a crossbow on his back. |\n| 11         | Rothgar | A weathered Goliath with a scarred face and a thick beard. He wears a suit of chain mail and carries a longsword and a shield. |\n| 12         | Uthak | A jovial Goliath with a shaved head and a bushy mustache. He wears a suit of plate armor and carries a battleaxe on his back. |\n| 13         | Jorvak | A mysterious Goliath with a shaved head and a pair of dark sunglasses. He wears a plain black cloak and carries a pair of daggers hidden in his boots. |\n| 14         | Yogthak | A fierce Goliath with a wild mane of hair and a braided beard. His arms are covered in tattoos and he wields a pair of scimitars with deadly grace. |\n| 15         | Krognar | A solemn Goliath with a bald head and a thick beard. He wears a suit of studded leather armor and carries a spear at his side. |\n| 16         | Zorgath | A contemplative Goliath with long black hair and a neatly trimmed mustache. He wears a simple brown tunic and carries a staff with a crystal orb at the top. |\n| 17         | Voggar | A reserved Goliath with a bald head and a thick beard. He wears a suit of plate armor and carries a tower shield with him at all times. |\n| 18         | Yorgar | A bold Goliath with a rugged beard and piercing blue eyes. He wears a suit of chain mail and carries a flail at his side. |\n| 19         | Dromak | A mysterious Goliath with a bald head and a braided beard. He wears a suit of black leather armor and carries a short sword at his side. |\n| 20         | Torval | An eccentric Goliath with spiky red hair and a clean-shaven face. He wears a colorful outfit and carries a lute with him at all times. |\r\n## Goblin\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Yik | Yik is a scrawny goblin with a pronounced overbite and a tendency to cower when threatened. He serves as a lackey for a larger goblin, but dreams of one day rising through the ranks. |\n| 2 | Snik | Snik is a grizzled veteran of many battles, with several scars and missing digits to show for it. He is fiercely loyal to his War Chief, and will defend them with his life. |\n| 3 | Grik | Grik is a mischievous goblin with a knack for stealing shiny objects. He is quick on his feet and difficult to catch, but has a soft spot for anyone who can offer him a good meal. |\n| 4 | Zik | Zik is a goblin inventor who specializes in creating traps and gadgets for his tribe. He speaks in a rapid-fire stream of ideas and concepts, and has a perpetual gleam in his eye. |\n| 5 | Flik | Flik is a timid goblin who is often bullied by others in his tribe. He is a skilled cook, and dreams of one day opening his own restaurant far away from the tribe. |\n| 6 | Rik | Rik is a brutish goblin who revels in violence and power. He is feared and respected by his fellow tribesmen, and has a particularly strong hatred for humans. |\n| 7 | Tlik | Tlik is a goblin priest who worships a chaotic deity of mischief and pranks. He is often seen leading bizarre rituals and rites of passage for the young goblins in his tribe. |\n| 8 | Krik | Krik is a goblin scout who is constantly on the lookout for new prey and resources. He is light on his feet and skilled at using cover and deception to stay hidden. |\n| 9 | Plik | Plik is a goblin storyteller who spins elaborate tales of adventure and romance. He is well-liked by his tribe, and many young goblins look up to him as a hero. |\n| 10 | Blik | Blik is a goblin scribe who keeps meticulous records of the tribe's activities and resources. He is somewhat aloof, and often comes across as boring or dull to his more adventurous brethren. |\n| 11 | Wrik | Wrik is a goblin musician who plays a rickety old lute and sings bawdy songs about goblin conquests and triumphs. He is always looking for a new audience, and is quick to make friends with anyone who enjoys his music. |\n| 12 | Vlik | Vlik is a goblin weaponsmith who crafts deadly blades and bows for his tribe. He takes great pride in his work, and is always looking for new and exotic materials to incorporate into his designs. |\n| 13 | Hrik | Hrik is a goblin philosopher who spends most of his time lost in thought. He is fascinated by obscure topics and enjoys debating the finer points of goblin society and culture. |\n| 14 | Mlik | Mlik is a goblin with an insatiable appetite for danger. He is always looking for the next big fight, and isn't afraid to take on opponents many times his size. |\n| 15 | Drik | Drik is a goblin tinkerer who specializes in clockwork devices and contraptions. He is fascinated by technology and spends long hours tinkering with his inventions. |\n| 16 | Jik | Jik is a goblin trader who is always on the lookout for new goods to sell or trade. He has a knack for spotting valuable items and is a shrewd negotiator. |\n| 17 | Nlik | Nlik is a goblin artist who paints and sculpts elaborate works of art out of found materials. He has a particular talent for capturing the grotesque and macabre. |\n| 18 | Qrik | Qrik is a goblin merchant who specializes in smuggling contraband and forbidden items. He is always looking for new and exotic items to sell, and is not above double-crossing his clients to make a profit. |\n| 19 | Tzik | Tzik is a goblin alchemist who brews potent potions and concoctions. She is secretive and reclusive, and is known to demand exorbitant prices for her wares. |\n| 20 | Vrik | Vrik is a goblin necromancer who practices dark magic and summoning. He is feared and reviled by most other goblins, but has a loyal following of undead creatures at his command. |\r\n## Duergar\r\n| **Dice Value** | **Name** | **Description** |\n|------------|---------|-----------------|\n| 1          | Agdron  | A grumpy blacksmith who constantly has soot on his face and is always muttering to himself about lazy apprentices. |\n| 2          | Drogdor | A pompous merchant who thinks he's better than everyone else. He's always counting his coins and bragging about his wealth. |\n| 3          | Horgar  | A shifty-eyed thief who always seems to be up to no good. He's covered in scars and has a nasty sneer. |\n| 4          | Korgoth  | A surly tavern keeper who doesn't tolerate any nonsense in his establishment. He's missing an eye and has a thick beard. |\n| 5          | Malakar | A somber undertaker who takes his job very seriously. He's always dressed in black and speaks in a whisper. |\n| 6          | Moradin | A proud warrior who loves nothing more than battle. He's covered in scars and carries a massive warhammer. |\n| 7          | Nalfein  | A secretive wizard who keeps to himself most of the time. He's always studying ancient tomes and muttering spells under his breath. |\n| 8          | Orin    | A jolly cook who loves to feed people. He's always covered in flour and has a big smile on his face. |\n| 9          | Ragnuk  | A gruff miner who has spent his whole life in the deep tunnels. He's got a thick beard and a pickaxe at his side. |\n| 10         | Skorok  | A quiet scout who knows the terrain better than anyone else. He's covered in mud and always carries a crossbow. |\n| 11         | Thangar | A stern captain who runs a well-disciplined ship. He's got a wooden leg and always wears a tricorn hat. |\n| 12         | Ulfgar  | A boisterous bard who loves to sing and tell stories. He's always the life of the party and has a lute slung over his shoulder. |\n| 13         | Vondal  | A ruthless mercenary who will do anything for the right price. He's got a scar over his left eye and carries a wicked-looking sword. |\n| 14         | Ysgrim  | A paranoid hermit who has retreated to the mountains. He's always muttering to himself and has a long beard. |\n| 15         | Zuldrek | A brooding loner who is often mistaken for a bandit. He's got a rough-looking horse and always wears a wide-brimmed hat. |\n| 16         | Drundar | A wise elder who is highly respected in the community. He's got a long beard and always wears a tattered cloak. |\n| 17         | Fendin  | A jovial brewer who loves to share his latest creations with anyone who will try them. He's got a beer belly and always smells like hops. |\n| 18         | Gruumsh | A fearsome warlord who has conquered many lands. He's got a massive battleaxe and always wears a helmet that covers his face. |\n| 19         | Jarnok  | A sly thief who is always looking for his next score. He's got a mischievous grin and always carries a lockpick. |\n| 20         | Khazad  | A stoic paladin who is devoted to his deity. He's got a holy symbol around his neck and always wears full plate armor. |\r\n## Dragon\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Pyraxion | A red dragon with glittering scales and eyes that shine like rubies. He is obsessed with collecting magical artifacts. |\n| 2          | Vindrixia | A green dragon with a scar on her left wing. She is fiercely protective of her hoard and will stop at nothing to defend it. |\n| 3          | Drakthanix | A young silver dragon who has a passion for adventure and enjoys traveling the world. |\n| 4          | Nyrandria | A blue dragon with an icy breath and a reputation for being cruel. She enjoys manipulating other creatures and watching them suffer. |\n| 5          | Xenodrax | A black dragon who dwells in the deepest depths of the Underdark. He is often sought out by adventurers who need his knowledge of the dark places beneath the earth. |\n| 6          | Fyrsythia | A gold dragon who is known for her wisdom and kindness. She often advises rulers and leaders of kingdoms and is highly respected. |\n| 7          | Aranthea | A young bronze dragon who is curious about the world and always eager to learn new things. She is friendly and approachable to those she meets. |\n| 8          | Zephyrion | A white dragon who lives in the frozen wastelands of the north. He is solitary and doesn't like visitors, but is willing to trade with those who are brave enough to approach him. |\n| 9          | Emmathor | A copper dragon who loves to tell stories and play practical jokes. He is often found in taverns or other public places, entertaining crowds with his tales. |\n| 10         | Drogathar | A powerful red dragon who rules over a large domain. He is feared by his subjects but is known to be fair and honorable. |\n| 11         | Sylphidia | A young brass dragon who enjoys basking in the sun and playing with small creatures. She is friendly to those she meets and enjoys sharing stories of her travels. |\n| 12         | Typhandros | An ancient gold dragon who has seen much of the world and has many tales to tell. He is highly respected and often consulted for his wisdom and advice. |\n| 13         | Valthrax | A black dragon with a keen sense of smell. He uses this sense to track down his prey and is a skilled hunter. |\n| 14         | Myrathina | A blue dragon with a calming voice. She is often sought out by those who need a mediator or a diplomat to resolve disputes. |\n| 15         | Khorvathia | A green dragon with venomous breath. She is cunning and enjoys manipulating others for her own benefit. |\n| 16         | Zarekthar | A red dragon who is obsessed with fire and often sets things ablaze just for fun. He is unpredictable and can be dangerous to be around. |\n| 17         | Tiaminthia | A young silver dragon who is fascinated by magic. She is always searching for ancient artifacts or hidden tomes to add to her collection. |\n| 18         | Rorikthar | A white dragon who is fascinated by music. He is often found listening to bards or playing his own instruments in the solitude of his icy lair. |\n| 19         | Synthalia | A bronze dragon who is fiercely loyal to her allies. She will stop at nothing to protect her friends and those she cares about. |\n| 20         | Zorander | An ancient black dragon who has lived for centuries. He is feared by all who cross his path and is known to be one of the most powerful dragons in the land. |\r\n## Dragonborn\r\n| Dice Value | Name          | Description                                                                                                                                                                    |\n|------------|---------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1          | Aelius        | A wise old dragonborn who spends most of his time meditating in his garden. His scales are a deep green and his eyes glow a bright yellow.                                          |\n| 2          | Dravax        | A fearsome warrior covered in scars from countless battles. His scales are a deep red and his eyes are a piercing blue. He carries a massive battle axe at all times.             |\n| 3          | Kaida         | A young dragonborn sorceress. Her scales are a shimmering gold and her eyes are a bright green. She is always reading spellbooks and experimenting with new magical spells.         |\n| 4          | Vorg          | A gruff dragonborn blacksmith who loves to spend his time at the forge. His scales are a deep black and his eyes are a glowing red. He is always covered in soot and coal dust.       |\n| 5          | Heskan        | A friendly dragonborn bard who loves to sing and tell stories. His scales are a bright blue and his eyes are a deep purple. His lute is always by his side, ready for a new tune.  |\n| 6          | Varis         | A sneaky rogue who loves to pick locks and steal treasure. His scales are a dark green and his eyes are a glowing orange. He always wears a hood to hide his identity.             |\n| 7          | Xaxas         | A powerful cleric who spends his days in service to his deity. His scales are a dull grey and his eyes are a deep brown. He is always willing to lend a helping hand to those in need. |\n| 8          | Niroth        | A noble dragonborn paladin who is always in search of evil to vanquish. His scales are a shiny silver and his eyes are a bright white. He carries a holy sword that glows with divine power. |\n| 9          | Sylra         | A quiet dragonborn druid who loves to spend her time in nature. Her scales are a soft green and her eyes are a bright yellow. She can often be found communicating with animals and plants. |\n| 10         | Zorath        | A grizzled old dragonborn who used to be a great adventurer. His scales are a dull brown and his eyes are a deep black. He is always willing to share stories of his past exploits.     |\n| 11         | Kethryx       | A hot-headed dragonborn who loves to fight and cause chaos. His scales are a bright orange and his eyes are a fierce red. He's quick to anger and slow to forgive.                  |\n| 12         | Jirax         | A sly and cunning dragonborn merchant who will do anything to make a profit. His scales are a deep purple and his eyes are a bright green. He always has the best deals in town.       |\n| 13         | Thakra        | A dragonborn ranger who is an expert at tracking and hunting prey. His scales are a mottled brown and his eyes are a bright yellow. He always has his trusty bow by his side.         |\n| 14         | Valyndra      | A beautiful young dragonborn who loves to dance and charm others with her wit. Her scales are a shimmering pink and her eyes are a sparkling blue. She can be a bit of a flirt.          |\n| 15         | Kytarax       | A grumpy old dragonborn who spends his days yelling at children to get off his lawn. His scales are a dull grey and his eyes are a deep black. He's not very friendly to outsiders.      |\n| 16         | Kolvar        | A quiet dragonborn monk who spends most of his time in deep meditation. His scales are a deep purple and his eyes are a bright blue. He is always looking to improve himself.           |\n| 17         | Rythala       | A dragonborn warrior who is always looking for a good fight. Her scales are a deep blue and her eyes are a fierce red. She carries a massive polearm that she's mastered with ease.   |\n| 18         | Vyxen         | A flirtatious dragonborn rogue who is always on the lookout for a wealthy patron to scam. Her scales are a shimmering silver and her eyes are a bright green. She's quite the charmer.   |\n| 19         | Tharros       | A dragonborn wizard who is always tinkering with new inventions. His scales are a bright green and his eyes are a deep blue. He can often be found in his laboratory, surrounded by gadgets.|\n| 20         | Naxxar        | A dragonborn fighter who loves to fight in the arena. His scales are a deep red and his eyes are a bright orange. He's always looking for his next opponent to show off his skills.   |\r\n## Lizardfolk\r\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:--------:|:---------------:|\n| 1              | Thraax    | A young and eager Lizardfolk hunter. Thraax is still learning about his people's traditions and eagerly seeks to earn the respect of his tribe. |\n| 2              | Zathux   | A wizened Lizardfolk shaman who has been the spiritual leader of his tribe for many years. He speaks little but when he does, his words always carry great depth and weight. |\n| 3              | Vixzara   | A beautiful Lizardfolk warrior who has fought in many battles. She is fiercely loyal to her tribe and will stop at nothing to protect it. |\n| 4              | Drulax    | A young Lizardfolk who has been chosen by the tribe to be its scout. He is always on the lookout for danger and has an uncanny ability to locate hidden enemies and traps. |\n| 5              | Krikin    | A gruff Lizardfolk who is in charge of the tribe's weapons and armor. He takes great pride in his work and is known throughout the region for his skill with a blade. |\n| 6              | Naxas     | A Lizardfolk who has left his tribe to explore the world. He is curious about other cultures and always eager to learn more. |\n| 7              | Ixuz     | A Lizardfolk chef who is known for his delicious and unusual recipes. He is always experimenting with new ingredients and techniques, much to the delight of his tribe. |\n| 8              | Vraax     | A Lizardfolk who has been exiled from his tribe for breaking one of their laws. He is bitter and resentful towards his former kin and is determined to prove himself to be better than them. |\n| 9              | Xalax     | A Lizardfolk who is an expert in the art of camouflage and stealth. He often uses his skills to scout ahead of the tribe or to ambush enemies. |\n| 10             | Gruumsh   | A fearsome Lizardfolk warrior who has fought in many battles. He is covered in scars and wears the skins of his enemies as trophies. |\n| 11             | Kaxas      | A Lizardfolk who is an expert in traps and natural hazards. He often leads the tribe through dangerous terrain and helps them avoid pitfalls and dangers. |\n| 12             | Droxas     | A Lizardfolk who has a mysterious and somber demeanor. He rarely speaks, but when he does, his words are often prophetic and deeply unsettling. |\n| 13             | Jaxith     | A Lizardfolk who has a love for music and performance. He often entertains the tribe with his songs and dances and uses his skills to coordinate the warriors during battle. |\n| 14             | Fyxax      | A Lizardfolk who has taken a vow of silence and communicates solely through sign language and gestures. Despite this, he is highly respected by the members of his tribe for his wisdom and insight. |\n| 15             | Vrynn      | A Lizardfolk who is obsessed with collecting teeth and bones from animals and creatures he has defeated. He uses his collection to create intricate and unsettling jewelry. |\n| 16             | Jyxx       | A Lizardfolk who is deeply religious and spends much of his time meditating and performing religious rituals. He is revered by his tribe for his connection to the divine. |\n| 17             | Baxun      | A Lizardfolk who is known for his impressive physical strength and endurance. He is often called upon to perform heavy labor and to carry the tribe's heaviest weapons and armor. |\n| 18             | Zyxth      | A Lizardfolk who is a skilled craftsman and armorer. He creates the tribe's weapons and armor and is highly respected for his workmanship. |\n| 19             | Crixith    | A Lizardfolk who is an expert in herbalism and potion-making. He often creates antidotes and healing potions for the tribe and is highly valued for his knowledge. |\n| 20             | Yxax        | A Lizardfolk who is a powerful and respected warrior. He is often called upon to lead the tribe into battle and is feared by his enemies for his strength and ferocity. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Races",
        "Aarakocra",
        "Aasimar",
        "Bugbear",
        "Changeling",
        "Dragon",
        "Dragonborn",
        "Drow",
        "Duergar",
        "Dwarves",
        "Elves",
        "Genasi",
        "Gnomes",
        "Goblin",
        "Goliath",
        "Half-Elves",
        "Half-Orcs",
        "Halflings",
        "Hobgoblin",
        "Human",
        "Kobold",
        "Lizardfolk",
        "Orcs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}