{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "5e Rolltables",
  "description": "Prompt generated entities from ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n| D20 Roll | Mishap |\n|----------|---------|\n| 1 | You stumble and momentarily lose sight of your enemy. Any attacks against you have advantage until your next turn. |\n| 2 | You accidentally strike a nearby object, causing your weapon to bounce back towards you. Make a DC10 Dexterity save or take weapon's damage. |\n| 3 | Your weapon slips from your grasp. Roll a D6. On a 1-3, it lands 10 feet away from you in a random direction. On a 4-6, it lands at your opponent's feet. |\n| 4 | You swing so wide, you pivot a full circle on the spot, leaving you disoriented. You are stunned until your next turn. |\n| 5 | You throw your balance off, causing you to fall prone. |\n| 6 | Such a wild swing! The impact shatters your weapon, rendering it unusable. |\n| 7 | You expose a vulnerability in your attack. The next attack against you has advantage. |\n| 8 | Your fury gets the best of you. You use your bonus action to make another attack, but this one is made at disadvantage. |\n| 9 | A misstep makes you slip. Your movement is reduced by half until your next turn. |\n| 10 | The world spins as you lose your balance. You are considered to be under the effects of the Confusion spell until your next turn. |\n| 11 | Your attack is such a whiff, it throws you off-guard. You cannot make AoOs until your next turn. |\n| 12 | You overexert yourself, take 1 level of exhaustion. |\n| 13 | You strike the surface unintentionally, causing a cloud of dust to temporarily blind you. You are blinded until your next turn. |\n| 14 | Your weapon gets momentarily stuck in the surface. Your next round action must be used to free it. |\n| 15 | You trip and scatter your equipped inventory around you. You must spend your next turn retrieving your items. |\n| 16 | Misjudging your own strength, you rip a muscle. You have disadvantage on Strength checks and saves until you finish a short rest. |\n| 17 | Your swing comes so close to your enemy that you clip them. They can use their reaction to make a melee attack against you. |\n| 18 | You miscalculate your swing massively, causing you to lose your grip. Your weapon flies 10 feet in a random direction. |\n| 19 | Your unwieldy swing elicits a painful cramp. You have disadvantage on your next attack roll. |\n| 20 | You stumble badly on some debris. You must make a DC10 Dexterity save or fall prone in a prone square adjacent to the obstacle. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Melee"
    },
    {
      "rawText": "## Ranged\r\n| d20 Roll | Ranged Attack Mishap |\n| -------- | -------------------- |\n| 1        | The string or trigger mechanism on your weapon snaps, rendering it useless until repaired. | \n| 2        | The force of the shot twists in your hand, causing you to drop your weapon at your feet. |\n| 3        | Your weapon discharges early, the sound alerts enemies of your location and gives them advantage on their next attack. |\n| 4        | The recoil of the weapon causes you to lose your footing and you fall prone. |\n| 5        | The shot goes wild and hits an unintended target, maybe an ally or a harmless piece of environment. |\n| 6        | The ammunition you were using was defective and shatters inside your weapon, damaging it. |\n| 7        | The shot ricochets back towards you, make a Dexterity saving throw to avoid getting hit. |\n| 8        | Whether by wind or miscalculation, your shot veers off so badly it completely misses the combat arena. |\n| 9        | The force of the shot strains your arm, causing numbness. You have disadvantage on your next attack. |\n| 10       | Misjudged power sends the shot into the ground at your feet, kicking up debris and blinding you until the end of your next turn. |\n| 11       | Your shot distracts an ally, causing them to lose concentration on any ongoing spells. |\n| 12       | Your wild shot hits an object or part of the environment, causing it to collapse or change the field in some way. |\n| 13       | You accidentally ignite any flammable material in your vicinity. |\n| 14       | You miscalculate your range, leaving you vulnerable to an opponent's attack. |\n| 15       | You strain too hard during the shot and pull a muscle, taking 1d4 damage. |\n| 16       | Opponents take advantage of the delay in your attack, they move 10 ft without provoking opportunity attacks. |\n| 17       | Your attack hits a reflective surface and bounces back at you. An attack roll is made against you. |\n| 18       | The attack careens wildly, hitting random objects and creating a hazardous environment. |\n| 19       | Your weapon jams or malfunctions in some way, requiring a full round to unjam or repair. |\n| 20       | The force of your launch breaks your weapon into pieces. It is destroyed, and can only be replaced, not repaired. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| D20 Roll | Arcane Attack Mishap |\n| -------- | --------------------- |\n| 1 | You rebound your spell onto yourself, taking the intended damage.\n| 2 | You lose control of the magic, causing a random magical effect (use the Wild Magic Surge table). \n| 3 | Your arcane energies backfire, giving you a level of fatigue. \n| 4 | The overwhelming force of your failure causes you to be prone. \n| 5 | The spell fizzles and you lose an additional spell slot of the same level. \n| 6 | A surge of magic pushes your target 10 feet away from you without causing harm.\n| 7 | The spell is delayed. It will misfire in the same spot in the next round.\n| 8 | Your spell affects a random target within range.\n| 9 | You are momentarily blinded by your own spell backlash until the end of your next turn. \n| 10 | The spell mishap causes you to be deafened for 1 minute.\n| 11 | Your arcane failure leaves you vulnerable, reducing your AC by 2 until your next turn.\n| 12 | Instead of the intended spell, a harmless puff of smoke billows out from your fingertips.\n| 13 | Your mishap creates a loud booming noise audible within 100 feet.\n| 14 | The magic arcs to a non-magical item in your possession, rendering it useless.\n| 15 | You cast the spell, but at its minimum power level.\n| 16 | The backfire dazzles you: disadvantage on all ability checks for the next round.\n| 17 | Your arcane mishap attracts the attention of a nearby creature, hostile or not.\n| 18 | The magic backlash leaves you silenced for 1 minute, unable to cast spells with a verbal component.\n| 19 | The arcane energies cause a 10-foot radius of difficult terrain centered on you.\n| 20 | The spell energy ricochets off, causing the light level within 30 feet of you to decrease by one step for 1 hour.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Arcane"
    },
    {
      "rawText": "## Melee\r\n| d20 Roll | Critical Success Boon |\n|----------|----------------------|\n| 1. | Your attack opens up a weak spot, granting advantage to the next ally who attacks this enemy. |\n| 2. | Your strike destabilizes your opponent, reducing their speed to half for one round. |\n| 3. | Your hit is so powerful it knocks the weapon out of your enemy's hand. |\n| 4. | Your precision strike disorientates the enemy, causing them to skip their next bonus action. |\n| 5. | Your attack causes your enemy to stagger backwards, provoking an opportunity attack from a nearby ally. |\n| 6. | Your forceful blow knocks the enemy prone. |\n| 7. | You perform a perfect cut, causing your enemy to bleed and take 1d4 damage at the start of its next turn. |\n| 8. | Your strike causes the enemy to be frightened until the end of your next turn. |\n| 9. | Your devastating attack shocks the enemy, causing them to miss their next reaction. |\n| 10. | Your attack causes extra damage equal to your level. |\n| 11. | Your weapon hit shatters the enemy's defense, reducing their AC by 1 until their next turn. |\n| 12. | Your powerful strike forces the enemy to lose their concentration. |\n| 13. | Your blow is precise, hitting the enemy's vitals and dealing ongoing 1d6 damage for the next three turns. |\n| 14. | You drive your enemy back, pushing them 10ft away from you. |\n| 15. | Your hit damages the enemy's gear, causing a disadvantage on their next attack roll. |\n| 16. | Your attack intimidates nearby enemies, giving them disadvantage on their next attack rolls. |\n| 17. | The power behind your strike temporarily blinds the enemy until the start of the enemy's next turn. |\n| 18. | With a swift move, you disarm the enemy. |\n| 19. | Your strike breaks the enemy's guard, leaving them stunned until the end of their next turn. |\n| 20. | Your devastating hit energizes you, restoring 1d8 hit points. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Melee"
    },
    {
      "rawText": "## Ranged\r\n| Roll (D20) | Boon Due to Critical Ranged Attack Success |\n| --- | --- |\n| 1 | The arrow/bolt finds a weakness in the enemy's armor, reducing their AC by 2 for the rest of the combat. |\n| 2 | Your missile ricochets, striking an additional enemy within 10 feet of the original target for half damage. |\n| 3 | The force of your hit disarms your opponent, their weapon flies 10 feet away in a random direction. |\n| 4 | You hit a vital organ causing bleed damage. The enemy takes an additional 1d6 damage at the start of their turn until it gets healed. |\n| 5 | The impact of your projectile knocks the enemy prone. |\n| 6 | Your aim is terrifyingly precise, causing the enemy to become frightened until the end of your next turn. |\n| 7 | The projectile pierces through the target hitting another enemy in line with the first one. Roll another attack for the second target, this hit can't crit. |\n| 8 | Your shot distracts the enemy at the perfect moment, providing advantage to the next ally who attacks them. |\n| 9 | You're so quick to nock and loose another arrow that you can make an additional attack this round. |\n| 10 | The arrow/bolt hits the target so hard that it is pushed back 10 feet away from the impact. |\n| 11 | You stun your enemy with the impact. They lose their next reaction. |\n| 12 | The enemy is so shocked by your attack that they suffer disadvantage on their next attack roll. |\n| 13 | Your target drops any item they hold as your shot numbs their hand. |\n| 14 | Your shot lands exactly as you planned. You regain your highest level expended spell slot or a superiority die. |\n| 15 | Your projectile impacts with such force that the target is unable to move until they pass a strength saving throw (DC 15) on their turn. |\n| 16 | Your attack has such a demoralizing effect on enemies that they suffer disadvantage on saving throws until end of your next turn. |\n| 17 | Your shot strikes a pressure point causing intense pain. The target suffers disadvantage on skill checks until it receives healing. |\n| 18 | Your shot puts you in a commanding position, giving you an additional reaction until the start of your next turn. |\n| 19 | The sight of your talent inspires your allies. The next attack roll made by each ally has advantage. |\n| 20 | Your attack is a display of sheer perfection. Your target has disadvantage on attack rolls against you until end of your next turn. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| d20 | Boon from a Critical Arcane Success |\n| --- | ---------------------------------- |\n| 1   | Your spell is so perfectly cast that it doesn't consume a spell slot. |\n| 2   | The target of your spell is dazed, suffering disadvantage on their next turn. |\n| 3   | Your spell's duration, if it has one, is doubled. |\n| 4   | The area of effect of your spell increases by 50%. |\n| 5   | The damage of your spell is maximized, not just doubled. |\n| 6   | The target of your spell drops everything it is holding. |\n| 7   | Any allies near the spell's target gain temporary HP equal to the spell's level. |\n| 8   | The target of your spell is knocked prone. |\n| 9   | Your spell is silent and does not require verbal components. |\n| 10  | Your spell does not require material components, if it did before. |\n| 11  | The intensity of your spell frightens enemies, forcing a Wisdom saving throw or become frightened. |\n| 12  | An echoed force of the spell lingers on the target, causing it to reapply half the initial damage at the end of its next turn. |\n| 13  | You instantly comprehend and memorize the true name of the target, useful in future spellcasting. |\n| 14  | You can immediately teleport up to 30 ft away after casting the spell, without consuming a spell slot. |\n| 15  | The spell's effect also replicates a cantrip of your choice. |\n| 16  | Residual energy shields you, granting advantage on your next saving throw. |\n| 17  | A shimmering phantom version of your incantation circles you, granting you +2 to AC until your next turn. |\n| 18  | Buffets of force from your spell push enemies within 10 ft, forcing a Strength saving throw or be pushed back 10 ft. |\n| 19  | Your spell illuminates the battlefield, nullifying the effects of low light or darkness in a 20 ft radius. |\n| 20  | Echoes of your power surge through you, your next spell of 1st level or higher cast within the next minute is increased by one spell level. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name        | Description                                                                              |\n|------------|-------------|------------------------------------------------------------------------------------------|\n| 1          | Windcaller  | An insightful Aarakocra healer known for her calming songs and wisdom                    |\n| 2          | Cloudskipper| An adventurous Aarakocra scout who’s spent his life exploring the world from above        |\n| 3          | Raindancer  | A charismatic Aarakocra bard skilled in the dance of his tribe                           |\n| 4          | Stormbeak   | A gruff Aarakocra fighter whose sharp beak and talons are matched by his strategic mind  |\n| 5          | Sunplume    | An Aarakocra monk studying the Fluid Motion school of martial arts                       |\n| 6          | Firesinger  | An imaginative Aarakocra sorcerer with an affinity for fire magic                        |\n| 7          | Stoneclaw   | A dedicated Aarakocra artisan renowned for his beautifully detailed carvings             |\n| 8          | Icefeather  | A reclusive Aarakocra wizard studying the arcane secrets of ice magic                    |\n| 9          | Thunderwing | A respected Aarakocra chieftain known for his thunderous battle cries                    |\n| 10         | Moonshadow  | An elusive Aarakocra rogue who moves as silently as a shadow across the moonlit sky       |\n| 11         | Dimlight    | A wise Aarakocra sage with knowledge that reaches far beyond her years                   |\n| 12         | Swiftwind   | A young, restless Aarakocra ranger eager to prove himself on the hunt                    |\n| 13         | Sunspark    | A cheerful Aarakocra cleric who worships a sun deity                                     |\n| 14         | Darkfeather | Once an ordinary Aarakocra, he now practices warlock magic after a deal with a dark entity|\n| 15         | Snowpeaks   | A hardy Aarakocra from a cold mountain range, accustomed to harsh weather conditions     |\n| 16         | Galeswooper | A vigilant Aarakocra sentinel who guards the nest from threats                           |\n| 17         | Starwatcher | An Aarakocra astronomer whose eyes are usually turned towards the stars                   |\n| 18         | Brighteye   | A particularly perceptive Aarakocra scout with excellent eyesight                         |\n| 19         | Stormcaster | An Aarakocra druid who calls upon the power of the storm with her magic                   |\n| 20         | Skydancer   | A jovial, light-hearted Aarakocra bard known for his breathtaking aerial dances           |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n|------------|-------|-------------|\n| 1 | Iridius | An Aasimar cleric with silvery hair and radiant eyes, dedicated to the god of light. |\n| 2 | Seraphina | A tall and stern Aasimar paladin, possessed by the spirit of an otherworldly warrior. |\n| 3 | Uriel | A wise and noble Aasimar bard who brings tales from far-off lands. |\n| 4 | Haloa | A mild-mannered Aasimar druid with a deep connection to celestial wilds. |\n| 5 | Celestia | A charismatic Aasimar sorcerer who channels raw celestial power. |\n| 6 | Galileo | A cryptic Aasimar warlock who negotiates with celestial entities. |\n| 7 | Angelos | A brave Aasimar ranger who guides travelers through dangerous lands. |\n| 8 | Elara | A complex Aasimar rogue operating under the guidance of a divine being. |\n| 9 | Orion | A calm and measured Aasimar monk, disciplined in celestial ways. |\n| 10 | Valeria | A skilled Aasimar fighter whose weapon glows with divine light. |\n| 11 | Lysithea | An Aasimar wizard who has studied celestial spells from ancient texts. |\n| 12 | Apollo | A charismatic Aasimar bard, his songs tell of divine interventions. |\n| 13 | Selene | A dutiful Aasimar cleric who has dedicated her life to healing the hurting. |\n| 14 | Eos | A lively Aasimar ranger known to guide lost souls through perilous terrain. |\n| 15 | Nyx | A mysterious Aasimar rogue, who uses divine blessings to remain unseen. |\n| 16 | Helios | A diligent Aasimar paladin, protected by a divine shield of light. |\n| 17 | Astraea | A compassionate Aasimar druid, she uses celestial energy to nurturer nature. |\n| 18 | Orion | A noble Aasimar monk, his movements echo the constellations above. |\n| 19 | Caelum | An Aasimar wizard, his spells bring celestial might into corporeal form. |\n| 20 | Solaria | A headstrong Aasimar sorcerer, her magic is a blazing testament to her celestial heritage. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Kralk Throatrend | Skilled bugbear warrior hardened by many battles, has a large scar across his throat |\n| 2 | Jagar Cragjaw | Wears a necklace of orc teeth, known for his bellowing war cry |\n| 3 | Urgol Bloodmaul | Wields a large, bloodstained maul in battle. Tends to solve all problems with violence |\n| 4 | Gnarh Wildmane | A competent herbalist, disguises himself in nature despite his huge frame |\n| 5 | Throm Axe-Ear | Missing a chunk of ear, cut off in a battle with dwarves. Wields a large greataxe |\n| 6 | Grurk Lorekeeper  | Elder bugbear, highly respected, keeper of tribe's history and rituals |\n| 7 | Vorkal Beasttamer | Has a trained worg as a pet and hunting partner |\n| 8 | Kruk Strongback | Burden bearer of the tribe, carries heavy loot and supplies |\n| 9 | Arkosh Longshadow | Elusive bugbear rogue, adept at moving unseen and unheard |\n| 10 | Tsork Windwhisper | A scout known for his keen senses, able to detect intruders from a great distance |\n| 11 | Gart Bonecrusher | A feared bugbear chieftain known for his cruelty |\n| 12 | Kraka Earthshaker | A charismatic bugbear leader, loved by his tribe |\n| 13 | Urg Rockhurler | An unerring aim with a boulder has earned him his place in the tribe |\n| 14 | Zork Stalker | Expert hunter, often ventures beyond the territory alone |\n| 15 | Grumish Flameeye | Lost an eye to a wizard's fire spell, now hates all magic- users |\n| 16 | Borsh Skullsmasher | Always the first into battle, wears the skulls of his slain enemies |\n| 17 | Nargal Hexweaver | Strange and feared, believed to have the power to curse his enemies |\n| 18 | Drukar Thundercall | Powerful bugbear shaman, can 'call' to the spirits of weather |\n| 19 | Tsarg Ragetongue | Known for his blistering tirades, he can demoralize enemies before fighting |\n| 20 | Mork Daggerclaw | A feared assassin, wears gauntlets tipped with sharp blades as his signature weapon |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n| Dice Value | Name | Description |\n|---|---|---|\n|1.|Me'ira| A middle-aged changeling with hollow, empty eyes. Known for their cold efficiency in getting tasks done.|\n|2.|Finris| A young unassuming changeling. Their appearances are mostly simple and non-descript, helping them blend in crowds.|\n|3.|Eldin| An old, seasoned changeling with a hard, unchanging face that shows the scars of many years of espionage.|\n|4.|Ailani| An introverted changeling, often found alone. Tends to maintain a form of an elderly, bespectacled scholar with thinning hair.|\n|5.|Jaellyn| A changeling with an irregular twitch in their form, suggesting a past trauma. Usually mimics a reviled outcast.|\n|6.|Yorden| A young, enthusiastic changeling. Prefers forms of lively, vibrant characters with lots of jewelry. |\n|7.|Tharia| A thoughtful, observant changeling, who mostly dons the form of a rotund, friendly innkeeper, but switches faces with remarkable fluidity when needed.|\n|8.|Ilienne| A middle-aged changeling with an artsy vibe. They are mostly seen shape-shifted into a wandering bard.|\n|9.|Belisar| A changeling mercenary, seen in many forms, but mostly as a grizzled veteran soldier bearing the marks of many battles.|\n|10.|Gallyan| A changeling with a preference for forms of authority figures - guards, commanders, and nobility. |\n|11.|Olura| A young female changeling, has a fondness for assuming the forms of children to pass unnoticed.|\n|12.|Maridon| An older changeling, often seen posing as a skilled craftsman or a shopkeeper.|\n|13.|Danomir| A changeling that prefers to take on menacing forms to intimidate others. Often assumed form of a battle-hardened orc.|\n|14.|Estelle| A studious changeling, known to turn into scholarly figures. They take their jobs very seriously.|\n|15.|Ursylon| A stern, quiet changeling. They are less likely to change forms, preferring the form of a stern, neutral commoner.|\n|16.|Harley| Young and unpredictable, Harley prefers to take on the form of wild, feral creatures.|\n|17.|Vanra| Vanra prefers delicate and beautiful forms, often changing into dancers or performers.|\n|18.|Casimir| An old changeling who is often seen in the form of a wise old man or a decrepit beggar.|\n|19.|Talyssa| Reserved and calculated, Talyssa usually appears as a dignified noblewoman.|\n|20.|Zephyr| A crafty changeling known for appearing as different members of the same family or group.|\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Airthax | An ancient and proud gold dragon, Airthax carries himself with the dignity and gravity befitting his age. |\n| 2 | Brenzalth | Brenzalth, a ruby dragon, is known for her meticulous record keeping and knowledge of historical events. |\n| 3 | Crystalfire | A young and curious sapphire dragon, Crystalfire can often be found exploring ruins and hoarding relics. |\n| 4 | Drakendros | Known for his tactical prowess, Drakendros, a black dragon, is a respected figure in dragon society. |\n| 5 | Ebonclaw | A blue dragon, Ebonclaw has a fierce reputation and is known to be a ruthless opponent in battle. |\n| 6 | Firewing | Firewing, a brass dragon, has a burning passion for knowledge and has devoted many centuries to its pursuit. |\n| 7 | Gormael | This gargantuan silver dragon, Gormael, is renowned for his wisdom and clarity of thought. |\n| 8 | Haldryn | Haldryn, a bronze dragon, is a shrewd negotiator and uses this skill to maintain peace among local dragon factions. |\n| 9 | Ironflame | A powerful iron dragon, Ironflame is a respected leader known for his just and fair ruling. |\n| 10 | Jaxyrith | Famous for her intimidating presence, Jaxyrith, a cobalt dragon, instills both fear and respect in all who encounter her. |\n| 11 | Krystalnath | An emerald dragon, Krystalnath is valued for his confidential advice and elusive ability to predict future events. |\n| 12 | Pyrophor | Pyrophor, a blazing red dragon, is an awe-inspiring presence who commands respect with his vast knowledge of arcane lore. |\n| 13 | Qintarra | Agile and cunning, Qintarra, a shadow dragon, is a master spy, often infiltrating other dragon territories to learn their secrets. |\n| 14 | Rimefrost | Rimefrost, a white dragon, is known to be a solitary creature, living in icy isolation and shrouded in a cloud of cold mystery. |\n| 15 | Stormbellow | Stormbellow, a storm dragon, possesses the ability to summon thunderstorms and uses this power to awe and intimidate. |\n| 16 | Thunderfury | Thunderfury, an electric dragon, is larger than life, exuding confidence and power. |\n| 17 | Ulthion | This mist dragon, Ulthion, is a renowned sage who spends most of his time amidst the clouds, contemplating cosmic truths. |\n| 18 | Volcanix | Volcanix, a robust magma dragon, commands the respect of others through his near unparalleled physical strength. |\n| 19 | Wyrmshadow | Known for his stealth and cunning, Wyrmshadow, a void dragon, is considered a dangerous adversary. |\n| 20 | Xarion | Xarion, a celestial dragon, is respected throughout the dragon world for his wisdom and nobility. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Thava Brightscale | A stern cleric of Bahamut, Thava is knowledgeable in matters of the divine. Her scales are a lustrous gold. |\n| 2 | Rynthar Frostclaw | Rynthar is a reserved dragonborn warrior. His white scales resemble freshly fallen snow, matching his cold demeanor. |\n| 3 | Torinn Ironshell | A blacksmith by trade, Torinn's scales mirror the charred metal he works with. He has a no-nonsense approach to life. |\n| 4 | Arjhan Embermantle | A fiery red-scaled sorcerer with an equally fiery temper, Arjhan can be quick to anger but is fiercely loyal. |\n| 5 | Ghesh Goldheart | A reclusive scholar, Ghesh's green scales are always hidden behind heavy robes. His pursuit of knowledge is relentless. |\n| 6 | Sora Sunbrand | An ambassador blessed with radiant orange scales, Sora has an imposing presence in any diplomatic negotiation. |\n| 7 | Zephon Darkwind | A stealthy rogue with sable scales, Zephon never stays in one place for long and is known for his silent moves. |\n| 8 | Inthar Bluemoon | A ranger whose scales resemble the color of the high seas, Inthar is a skilled hunter and a stoic companion. |\n| 9 | Vorjhan Shadowflame | A deceptive bard who uses his charming words to mesmerize his audience, Vorjhan's scales shimmer with purple haze. |\n| 10 |  Azha Silvertongue | Azha is a silver-scaled dragonborn with a natural gift for languages and a diplomatic tact. |\n| 11 | Qalthus Magmafist | A ferocious fighter whose scales glow like living ember, Qalthus is feared in battle for his vicious blows. |\n| 12 | Kreel Dustwalker | Kreel is a stoic and solitary wanderer. His pale, almost grey scales tell stories of his travels through harsh lands. |\n| 13 | Irthos Icefang | A stoic and diligent guard, Irthos's icy blue scales blend with the winter landscape of his homeland. |\n| 14 | Nerix Steamwing | Steadfast and rigorous, Nerix is a seasoned warrior. Despite being wingless, his scales carry the shimmering hue of steam's mystique. |\n| 15 | Tyaprin Quickwater | An agile and water-loving dragonborn. His bright blue scales reflect the freshwater streams he loves to inhabit. |\n| 16 | Faelar Windvein | A silver dragonborn scholar specializing in history. Stoic and strictly disciplined, he values knowledge above all. |\n| 17 | Rixwar Earthhorn | A stone-like, solid dragonborn who is seasoned in land-based combat maneuver. His scales match the rocky terrains he thrives in. |\n| 18 | Korth Tempestwake | An azure scaled dragonborn and skillful sailor, Korth's life has forged him into a serious and unyieldingly resilient character. |\n| 19 | Ysarix Stormheart | A broker with a noble aura. Ysarix's platinum scales mirror his wealthy, yet severe disposition. |\n| 20 | Heraxus Skyshroud | An elusive rogue with mysterious charm. Characters find his dark scales intimidating and his gaze piercing. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Izziryn Xiltyn | This tall, quiet drow is the matron's advisor and known for his ruthless tactics. |\n| 2 | Neerza Zauviir | A drow priestess, well-known for her skill in manipulating shadows to her advantage. |\n| 3 | Saphyl Baenre | A cunning rogue, always found lurking in the shadows and eavesdropping on others. |\n| 4 | Pelaubryt Mizzrym | An esteemed drow warrior loyal to his house, bearing numerous battle scars. |\n| 5 | G'eldreth T'sarran | An unsociable drow scholar. He spends most of his time studying ancient drow lore. |\n| 6 | Filraen Melarn | A feared drow assassin who always has a sinister smile on his lips. |\n| 7 | Sabal Xorlarrin | A charismatic drow merchant, shrouded in luxurious silks, always striking a hard bargain. |\n| 8 | Liazmyne Do'Urden | A muscular drow warrior maiden, silent and reserved, revered for her deadly combat skills. |\n| 9 | Xhalth Barrae | This suspicious drow mage sequesters himself studying dark magical arts. |\n| 10 | Rizzen Duskryn | A tall, imposing drow, he’s a renowned swordmaster who never wastes his words. |\n| 11 | Khalazza Dalael | A soft-spoken drow healer known for her gentle demeanour and warm smile. |\n| 12 | Kendrak Kizzt | A world-weary drow ranger, his stern gaze carries an untold tale of sorrow. |\n| 13 | Nym Maelra | A dusky-skinned drow enchantress, feared and respected for her ability to manipulate minds. |\n| 14 | Jezdyn Ched'Nasad | A jaded drow diplomat, known for his shrewd negotiations and silver tongue. |\n| 15 | Tazmyra Rilyntl | A graceful drow dancer, her performances are as mesmerising as they are rare. |\n| 16 | Bael'Veiz Kluthrael | A stoic drow blacksmith, he is known for crafting the finest weapons in the underdark. |\n| 17 | Vie'yara Sargtlin | The young drow is an apprentice alchemist, constantly curious and ever experimenting. |\n| 18 | Zilvrae Zolond | A stalwart drow guard, she watches her post with an unwavering eye and a steady hand. |\n| 19 | Faeryl Noquar | An elderly drow lore master, her wisdom and knowledge is sought by many. |\n| 20 | Phaeqlyja Ousstyl | A drow sorceress, silent and ominous, her magic is as dangerous as it is unpredictable. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Kildrak Frostbeard | A battle-hardened warrior with ice-blue eyes and a frost-covered beard. His grim demeanor matches his grim past. |\n| 2 | Garunna Deepsorrow | An aged cleric, her eyes full of sorrow, burdened with the pain and loss she has seen in her long life. |\n| 3 | Durnir Boulderbreaker | A burly smith, revered for his weapon craftsmanship. Despite his gruff exterior, he possesses a keen intelligence. |\n| 4 | Thordal Shieldbiter | A reckless berserker, always eagerly rushing into the midst of battle with no thought for his own safety. Known for biting his shield in fury. |\n| 5 | Eldeth Bronzehammer | A stonemason with a heart as sturdy as the statues she crafts. As silent and steadfast as the rocks she hews. |\n| 6 | Dared Ironclaw | A venerable duergar leader known for his shrewd mind and iron resolve. His guidance sees his people through the harshest of times. |\n| 7 | Reidara Oreseeker | An efficient miner, her expert eyes can spot valuable ores in the deepest, darkest tunnels. |\n| 8 | Gormul Ghoulbane | An intense slayer, relentlessly hunting abominations that stalk the underground. His weapon always splattered with the essence of his latest kill. |\n| 9 | Dolgar Snowdrift | A scout, constantly roaming the icy caverns and freezing wastelands that surround duergar territory. His snow-white beard is emblematic of his icy domain. |\n| 10 | Freya Deepdelver | A skilled tunneler who can navigate through the underdark as one would walk a familiar street. She prefers the deep dark to surface light. |\n| 11 | Drorn Forgefire | A master blacksmith, his hands forever charred from the red-hot forge fires, but endlessly crafting tools and weapons of unsurpassed quality. |\n| 12 | Yaragra Gloomspire | A wise yet ominous sorceress, her eyes glowing with an eerie inner light due to her depth-induced madness. |\n| 13 | Norna Stoneskin | A stealthy spy who crosses into enemy lines without a ripple. Her skin, hardened by years of living under intense pressure, aids her in her missions. |\n| 14 | Borri Ironpick | A quiet miner respected for his thoroughness. His unyielding persistence has led him to unearth some of the richest veins of ore. |\n| 15 | Norena Crystalgaze | A sage with eyes like twinkling crystals, her gaze seemingly penetrating the essence of everything she looks upon. |\n| 16 | Hurdir Grimhand | A ruthless executioner, feared for his unflinching commitment to justice, no matter how grim the task. |\n| 17 | Olga Frostvein | A cold and calculating diplomat whose icy demeanor hides her fiery determination to protect her people's interests. |\n| 18 | Varnil Cavespeaker | A peculiar hermit who claims to be able to communicate with the very stone itself. Rumored to take counsel with the whispering caverns. |\n| 19 | Sarak Ironblood | A stoic guard, eternally vigilant, his iron discipline protecting his people from countless threats. |\n| 20 | Sigrid Deepshroud | A mysterious figure swathed in enigma, her place in duergar society unknown. Many fear her, as they do with all things they don't understand. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Brottor Ironbeard | Stern dwarf, has a long braided beard full of iron rings, he is a renowned blacksmith in his hold. |\n| 2 | Urist Stonehand | Hardened dwarf, both hands are solid like stone from years wielding a hammer, he is a renowned mason. |\n| 3 | Kildrak Earthshaker | Solid dwarf, a veteran of many battles who can shake the ground with his war cry, retired from the army. |\n| 4 | Durgrim Frostbeard | Reserved dwarf, with a crystalline white beard tilted downwards due to his constant work with ice and snow, he is a mountaineer by trade. |\n| 5 | Nalurin Silvervein | Greedy dwarf, he has silver threads woven into his amber beard and is always looking for the next big vein to mine. |\n| 6 | Helja Flamebraid | Unyielding dwarf woman, has bright red braids resembling flames, she is a fiercely protective tavern keeper. |\n| 7 | Fargrim Goldtooth | Gruff dwarf, never smiles except to show off his pure gold teeth, he's a direct and successful merchant. |\n| 8 | Velgar Thunderaxe | Respectable dwarf, carries a massive axe that strikes like thunder, he is an accomplished warrior and general. |\n| 9 | Hulda Earthmother | Kind dwarf matron, with dirt perpetually under her nails, she tirelessly cares for and grows the vegetation within the hold. |\n| 10 | Bolgus Deepdrinker | Stout dwarf, has a particular talent for brewing (and drinking) the richest ales, he is a popular innkeeper with many tales. |\n| 11 | Grimbold Steelheart | Brave dwarf, with a heart as unyielding as the steel he works, respected metallurgist and smith. |\n| 12 | Ysara Oresong | Calm dwarf woman, her voice echoes the depths where ores are mined, she is a revered bard and historian. |\n| 13 | Thulgar Gemeye | Keen-eyed dwarf, has a jewel encrusted monocle, he is an expert gem cutter and jeweler. |\n| 14 | Bruni Stonefoot | Steadfast dwarf, never trips or stumbles and is oddly quiet when moving, he is a dependable scout and pathfinder. |\n| 15 | Gurni Coalback | Tough dwarf, smudged with coal with a temperament as explosive as the dynamite he uses, he is an explosive expert in mining. |\n| 16 | Thrag Farstrider | Resolute dwarf, can tirelessly march longer than any of his kin, he is a seasoned explorer. |\n| 17 | Thrumli Ironstout | Robust dwarf, drinks only the strongest ales, and forged from the same iron will, he is a beloved community leader. |\n| 18 | Kelda Goldspin | Diligent dwarf woman, works the loom with golden threads, creating the richest of fabrics, she is a skilled weaver. |\n| 19 | Dwalin Mithrilbeard | Wise dwarf elder, Mithril strands are woven into his ancient beard, he is a noted scholar and sage. |\n| 20 | Hilda Ringfinger | Cautious dwarf woman, who always wears an array of rings, hosting keys to different doors and chests around the dwarf hold, she is a attentive treasure keeper. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Erevan | A stern elven archer with long silver hair and piercing green eyes, usually found patrolling the outskirts of the elven kingdom. |\n| 2 | Thamior | A serious-minded and highly regarded elven sage. He is quite elderly, with a long white beard that contrasts with his raven-black robes. |\n| 3 | Illydia | A calm, stoic elven healer, attuned with the natural world. Her long golden hair always braided with delicate flowers. |\n| 4 | Aryon | An elf ranger with a steady gaze, dedicated to preserving the wilderness from encroaching threats, always cloaked in shades of green and brown. |\n| 5 | Faelivrin | A young elf scholar with a keen interest in arcane knowledge. She has a distant look in her bright blue eyes, and is always seen carrying a large tome. |\n| 6 | Glorfindel | An experienced elven warrior, with scars marring his former beauty demonstrating the price of defending his home. |\n| 7 | Lireal | An elven blacksmith known for her quiet personality and her stunning silver armours that mirror moonlight. |\n| 8 | Thalion | A talented elf minstrel, his serious demeanor belies the haunting melody of his lute, bringing solace to many. |\n| 9 | Elewen | A respected elf druid, always seen with an owl perched on her shoulder. She has a deep connection to the ancient trees of the forest. |\n| 10 | Arannis | A skilled elf blade dancer, his complex routines a spectacle of deadly precision, embodying steadfast dedication to martial discipline. |\n| 11 | Galadriel | A noble elven queen, ruling her realm with impartial justice, her silver crown resembling starlight. |\n| 12 | Daeris | A solemn elf monk, withdrawn from everyday affairs, his existence devoted to spiritual growth and tranquility. |\n| 13 | Maelis | An elf sorcerer known for his serious expression and the arcane energy that crackles in his indigo eyes. |\n| 14 | Althea | A reserved elf cleric of the Moon Goddess, tending to the sick and injured, a beacon of quiet certainty. |\n| 15 | Loriel | An elf bard known for her sorrowful ballads. She carries the collective grief of her kin in her hypnotizing, sad tunes. |\n| 16 | Calen | The elf captain of the guard, his stern eyes have seen much, leading his team with a serious-minded dedication. |\n| 17 | Miriel | The elven librarian, a scholar dedicated to the preservation of knowledge, her ink-stained fingers tell the tales of countless scrolls. |\n| 18 | Elebrin | A serene elf sculptor, his works evoking the ethereal beauty of nature imbued with profound melancholy. |\n| 19 | Velaris | A watchful elf scout, his hawk-like eyes miss nothing as he navigates the borders of the elf kingdom. |\n| 20 | Seraphina | A composed elf envoy, her diplomatic skills crucial in maintaining peace between the elven realm and their neighbours. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Tharivol | An Earth Genasi arms dealer with stony skin and dark, penetrating eyes. His voice is deep and gravelly. |\n| 2 | Haela | A Water Genasi sailor with clear blue skin, who is always slightly damp to the touch. She has a calm, measured demeanor. |\n| 3 | Eriond | A Wind Genasi bard with skin resembling a cloud-filled sky, he is as restless and whimsical as the breeze. |\n| 4 | Zephyra | A Wind Genasi with skin like a crisp fall breeze and wild, untamed white hair, always eager for the next adventure. |\n| 5 | Pyrrhus | A Fire Genasi blacksmith, his body resembling molten lava. His temper is as hot as the fires he works with. |\n| 6 | Korlann | An Earth Genasi, who is a stoic and reliable captain of the city guard. Skin resembling jagged stone. |\n| 7 | Aquara | A Water Genasi healer with a fluid and tranquil nature. Her skin shimmers like water reflecting sunlight. |\n| 8 | Nrakk | An Air Genasi scholar whose skin has the appearance of a swirling thunderstorm. His knowledge is as vast as the sky. |\n| 9 | Ardere | A Fire Genasi sorcerer whose body flickers of dancing flames. Fierce, passionate, and unpredictable. |\n| 10 | Petra | An Earth Genasi gardener, her skin looks and feels like fertile soil. She seldom speaks, preferring the company of plants over people. |\n| 11 | Vezran | A Water Genasi trapper with a flowing, ever-changing form. Silent and stealthy as a coursing river. |\n| 12 | Dwindl | An Air Genasi messenger with skin resembling a gentle breeze. Always on the move, delivering messages with the speed of the wind. |\n| 13 | Emberlyn | A Fire Genasi warrior, her crackling, radiant body matches her fiery spirit. |\n| 14 | Onyxa | An Earth Genasi architect with a sturdy, stone-like physique. She designs buildings that are as solid and enduring as she is. |\n| 15 | Eddard | A Water Genasi fisherman with a cool, calm demeanor. His deep-sea eyes harboring a sea of patience. |\n| 16 | Galea | An Air Genasi poet with skin that looks like a gentle wind-gust. Her words are as elusive and fleeting as zephyrs. |\n| 17 | Fyran | A Fire Genasi chef whose fiery body does not simply cook food but forges culinary masterpieces. |\n| 18 | Tundrik | An Earth Genasi miner with skin resembling rough hewn ore. His strength and resilience peers through his silent demeanor. |\n| 19 | Mirali | A Water Genasi fortune teller. Her skin appears to have the depth of the ocean. Her readings are often mysteriously accurate. |\n| 20 | Breeza | An Air Genasi monk, her skin resembling a softly flowing mountain breeze. Despite her ethereal appearance, her resolve is firm and unwavering. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| Dice Value | Name | Description |\n| --------- | --------- | -------- |\n| 1 | Thranrick Copperpot | A grim gnome, once a skilled metallurgist, now spends his days brooding in solitude. Has a distinct scar on his left cheek.  |\n| 2 | Belinda Knotem | A stoic historian gnome, she devotes her time to recording the realities of gnome history. Wears glasses with thick lenses. | \n| 3 | Bolwin Tinkerspell | Renowned as a serious potion master among gnomes, this gnome is highly respected but has a cold demeanor. Carries a satchel full of vials. |\n| 4 | Glinwerd Belltop | A reclusive gnome mage, known for his intense focus on research. Always seen with a staff studded with runes. |\n| 5 | Nissa Quickshadow | A quiet gnome rogue, not much is known about her past. Always shrouded in dark clothing. |\n| 6 | Yorri Weldgrind | A disciplined gnome soldier who seldom smiles, burdened with tales of war. Wears a well-polished armor. |\n| 7 | Delryn Spindlethumb | A gnome known for his aptitude in clockwork. His piercing gaze is as sharp as his mind. |\n| 8 | Avina Dewwhisper | A reserved gnome druid, she is more at home among nature than fellow gnomes. Always accompanied by a white rabbit. |\n| 9 | Kaddoc Sparkgazer | A theoretical astrologer gnome who is always lost in thought. Has distinct white hair due to a failed experiment. |\n| 10 | Rachelle Quillshade | A stern librarian gnome who guards the ancient gnome texts. Adorned with a cloak that is as dusty as the books she protects. |\n| 11 | Doric Flintnose | A gnarled and gruff blacksmith gnome. His expression as hard as the metals he works with. |\n| 12 | Euphie Twistlock | A tailor gnome known for her practical designs. Few have seen her smile. |\n| 13 | Boddynock Wobblegear | An engineer gnome who has spent years perfecting his craft. His spectacles are always smeared with grease. |\n| 14 | Neva Featherfoot | A serious gnome courier, swift and trustworthy. A tatoo of a winged foot is visible on her arm. |\n| 15 | Eldon Hammershod | A gnome mason with a responsibility towards his community's structures. His serious demeanor is as solid as stone. |\n| 16 | Dagna Brushboot | A reserved gnome cartographer mapping the known and unknown. Always found with a compass and paper. |\n| 17 | Trilda Zincfen | An alchemist gnome bent on discovery. Always accompanied by the scent of strange chemicals. |\n| 18 | Foddik Gearbleat | A gnome who breeds and trades mechanical pets. Rarely speaks unless to close a deal. |\n| 19 | Jory Deepdelve | A serious miner gnome, his cough tells a story of years spent in the dwarven mines. |\n| 20 | Sanda Mistrunner | An ever watchful gnome ranger. Her quiet demeanor is a front for her precise observations. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name  | Description |\n|---|---|---|\n| 1 | Grizlak the Cunning  | A goblin tactician, drafter of countless ambush plans for his clan. He has a piercing gaze and sharp fangs. |\n| 2 | Snaggle the Fierce | A seasoned goblin warrior, his scarred body a testament to many battles won. Always seen with a rusty cleaver. |\n| 3 | Jabbok the Quiet | A goblin scout, his ability to move like a shadow makes him a valuable asset to his clan. Wears a cloak stitched from crow feathers. |\n| 4 | Slurp the Vile | This goblin shaman of a foul god reeks of decay and wields dark magics. Cackles madly in the heat of battle. |\n| 5 | Zognak the Greedy | Zognak is the chubby leader of his clan, his greed evident in the trinkets he constantly collects. He's particularly fond of shiny coins. |\n| 6 | Mogg the Broken | Left for dead and with a mangled leg, Mogg's survival instincts pushed him to become a skilled alchemist and trap maker. |\n| 7 | Piztik the Sly | The goblin thief, Piztik, is small even among his brethren, but makes up for it with his nimble fingers and slick wit. |\n| 8 | Klack the Mute | Klack cannot speak, but his skills in tracking and archery say more than words ever could. He understands all, but communicates only through gestures. |\n| 9 | Splug the Ironskin | This unique goblin has developed a skin as hard as iron due to some arcane experiment. Splug is clumsy but immensely strong. |\n| 10 | Torek the Spotted | Named for his unusual, spotted skin condition, Torek is an outcast who has honed his abilities in isolation. He is an accomplished survivalist. |\n| 11 | Zik the Howler | This goblin bard is known for his terrible, shrieking songs. His clanmates say he can shatter glass with his voice. |\n| 12 | Nettle the Pious | Nettle, a religious goblin, values tradition and order above all else. She's decorated with several religious symbols and talismans. |\n| 13 | Gaashk the Black | Gaashk's skin is completely black due to a rare condition. He disappears into the shadows, and is a master of stealth and sabotage. |\n| 14 | Dratz the Mad | Driven insane by a wizard's spell, Dratz was cast out from his clan, now wandering with wild, unpredictable magic abilities. |\n| 15 | Grit the Seer | Grit is a goblin oracle with piercing red eyes. She foresees great danger in the party's future but speaks in riddles. |\n| 16 | Pisk the Butcher | A former cook turned warrior, Pisk wields his oversized butcher knife with deadly precision. He is always spotted with blood splatters. |\n| 17 | Wart the Wicked | Wart is a spiteful goblin with a grudge against the entire world. He is a tormentor, taking pleasure in causing distress and pain. |\n| 18 | Bog the Stout | Surprisingly, Bog is a goblin brewer with a penchant for crafting potent brews that pack a serious punch. He's stockier than most goblins. |\n| 19 | Rask the Swift | Rask is a lightning-quick goblin who can get in and out before you even notice he has stolen your purse. |\n| 20 | Flarg the Crafty | The clan's trap maker and natural mechanic, Flarg has an uncanny knack for improvising deadly gizmos from junk. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Vaegris One-Eye | A quiet, battle-scarred Goliath fighter. Missing an eye from a previous encounter with an ogre. |\n| 2 | Lamoga Skywatcher | A stern Goliath druid tasked with observing the celestial bodies and interpreting their portents. |\n| 3 | Thothak Earthshaker | The grim and formidable leader of their tribe, known for his feats of strength during the annual stone lifting competition. |\n| 4 | Bralani Steelhand | A taciturn blacksmith with an unsurpassed knack for weaponry, wielding a hammer bigger than most dwarves. |\n| 5 | Oloru Frostbeard | A seasoned Goliath barbarian who lives for the thrill of combat. Named for the icicles that form in his beard during winter hunts. |\n| 6 | Kadakas Rockfoot | A solemn, reliable sentinel who guards the mountain passes leading to Goliath territories. |\n| 7 | Kelkath Snowdrifter | A wise elder with a weather-beaten face, adored for her folktales about ancient Goliath heroes. |\n| 8 | Haelga Boulderbreak | A militant, stone-cold Goliath strategist with an insurmountable will. |\n| 9 | Veskar Stonecaller | A brooding Goliath shaman, able to call forth the spirits of rock and stone. |\n| 10 | Thalagara Thunderpeak | A feisty and battle-hardened ranger skilled in navigating treacherous mountain terrains. |\n| 11 | Ghalada Iceheart | Rational, unyielding, and strict, this cleric’s healing skills are as renowned as her icy demeanor. |\n| 12 | Rikke Firebrand | A fiercely independent Goliath rogue known for her quick wit and quicker daggers. |\n| 13 | Zale Nightwind | A Goliath rogue notorious for his stealth and dexterity. An expert mountain hunter. |\n| 14 | Aukan Shearpeak | This ascetic monk spends days in silent meditation on the mountain peaks, completely unaffected by the harsh elements. |\n| 15 | Gathak Wavecrusher | A Goliath cleric celebrated around the bonfire for his daring sea adventures. Praised for his brilliant water maneuvers. |\n| 16 | Torva Stonehand | A Goliath artificer whose inventions harness the power of the mountains themselves. A marvel among her people. |\n| 17 | Korag-Ha Stoneshadow | Known for her unsettling quietness, this formidable Goliath ranger is a master of stealth on the rocky terrain. |\n| 18 | Eglath Gravelvoice | A Goliath bard whose deep resonating stories reverberate through the valleys, his tales are as enduring as the mountains. |\n| 19 | Gaa-Kra Snowreader | This Goliath wizard finds magical patterns in the frost and snow, interpreting them for auspicious signs and omens. |\n| 20 | Borug Primalstorm | A Goliath druid who communes with the forces of nature so intensely, it's said he can call forth a storm by his will alone. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name        | Description |\n|------------|-------------|-------------|\n|1           |Caelan       |A stoic half-elf monk with long white hair and sharp green eyes. Wears simple, practical clothing with a monastic symbol. |\n|2           |Elara        |A cold and distant half-elf warlock. Her crimson eyes seem to glow with an eerie light. Keeps a pet raven on her shoulder. |\n|3           |Halariel     |A quiet half-elf druid with short brown hair and hazel eyes. Always seems to be thinking about something profound. |\n|4           |Thrarirn     |A dispassionate half-elf barbarian with bulky muscle and braided blonde hair. Wields a massive greataxe. |\n|5           |Varis        |A guarded and secretive half-elf rogue. His grey eyes are always darting around. Always has a hand on his dagger. |\n|6           |Estelar      |A serious and loyal half-elf fighter. She is strict with her military regulation hair and shining armor. |\n|7           |Peren        |A dedicated half-elf wizard with a ruffled robe. His spectacles are always slipping down his long nose. |\n|8           |Iefyr        |A detached half-elf ranger with a deep love for nature. Her piercing blue eyes always observe her surroundings with a keen gaze. |\n|9           |Avaryl       |A stern half-elf paladin with religious tattoos. He has a commanding presence and a devoted heart. |\n|10          |Baelen       |A discerning half-elf cleric of knowledge. His eyes hold a wise but melancholy expression. |\n|11          |Evindra      |Half-elf sorcerer with a stone-faced seriousness and intense focus. She always has a faint aura of magic around her. |\n|12          |Kaedric      |A solemn half-elf bard who rarely smiles. His emotion-filled ballads are popular despite his gloomy demeanor. |\n|13          |Raelis       |A stand-offish half-elf artificer. Has a complicated contraption always with him, meticulously tinkering with it often. |\n|14          |Arieth       |A detached half-elf druid who barely speaks. She has a constant companion in a powerful-looking wolf. |\n|15          |Erevan       |A very focused half-elf warlock. His crystal pendant serves as the source of his power – and his obsession. |\n|16          |Miriel       |Quiet and thoughtful half-elf cleric. She wears a symbol of her god around her neck and seems to find peace in her prayers. |\n|17          |Orianna      |A scarred half-elf warrior. She keeps her long hair tightly tied, and her weapons sharpened. She is always alert. | \n|18          |Sylarien     |A seriously minded half-elf bard who creates beautiful but sad music. His solemn violin echoes his heartache. |\n|19          |Tamaris      |A relentless half-elf ranger with a weather-beaten face and keen eyes. Has a hawk that acts as his eyes in the sky. |\n|20          |Ilamin       |Half-elf mage who is more interested in his studies than in people. Has a permanent frown from straining over tiny print in old books. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| Dice Value | Name | Description |\n|-----------|------------|------------|\n| 1 | Gorthag the Resilient | A scarred half-orc war cleric pledging his loyalty to Gruumsh. Always seen with a war tome strapped to his belt. |\n| 2 | Thugruk Ironskin | A tall and muscular half-orc warrior with grey skin, known for his ferocious battle prowess and tactical aptitude. |\n| 3 | Murzog the Etched | A runic tattooed half-orc mystic, eyed at a distance due to his unpredictable and aloof demeanor. |\n| 4 | Yagra Stonefist | A hardy female half-orc blacksmith with arms rippling with muscles. Few know of her past as a gladiator. |\n| 5 | Zark Bloodsnarl | Zark is a scar-faced, half-orc mercenary chief, feared for his brutality and stealth ambush skills. |\n| 6 | Rokag Frostclaw | A mystical half-orc druid hailing from a northern tribe, prefers the solitude of nature than the hubbub of cities. |\n| 7 | Skarsnik the Deceptive | Skilled in deception, Skarsnik is a rogue half-orc with sly green eyes and a booming laugh. |\n| 8 | Krask Broken-Tusk | A exiled half-orc barbarian, wandering from place to place. Known for his broken tusk and fiery temper. |\n| 9 | Ghorza the Wise | An elderly half-orc shaman, with wise grey eyes, known for her healing aura and profound wisdom of arcane lore. |\n| 10 | Nazubal Stonebrow | Tough as stone, Nazubal is a half-orc warrior, known for his steadfast nature when it comes to defending his allies. |\n| 11 | Azgog Half-Ear | A witty, sharp-tongued half-orc ranger. His right ear is half missing due to a previous battle. |\n| 12 | Ulgor the Ironwall | Resolute and sturdy, Ulgor is a Paladin half-orc with an unyielding devotion to his oath of vengeance. |\n| 13 | Vorgak the Redeye | A half-orc sorcerer showcasing a unique crimson hue in his eyes. His powers are as intriguing as they are intimidating. |\n| 14 | Grizhol One-Eye | Battle-tested and worn, this one-eyed half-orc bard spreads chronicles of his adventures in form of music and tales. |\n| 15 | Khogar the Staunch | Khogar, a half-orc monk, seeks spiritual enlightenment than violence, prefers words over weapons, but can engage when required. |\n| 16 | Urzog the Unseen | A half-orc rogue skilled in the art of stealth, his movements are as transparent as his mysterious past. |\n| 17 | Hagral Shadowstride | A sorcerer half-orc hailing from a forbidden cult, known for his affinity towards umbral magic. |\n| 18 | Grimfang the Savage | A notorious half-orc ravager with countless battles under his belt, his violent reputation precedes him. |\n| 19 | Zarmak the Embercaller | Born with an inherent talent for magic, Zarmak is a half-orc wizard harnessing the power of fire in his spells. |\n| 20 | Tharok the Just | A noble-hearted half-orc paladin, seeking justice for his kin, respected for his resolve and sense of fairness. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Bolo Burrowell | Short, stern with salt-and-pepper hair. A successful, no-nonsense halfling farmer. |\n| 2 | Pansy Greenbottle | A clean-cut halfling merchant known for her shrewd business sense. |\n| 3 | Fenton Foxtail | Thin with sharp eyes. A seasoned scout with unparalleled knowledge of local terrains. |\n| 4 | Lila Goodbarrel | A reserved halfling scribe, often found in the local library. |\n| 5 | Dino Diggle | A stoic halfling miner with a muscular build from years of work in the quarries. |\n| 6 | Bella Bucklebee | An ever-practical halfling blacksmith, reputed for her forged masterpieces. |\n| 7 | Perry Proudfoot | A meticulous civil servant who oversees the town's treasury. |\n| 8 | Marnie Millstone | A diligent miller, focused on her craft and producing the town's finest grain. |\n| 9 | Rollo Rumblebelly | A hardy halfling chef, known to create the town's most hearty and filling meals. |\n| 10 | Tully Thistledown | Strict botanist with an extensive knowledge of medicinal plants and herbs. |\n| 11 | Wally Whistlefoot | The reticent lighthouse keeper, spends most of his time in solitude maintaining the beacon. |\n| 12 | Callie Claypot | A stern halfling potter with a knack for sculpting beautiful ceramics. |\n| 13 | Fabian Farseeker | Stoic halfling cartographer, always in search for new lands and maps to create. |\n| 14 | Opal Oddfoot | Serene halfling who serves as the town's healer, known for her gentle touch. |\n| 15 | Gilly Gammidge | The reserved librarian, holds extensive knowledge about various subjects. |\n| 16 | Felix Featherfoot | A conscientious messenger, takes pride in fast and accurate delivery of messages. |\n| 17 | Primrose Platinumfoot | Dignified jeweler, known for her impeccable eye for precious stones and metals. |\n| 18 | Borin Brushcoat | A focused halfling painter, his works are highly sought after by the town's elite. |\n| 19 | Dottie Dustypages | A strict bookbinder, known for preserving old scripts and creating new books. |\n| 20 | Hamlin Harfoot | The reserved shipwright, known for building the sturdiest vessels in the region. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Grumbok Ironhide | A grizzled Hobgoblin veteran wearing heavy plate armor and carrying a large shield, known for his ruthless leadership. |\n| 2 | Snaga the Caiser | A fierce strategist carrying numerous maps and battle plans, always thinking of the next big conquest. |\n| 3 | Varnak the Taskmaster | A stern Hobgoblin decked out in whipping scars, with a fierce eye for discipline and order. |\n| 4 | Irontooth the Lock-breaker | Knows every trick of opening locks, disarm traps and generally not getting caught in the act. |\n| 5 | Urzol Yeavesplitter | A brute armed with a large greataxe, known for his subtly in negotiations – which always involves his axe. |\n| 6 | Ragnot Spinebender | A sinister Hobgoblin with tattooed ritualistic markings all over their body, known for his dark magic practices. |\n| 7 | Tharkrum Hardhead | A towering figure of muscle and steel, leading troops from the frontline with little regard for his own safety. |\n| 8 | Ghashnag the Brawler | Known for starting fights and settling arguments with his fists, not the brightest, but intimidating. |\n| 9 | Gotzug Beastmaster | Accompanied by an intimidating war-beast, Gotzug has a unique relationship with his pet that is more partnership than ownership. |\n| 10 | Kraranak the Flamekeeper | A Hobgoblin pyromancer cloaked in burnt robes, always ready to set the world ablaze. |\n| 11 | Sharguul the Iron Poet | An unusual figure carrying a parchment and quill, known for his war poems that inspire troops in the heat of battle. |\n| 12 | Kargob One-Eye | A Hobgoblin in fine half-plate, showing the scars of a previous command. His single eye still holds a commanding presence. |\n| 13 | Hargul the Tracker | Renowned for his uncanny ability to locate enemies, making up for his lack of brute force with his sharp wit. |\n| 14 | Ungrak the Closetalker | An uncomfortable presence for most, known for sharing his foul breath while sharing 'secrets' of war. |\n| 15 | Vargob Iceblood | A cold-hearted Hobgoblin, often seen in the pale light of dawn preparing for the day's warfare. |\n| 16 | Zarrgak Swiftblade | A skilled swordsman always eager to prove his worth, Quick to anger, quick to fight. |\n| 17 | Gnashrak Siege-breaker | Specializes in the tactics of sieges and fortified defenses, his name was gained for the many walls he has brought down. |\n| 18 | Zogob the Grin | Known for his unsettling grin that he keeps even in the direst of battles, very few things ever wipe that grin off. |\n| 19 | Ragarok Bloodgut | A proud Hobgoblin with visible battle scars which he boasts as ‘trophies’ for his valor in battle. |\n| 20 | Urgnak the Executioner | Wielder of the headsman's axe, he carries out the final judgement for those who disobey warlord's command. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n| Dice Value | Name          | Description                                                   |\n|------------|---------------|---------------------------------------------------------------|\n| 1          | Alden Balwin  | A stoic royal advisor, often seen with historical documents    |\n| 2          | Erika Seldon  | A diligent blacksmith renowned for her skill in weapon-making  |\n| 3          | Gideon Varn   | A seasoned warrior, scarred by many battles                    |\n| 4          | Liana Russel  | A quiet librarian dedicated to preserving ancient knowledge    |\n| 5          | Orson Marle   | A wary city guard, keenly aware of potential threats           |\n| 6          | Gwen Farrow   | A mysterious seer, often misunderstood by her town             |\n| 7          | Percy Blythe  | A stern cleric deeply committed to his faith                   |\n| 8          | Desdemona Vale| A disciplined archer disguising her true noble birth           |\n| 9          | Colm Reder    | An elusive thief hiding behind the image of a drunken fool     |\n| 10         | Vivienne Adler| A talented bard of somber songs, bearing a sad personal history|\n| 11         | Thorne Brogen | A gravedigger haunted by the ghosts of his past                |\n| 12         | Astra Floros  | A pragmatic merchant, excellent in barter and trade            |\n| 13         | Draven Locke  | A disillusioned former knight turned mercenary                 |\n| 14         | Tamsin DeWitt | A no-nonsense healer, respected for her dedication to medicine |\n| 15         | Elric Owen    | A grumpy tavern owner, who only opens up to long-time patrons  |\n| 16         | Mara Whitt    | A disciplined ranger, known for her tracking skills            |\n| 17         | Balthazar Grimm| A reclusive wizard, feared by the superstitious townsfolk      |\n| 18         | Lila Stone    | A reliable courier, carrying messages no matter the danger     |\n| 19         | Tobias Fenn   | A scholar fascinated by arcane lore and artifacts              |\n| 20         | Adelaide Rune | A stern governess with a mysterious past                       |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| Dice Value | Name           | Description                                                                                                                                                                                                                                                                                 |\n|------------|----------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1          | Zerk           | A small, wiry kobold, Zerk has a battle-scarred snout and piercing yellow eyes. He is known for his sly tactics and crafty nature.                                                                                                                                                           |\n| 2          | Grit           | Grit is an elder kobold, his red scales faded with age. He carries a staff adorned with feathers and bones and is believed to converse with the spirits.                                                                                                                                    |\n| 3          | Nisa           | Nisa, endowed with green scales, is a skilled hunter, adept with spear and trap. Her cunning has provided sustenance for her tribe during hard times.                                                                                                                                       |\n| 4          | Klick          | Klick is a young kobold with bright orange scales. As an apprentice to the tribe's blacksmith, his scales are often covered in soot.                                                                                                                                                        |\n| 5          | Sneeze         | A kobold alchemist known for his experiments with explosive substances. His white scales are stained with various concoctions and his nostrils constantly emit wisps of smoke.                                                                                                              |\n| 6          | Slurk          | Slurk is a burly kobold, larger and stronger than most of his kind. His hard, grey scales have earned him the role of the tribe’s foremost warrior.                                                                                                                                         |\n| 7          | Jix            | Jix is a conniving kobold with a scaly, whiskered face. He's the tribe’s information broker, using a network of tunnel-rats to keep abreast of all the tribe's secrets.                                                                                                                      |\n| 8          | Clatter        | Clatter, a kobold of indeterminate age, serves as the tribe's loremaster. His cobalt-blue scales and bright silver eyes lend him a mystical presence.                                                                                                                                       |\n| 9          | Zeb            | Zeb, a kobold miner, has dull brown scales that blend with the subterranean setting he works in. He is hardy and endurance personified.                                                                                                                                                     |\n| 10         | Smirk          | Smirk, a nimble thief, has scales of a shiny bronze tint. He carries an array of lock picking tools and is often tasked with looting enemy supplies and treasure.                                                                                                                            |\n| 11         | Nerk           | A sturdy kobold with earthy green scales, Nerk serves as the tribe's cook. He can make a mean stew out of the most meager ingredients.                                                                                                                                                    |\n| 12         | Plok           | Plok is a solemn kobold warrior. His battle-scarred, rusty-red scales tell tales of numerous battles. With a spear in hand, he is always ready to protect his tribe.                                                                                                                       |\n| 13         | Rattle         | Rattle is the resident shaman of the tribe. Despite his slim stature and light-yellow scales, he wields powerful magic and is venerated by his peers.                                                                                                                                       |\n| 14         | Skritch        | An innovator, Skritch is a tinkerer among the tribe. Covered head to toe in oil and soot, his once-dark scales now have a polished sheen from his constant tweaking and invention.                                                                                                        |\n| 15         | Trill          | Despite her petite size and soft pink scales, Trill holds command in the kobold tribe with an iron fist due to her strategic prowess and diplomatic tact.                                                                                                                                  |\n| 16         | Glink          | Glink, an adept sneak-thief, carries a lustrous set of jet-black scales which helps him fade into the shadows effectively. His mastery over stealth aids in survival and sabotage.                                                                                                          |\n| 17         | Crackle        | Crackle the conjurer is noted for his indigo scales and the sparks constantly dancing around his fingers as he weaves his spells. His magic makes him a beacon of power and respect among his tribe.                                                                                      |\n| 18         | Twip           | Twip may be a small kobold but his olive-green scales are harder than most. His mastery over biomechanics has turned him into a formidable defender of his tribe with his specially designed armor and trap systems.                                                                      |\n| 19         | Yak            | Yak is the tribe’s main scout and forager. Her teal-colored scales are adorned with various herbs that she scavenges. Her knowledge of plants and geography is unsurpassed in the tribe.                                                                                                    |\n| 20         | Zing           | Zing is a lean and muscular kobold with scales of bright yellow and eyes of blazing red. His dextrous agility and quick reflexes, combined with his mastery of the whip and dagger, make him one of the tribe's most revered and feared warriors. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Slit-Scale | Slit-Scale is of average height and build for a Lizardfolk, his vivid green scales are slit from numerous past combats. He carries a wooden club with him.| \n| 2 | Dead-Eye | Dead-Eye is tall and lean. His right eye is clouded over and scarred, remnants of a past fight. He carries a shortbow with a quiver of arrows.|\n| 3 | Chipped-Claw | Chipped-Claw is strong and broad, with a chipped claw on his right hand. His weapon of choice is a spiked mace.|\n| 4 | Marsh-Stalker | Marsh-Stalker is slim and unassuming, but his speed and quietness make him a dangerous predator. He wields a pair of daggers.|   \n| 5 | Silent-Hiss | Silent-Hiss is a quiet individual with a long, slender tail and reddish brown scales. She prefers to use a spear in combat.|\n| 6 | Stone-Skin | Stone-Skin is massive, his scales thicker and harder than most of his kin – resembling a stone surface. He eschews weapons, instead relying on his natural weapons.|\n| 7 | Broken-Tail | Broken-Tail got his name from his oddly bent tail. He is quick and crafty, and uses a shortsword and shield.|\n| 8 | Sunbasker | Sunbasker, with his golden scales, stands out in the swampy terrain of his home. His weapon of choice is a trident.|\n| 9 | Muddy-Hide | Muddy-Hide got her name from her dark brown, mottled scales. She is a skilled archer.|\n| 10 | Thornback | Thornback gets his name from the sharp ridge of bones along his back. Preferred weapons are javelins.|\n| 11 | Fang-Snapper | Fang-Snapper is easily recognized by his oversized jaws and sharp teeth. He fights using a polearm.|\n| 12 | Moss-Crawler | Moss-Crawler blends easily into her environment thanks to her texture and moss green scales. She is a skilled ambusher and uses crossbow.|\n| 13 | Quick-Tongue | Quick-Tongue is an unusually fast talker and thinker. He generally uses nets and traps in combat, rather than direct confrontation.|\n| 14 | Pebble-Pusher | Pebble-Pusher is much smaller than average but uses her size to her advantage in stealth and speed. She uses blowdart as a weapon.|\n| 15 | Still-Water | Still-Water is a very patient hunter, capable of remaining motionless for hours. He uses longbow to fight from a distance.|\n| 16 | Blood-Scale | Blood-Scale's intense red scales set him apart. He uses longsword and is quite a formidable warrior.|\n| 17 | Two-Tails | Two-Tails is a rare Lizardfolk. The second tail enhances her balance, making her an agile fighter. Her favored weapon is a whip.|\n| 18 | Wide-Jaw | Wide-Jaw's gaping maw and strong bite make him an intimidating presence. He uses great axe as a weapon.|\n| 19 | River-Swimmer | River-Swimmer is known for her excellent swimming skills which she uses to surprise her foes. She employs spear in combat.|\n| 20 | Crag-Lurker | Crag-Lurker is a master climber and ambusher. His preferred weapon is a morning star.|\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Grukk | A battle-scarred orc with a patched eye. He's quiet and observant, with a surprisingly wise gaze. |\n| 2 | Thorg | A massive, hulking orc with a distrust of strangers. His tusks are unusually long and appear razor-sharp. |\n| 3 | Nargl | Wiry and battle-ready, Nargl is smaller than most orcs but possesses a fearsome agility. |\n| 4 | Grimgar | Grimgar speaks little, preferring to communicate through action. Deep scars crisscross his green skin. |\n| 5 | Skab | A stocky orc of middling height, Skab exhibits a strange fascination with magical artifacts. |\n| 6 | Zograt | Zograt often stands apart from his kin, choosing the company of his loyal war beast over others. |\n| 7 | Mogrosh | Imposingly tall and with an aura of cold command, Mogrosh is a born leader. His mouth is a grim slit beneath his tusks. |\n| 8 | Zorga | Distinctly sharp-eyed and cunning, Zorga possesses a keen intellect that makes her an unanticipated adversary. |\n| 9 | Urglar | A well-muscled orc who towers over most, Urglar carries a warhammer scarred with the marks of many battles. |\n| 10 | Gregnak | Slender yet sinewy, Gregnak moves with a prowling grace. His icy gaze is always assessing, always watching. |\n| 11 | Rukas | Rukas wears a cloak of bear fur and carries totems of his spirit guide, showcasing his respect for the natural world. |\n| 12 | Karg | Unusually pale and dotted with tribal tattoos, Karg is a silent observer. He seems to hear what isn't said. |\n| 13 | Urgoth | His skin more grey than green, Urgoth carries himself with an air of quiet dignity and hidden strength. |\n| 14 | Gorga | Gorga wears a helmet adorned with rampant boar tusks and fights with a savagery that strikes fear in the hearts of enemies. |\n| 15 | Brakkar | Lean and muscular, with a deep-set gaze, Brakkar is known for his tactical prowess in combat. |\n| 16 | Turog | With long, matted hair and a thick beard, Turog has an air of wildness about him. Despite his gruff exterior, he is notably well-spoken. |\n| 17 | Yurak | Yurak is well-regarded for his firm hand and unyielding determination. His stoic nature is tempered with surprising moments of compassion. |\n| 18 | Gorak | Beneath Gorak’s hulking exterior and intimidating presence lies a measured patience and a keen tactical mind. |\n| 19 | Nogra | With facial scars and a determined gaze, Nogra is a survivor. She’s respected for her ability to outlast and endure. |\n| 20 | Raguk | Heavyset and with a thunderous laugh, Raguk is cruel to his enemies but fiercely loyal to his allies. He emits authority, demanding respect from his troops. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Zephyr | A tiefling of remarkable physical strength with crimson skin and horns that curve backwards. He is a blacksmith by profession.\n| 2 | Lilith | As an alchemist, this tiefling has a deep indigo skin. She is known for her cat-like eyes and forked tail.\n| 3 | Mordai | A talented tiefling bard, Mordai has pale white skin that contrasts with his ebony hair. He carries a lute made of bone.\n| 4 | Candra | A tiefling rogue with grey skin and bat-like wings. Sneaky and nimble, she has a reputation for being a skilled thief.\n| 5 | Ignatius | With yellow eyes that glow in the dark, this tiefling is a solitary wizard with deep knowledge of arcane magic.\n| 6 | Elysium | A female cleric tiefling with jet black skin and ram-like horns. She is known for her healing touches.\n| 7 | Pyrrhus | A strong, battle-scarred tiefling warrior with skin as red as embers. He wields an enormous greatsword with skill and strength.\n| 8 | Leona | A purple-skinned tiefling bard with a charming smile and a beautiful voice that can soothe the most savage beast.\n| 9 | Thorne | A highly skilled archer, Thorne is a tiefling ranger with green skin and horns that resemble a stag's antlers.\n| 10 | Quindal | This tiefling warlock has turquoise skin and long, curved horns. He is feared and respected for his powerful otherworldly patron.\n| 11 | Sepia | Known for her snake-like tail and lavender skin, Sepia is a studious tiefling sorcerer with an uncanny knack for manipulation.\n| 12 | Valerion | A tiefling paladin with silver skin and dragon-like horns who fights fiercely in the name of his deity. \n| 13 | Kalista | A teacher at the local mage tower, this russet-skinned tiefling is known for her sharp intellect and mastery of fire magic.\n| 14 | Bael | A druid tiefling with skin of a warm copper hue. He has an affinity for beasts and can often be seen in the company of animals.\n| 15 | Cerise | A cleric of the light, Cerise is a cherry-skinned tiefling with a warm presence and a calming aura.\n| 16 | Maelis | A swashbuckling tiefling pirate with ocean blue skin. Maelis is feared on the sea for his rapier skills.\n| 17 | Vesper | A quiet and mysterious tiefling monk with dark, shadowy skin. He is dedicated to his martial arts.\n| 18 | Tanis | Tanis is a master alchemist tiefling with teal skin color. His concoctions are known far and wide.\n| 19 | Zenith | A light blue-skinned tiefling ranger known for his effortless navigation of wild terrains.\n| 20 | Iridis | An enchantress tiefling with shimmering, multi-colored skin. She is known throughout the land for her charm and allure.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}