{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "5e Rolltables",
  "description": "Prompt generated entities from ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n# d100 Mishaps due to a Critical Failure on a Melee Attack\n\nRolling a natural 1 can come with consequences. Here are some potential mishaps a player may experience after critically failing a melee attack in a fantasy setting using the Dungeons and Dragons 5e game system.\n\n1. You lose balance and fall prone.\n2. You accidentally hit an ally instead.\n3. You miss the target and hit a nearby object instead, damaging it.\n4. You drop your weapon, leaving yourself unarmed.\n5. You hit yourself in the foot, taking 1d4 bludgeoning damage.\n6. You knock yourself unconscious, falling prone and remaining that way for 1d4 rounds.\n7. You strike a nearby flammable object, igniting it.\n8. Your weapon gets lodged in the environment and can't be removed without external aid.\n9. You damage your weapon, causing it to malfunction or become unusable.\n10. You hit the target, but they retaliate with a free attack.\n11. You accidentally hit a friendly NPC, who is now hostile to you.\n12. You fall backward and take 1d6 bludgeoning damage as you hit the ground.\n13. Your weapon breaks or shatters.\n14. Your attack dislodges a nest of angry insects that attack you and your allies.\n15. You accidentally hit an ally and trigger a disastrous chain reaction of offensive spells.\n16. You hit yourself on the head, stunning yourself for 1 round.\n17. You get tangled up in your own clothes, leaving you restrained for 1 round.\n18. Your attack creates a shockwave that knocks yourself and allies prone.\n19. You trigger a trap hidden in the environment.\n20. You fumble your weapon, sending it flying up to 30 feet away.\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Melee"
    },
    {
      "rawText": "## Ranged\r\n| Roll | Mishap                                                  |\n| ---- | ------------------------------------------------------- |\n| 1    | The bowstring snaps, rendering the weapon useless.       |\n| 2    | The arrow flies backwards and hits the shooter.          |\n| 3    | The arrow hits a nearby ally.                            |\n| 4    | The bowstring grazes the shooter's arm, causing injury.  |\n| 5    | The arrow ricochets and hits a random object.            |\n| 6    | The arrow hits an innocent bystander, causing an uproar. |\n| 7    | The bowstring slips from the shooter's grasp.            |\n| 8    | The arrow hits a nearby rock, shattering it.             |\n| 9    | The bowstring tangles up, requiring time to untangle.    |\n| 10   | The arrow hits a nearby door, causing it to jam shut.    |\n| 11   | The bowstring breaks, causing injury to the shooter.     |\n| 12   | The arrow hits a torch, causing it to fall and ignite.   |\n| 13   | The bowstring frays, reducing the weapon's accuracy.     |\n| 14   | The arrow hits the shooter in the foot.                  |\n| 15   | The shooter's aim is thrown off, causing the arrow to miss the target completely. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| **d100 Mishaps due to a critical failure on an arcane attack** |\n|:--|\n| 1. Your spell backfires and you take damage equal to the spell's level. |\n| 2. The spell hits yourself or the nearest ally instead of the intended target. |\n| 3. Your spell causes an unintended effect that is detrimental to you, such as lowering your AC. |\n| 4. Your target becomes alerted to your location and the location of your party. |\n| 5. The spell causes an environmental hazard, such as setting fire to the surroundings. |\n| 6. Your spell fizzles out, expending the spell slot without any effect. |\n| 7. Your target becomes immune to the type of spell you cast for a certain duration of time. |\n| 8. The spell attracts unwanted attention from nearby creatures. |\n| 9. You mistakenly teleport to a random location within the spell's range. |\n| 10. The spell causes a magical explosion, dealing damage to everyone within a certain radius. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble Tables - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name  | Description |\n|------------|-------|-------------|\n| 01         | Aran  | This Aarakocra has striking green feathers and piercing yellow eyes. Aran is a fierce warrior who has dedicated his life to protecting his people. |\n| 02         | Fala  | Fala is a skilled hunter with a keen sense of vision, able to spot prey from a great distance. She is often found soaring high above the landscape in search of food for her tribe. |\n| 03         | Tethys  | Tethys is a shaman of the Aarakocra people, a wise and powerful mystic who is deeply connected to the natural world. She spends much of her time in meditation, communing with the spirits of the air and the sky. |\n| 04         | Skith  | Skith is a young Aarakocra warrior in search of adventure and glory. He is impulsive and quick to act, which has led to both great triumphs and devastating defeats. |\n| 05         | Kirey  | Kirey is a skilled blacksmith who produces some of the finest weapons and armor in the Aarakocra tribe. He takes great pride in his work and is always looking to improve his craft. |\n| 06         | Paeli  | Paeli is a master of the art of acrobatics, able to perform incredible feats of agility and grace in the air. She is often called upon to perform at tribal celebrations and festivals. |\n| 07         | Zephyr  | Zephyr is a talented engineer who designs and constructs complex devices and machines. His latest creation is a flying machine that he hopes will revolutionize air travel for the Aarakocra people. |\n| 08         | Quilda | Quilda is a skilled diplomat who spends much of her time negotiating alliances and treaties with other tribes and factions. She is known for her quick wit and sharp tongue. |\n| 09         | Theros | Theros is a grizzled veteran of countless battles, scarred and weathered from a life spent fighting for his people. He has a deep respect for honor and tradition and is fiercely loyal to his tribe. |\n| 10         | Nylas | Nylas is a young Aarakocra who has just come of age and is eager to prove himself in the eyes of his tribe. He is determined to become the greatest warrior in the history of his people. |\n| 11         | Aeolus | Aeolus is a skilled navigator and pilot who is responsible for charting the skies and guiding his tribe to new territories. He takes great pride in his work and is always looking for new challenges. |\n| 12         | Halcyon | Halcyon is a gentle and kind-hearted Aarakocra who is beloved by his tribe. He is often called upon to mediate disputes and provide counsel to those in need. |\n| 13         | Ellia  | Ellia is a talented weaver who produces intricate and beautiful tapestries that are highly prized by her people. She is often sought after to create special garments and accessories for tribal celebrations. |\n| 14         | Orion  | Orion is a skilled archer who has few equals when it comes to accuracy and range. He is a patient and disciplined hunter who is always looking for new challenges. |\n| 15         | Kestrel | Kestrel is a young Aarakocra with an insatiable curiosity about the world around her. She spends much of her time exploring new territories and learning all she can about them. |\n| 16         | Altair | Altair is a skilled musician who plays a variety of instruments, including a rare Aarakocra wind instrument that he has been perfecting for years. |\n| 17         | Cygnus | Cygnus is a fierce and imposing Aarakocra warrior who strikes fear into the hearts of his enemies. He is known for his incredible strength and fighting ability. |\n| 18         | Zephyrus | Zephyrus is a skilled artisan who specializes in intricate wood carvings and sculptures. His work is highly prized by his people and is often used to decorate their homes and public spaces. |\n| 19         | Calliope | Calliope is a talented storyteller who is always regaling her tribe with tales of adventure and heroism. Her stories are so vivid and compelling that they often feel like they're happening in real time. |\n| 20         | Helios | Helios is a shrewd businessman who has amassed a considerable fortune through his various enterprises. He is always looking for new opportunities to expand his wealth and power. |\n| 21         | Astra  | Astra is a gifted healer who has dedicated her life to using her knowledge of plants and herbs to care for the sick and injured of her tribe. |\n| 22         | Althea | Althea is a skilled magician who specializes in wind spells. She is often called upon to provide support for her tribe in battle or to summon up favorable winds for their journeys. |\n| 23         | Larkspur | Larkspur is a highly respected member of the Aarakocra tribe who has lived a long and celebrated life. She is a storehouse of tribal knowledge and wisdom, and her counsel is sought after by all. |\n| 24         | Gale   | Gale is a fiery and impulsive Aarakocra warrior who loves nothing more than a good fight. She is always looking for new opponents to test her mettle against. |\n| 25         | Hawke  | Hawke is a cunning and resourceful thief who uses her talents to steal from the wealthy and give to the poor. She has a soft spot for those in need and is always willing to lend a helping hand. |\n| 26         | Skylark | Skylark is a talented singer who has a voice like an angel. She is often asked to perform at tribal celebrations and is beloved by all who hear her sing. |\n| 27         | Falcon | Falcon is a highly skilled messenger who is responsible for carrying important messages and news between tribes and allies. He is both fast and reliable, and is highly respected by his people. |\n| 28         | Rhea   | Rhea is a fierce and determined Aarakocra warrior who will stop at nothing to protect her tribe and loved ones. She is known for her incredible tenacity and fighting spirit. |\n| 29         | Sylph  | Sylph is a skilled dancer who specializes in aerial movements and spins. She is often called upon to perform at tribal celebrations and is highly regarded for her grace and agility. |\n| 30         | Andri | Andri is a skilled navigator who is able to guide his tribe through even the most treacherous of skies. He is highly respected for his knowledge of wind patterns and weather prediction. |\n| 31         | Azure  | Azure is a skilled underwater diver who is able to explore the ocean depths in search of valuable resources and lost treasures. She is known for her ability to hold her breath for incredibly long periods of time. |\n| 32         | Zephyra | Zephyra is a skilled astronomer who spends much of her time studying the stars and planets in the sky. She is highly respected for her knowledge of celestial navigation and astrology. |\n| 33         | Aelius | Aelius is a skilled writer and historian who has chronicled the history and culture of the Aarakocra people. His work is highly regarded for its accuracy and attention to detail. |\n| 34         | Strix  | Strix is a solitary Aarakocra who prefers to live alone in the wilderness. He is a skilled craftsman who produces finely crafted wooden items and carvings. |\n| 35         | Talon  | Talon is a fierce and aggressive Aarakocra who has a reputation for being hot-headed and impulsive. He is a formidable fighter, but has a tendency to act without thinking. |\n| 36         | Cirrus | Cirrus is a skilled weaver who specializes in creating intricate and beautiful tapestries that depict the history and culture of the Aarakocra people. |\n| 37         | Aquila | Aquila is a highly skilled engineer who designs and constructs complex machines and devices. He is always looking for new challenges and opportunities to improve his craft. |\n| 38         | Vesper | Vesper is a talented musician who plays a variety of instruments, including a rare Aarakocra wind instrument that she has been perfecting for years. |\n| 39         | Harpy  | Harpy is a fierce and aggressive Aarakocra warrior who is feared by her enemies. She is known for her incredible strength and fighting ability. |\n| 40         | Phoenix | Phoenix is a rare and powerful Aarakocra who has been blessed with the ability to wield fire magic. She is highly respected for her abilities and is often called upon to provide support in battle. |\n| 41         | Icarus | Icarus is a reckless and impulsive Aarakocra warrior who is always looking for a new challenge. He is known for his daring aerial maneuvers and incredible fighting spirit. |\n| 42         | Kite   | Kite is a quiet and reserved Aarakocra who prefers to observe from a distance rather than engage in direct confrontation. He is a highly skilled sniper who is able to pick off targets from great distances. |\n| 43         | Eurus  | Eurus is a skilled magician who specializes in wind spells. He is often called upon to provide support for his tribe in battle or to summon up favorable winds for their journeys. |\n| 44         | Tern   | Tern is a skilled navigator who is able to guide his tribe through even the most treacherous of skies. He is highly respected for his knowledge of wind patterns and weather prediction. |\n| 45         | Osprey | Osprey is a fierce and aggressive Aarakocra who has a reputation for being hot-headed and impulsive. He is a formidable fighter, but has a tendency to act without thinking. |\n| 46         | Phoenixa | Phoenixa is a rare and powerful Aarakocra who has been blessed with the ability to wield fire magic. She is highly respected for her abilities and is often called upon to provide support in battle. |\n| 47         | Faucon | Faucon is a highly skilled messenger who is responsible for carrying important messages and news between tribes and allies. He is both fast and reliable, and is highly respected by his people. |\n| 48         | Carrion | Carrion is a fierce and menacing Aarakocra who is feared by all who cross his path. He is known for his ruthless nature and his ability to strike fear into the hearts of his enemies. |\n| 49         | Oroshi | Oroshi is a young Aarakocra warrior in search of adventure and glory. He is impulsive and quick to act, which has led to both great triumphs and devastating defeats. |\n| 50         | Cloud | Cloud is a gentle and peaceful Aarakocra who prefers to live alone in the clouds. He spends much of his time in meditation, communing with the spirits of the air and the sky. |\n| 51         | Anemone | Anemone is a skilled underwater diver who is able to explore the ocean depths in search of valuable resources and lost treasures. She is known for her ability to hold her breath for incredibly long periods of time. |\n| 52         | Konstantinos | Konstantinos is a skilled warrior who has fought in numerous battles for his tribe. He is known for his tactical brilliance and his ability to lead his fellow warriors to victory. |\n| 53         | Feathers | Feathers is a skilled craftsman who produces finely crafted wooden items and carvings. He is highly regarded for his attention to detail and his ability to create lifelike representations of flora and fauna. |\n| 54         | Vulture | Vulture is a solitary Aarakocra who prefers to live alone in the wilderness. He is a skilled hunter who is able to track and capture even the most elusive prey. |\n| 55         | Gannet | Gannet is a gentle and kind-hearted Aarakocra who is beloved by his tribe. He is often called upon to mediate disputes and provide counsel to those in need. |\n| 56         | Chickadee | Chickadee is a young Aarakocra who has just come of age and is eager to prove himself in the eyes of his tribe. He is determined to become the greatest warrior in the history of his people. |\n| 57         | Cormorant | Cormorant is a skilled fisherman who is able to catch even the most wily of fish. He is highly regarded for his knowledge of aquatic creatures and his ability to provide food for his tribe. |\n| 58         | Kestrela| Kestrela is a young Aarakocra with an insatiable curiosity about the world around her. She spends much of her time exploring new territories and learning all she can about them. |\n| 59         | Ardea  | Ardea is a highly respected member of the Aarakocra tribe who has lived a long and celebrated life. She is a storehouse of tribal knowledge and wisdom, and her counsel is sought after by all. |\n| 60         | Falconer | Falconer is a highly skilled hunter who has trained his falcon to help him in his hunt for prey. He is known for his patience and his ability to work with animals. |\n| 61         | Onyx  | Onyx is a skilled blacksmith who produces some of the finest weapons and armor in the Aarakocra tribe. He takes great pride in his work and is always looking to improve his craft. |\n| 62         | Ruby   | Ruby is a shaman of the Aarakocra people, a wise and powerful mystic who is deeply connected to the natural world. She spends much of her time in meditation, communing with the spirits of the air and the sky. |\n| 63         | Sapphire | Sapphire is a skilled engineer who designs and constructs complex machines and devices. She is always looking for new challenges and opportunities to improve her craft. |\n| 64         | Topaz | Topaz is a skilled musician who plays a variety of instruments, including a rare Aarakocra wind instrument that he has been perfecting for years. |\n| 65         | Rubyeye | Rubyeye is a fierce and determined Aarakocra warrior who will stop at nothing to protect her tribe and loved ones. She is known for her incredible tenacity and fighting spirit. |\n| 66         | Amethyst | Amethyst is a gifted healer who has dedicated her life to using her knowledge of plants and herbs to care for the sick and injured of her tribe. |\n| 67         | Emerald | Emerald is a highly skilled magician who specializes in wind spells. She is often called upon to provide support for her tribe in battle or to summon up favorable winds for their journeys. |\n| 68         | Jade   | Jade is a skilled navigator who is able to guide her tribe through even the most treacherous of skies. She is highly respected for her knowledge of wind patterns and weather prediction. |\n| 69         | Opal   | Opal is a gentle and peaceful Aarakocra who prefers to live alone in the clouds. She spends much of her time in meditation, communing with the spirits of the air and the sky. |\n| 70         | Garnet | Garnet is a skilled weaver who specializes in creating intricate and beautiful tapestries that depict the history and culture of the Aarakocra people. |\n| 71         | Jasper | Jasper is a skilled writer and historian who has chronicled the history and culture of the Aarakocra people. Her work is highly regarded for its accuracy and attention to detail. |\n| 72         | Lapis  | Lapis is a skilled underwater diver who is able to explore the ocean depths in search of valuable resources and lost treasures. She is known for her ability to hold her breath for incredibly long periods of time. |\n| 73         | Moonstone | Moonstone is a rare and powerful Aarakocra who has been blessed with the ability to wield moon magic. She is highly respected for her abilities and is often called upon to provide support in battle. |\n| 74         | Obsidian | Obsidian is a solitary Aarakocra who prefers to live alone in the wilderness. He is a skilled craftsman who produces finely crafted stone items and carvings. |\n| 75         | Peridot | Peridot is a skilled musician who plays a variety of instruments, including a rare Aarakocra wind instrument that he has been perfecting for years. |\n| 76         | Quartz | Quartz is a skilled magician who specializes in earth spells. She is often called upon to provide support for her tribe in battle or to summon up favorable terrain for their journeys. |\n| 77         | Sapphirea | Sapphirea is a skilled engineer who designs and constructs complex machines and devices. She is always looking for new challenges and opportunities to improve her craft. |\n| 78         | Turquoise | Turquoise is a gentle and kind-hearted Aarakocra who is beloved by her tribe. She is often called upon to mediate disputes and provide counsel to those in need. |\n| 79         | Cobalt | Cobalt is a fierce and aggressive Aarakocra who has a reputation for being hot-headed and impulsive. He is a formidable fighter, but has a tendency to act without thinking. |\n| 80         | Zircon | Zircon is a highly skilled navigator who is able to guide his tribe through even the most treacherous of skies. He is highly respected for his knowledge of wind patterns and weather prediction. |\n| 81         | Bismuth | Bismuth is a highly respected member of the Aarakocra tribe who has lived a long and celebrated life. She is a storehouse of tribal knowledge and wisdom, and her counsel is sought after by all. |\n| 82         | Citrine | Citrine is a skilled blacksmith who produces some of the finest weapons and armor in the Aarakocra tribe. She takes great pride in her work and is always looking to improve her craft. |\n| 83         | Diamond | Diamond is a shaman of the Aarakocra people, a wise and powerful mystic who is deeply connected to the natural world. She spends much of her time in meditation, communing with the spirits of the air and the sky. |\n|\r\n\nChatbot reponse terminated unexpectedly: : length\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Althea | An aasimar with short blonde hair and piercing blue eyes. She is a paladin of Pelor and wears intricate golden armor. |\n| 2          | Brenna | A gentle and kind aasimar with long silver hair and soft-spoken demeanor. She heals the sick and wounded with her divine powers. |\n| 3          | Cassiel | A stoic and serious aasimar with wings of radiant energy and a gleaming holy sword. He is a champion of justice and defender of the realm. |\n| 4          | Dariana | A charismatic aasimar with golden eyes and flowing white hair. She is a bard and uses her divine magic to inspire courage and hope. |\n| 5          | Eadric | A tall and imposing aasimar with silver hair and a fierce gaze. He is a paladin of Bahamut and a fierce protector of all that is good. |\n| 6          | Fallon | A youthful aasimar with curly brown hair and a curious nature. She is a cleric of Lathander and enjoys exploring new places and meeting new people. |\n| 7          | Gideon | A solemn aasimar with dark hair and piercing green eyes. He is a monk of the order of the silver dragon and seeks to master mind and body. |\n| 8          | Helia | A radiant aasimar with golden hair and a kind smile. She is a cleric of the goddess Sune and spreads love and beauty wherever she goes. |\n| 9          | Isolde | An adventurous aasimar with a mischievous grin and a fondness for pranks. She is a rogue who uses her divine gifts to aid her thievery. |\n| 10         | Jarek | A gruff and hardened aasimar with a scar across his cheek. He is a fighter who values strength and courage above all else. |\n| 11         | Kaida | A graceful aasimar with flowing black hair and piercing blue eyes. She is a bard who uses her divine magic to comfort and console those around her. |\n| 12         | Lirien | A free-spirited aasimar with bright red hair and a penchant for mischief. She is a sorceress who uses her divine heritage to unleash powerful magic. |\n| 13         | Malakai | A somber aasimar with dark hair and piercing grey eyes. He is a ranger who uses his divine gifts to track and hunt the forces of evil. |\n| 14         | Nerys | A wise aasimar with a serene manner and a gentle smile. She is a druid who uses her divine gifts to heal and protect the natural world. |\n| 15         | Ophelia | A fiery aasimar with flaming hair and eyes that glow with an inner light. She is a warlock who has struck a pact with a powerful celestial being. |\n| 16         | Peregrine | A daring aasimar with short brown hair and bright green eyes. He is a rogue who uses his divine gifts to help him sneak and deceive. |\n| 17         | Quillan | A mysterious aasimar with a piercing gaze and an inscrutable expression. He is a wizard who uses his divine heritage to unravel the secrets of the universe. |\n| 18         | Raphael | A noble aasimar with silver hair and a regal bearing. He is a paladin who serves as a champion of the downtrodden and oppressed. |\n| 19         | Seraphina | A radiant aasimar with long blonde hair and a serene expression. She is a cleric of the goddess Tymora and brings good fortune wherever she goes. |\n| 20         | Uriel | A fierce and determined aasimar with piercing blue eyes and a sword of pure light. He is a champion of justice and fights tirelessly against the forces of evil. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n| Dice Value | Name           | Description                                                                                                                                           |\n|------------|----------------|-------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1-10       | Grimgnash      | Gruff and imposing, Grimgnash is covered in coarse, brown fur and stands over seven feet tall. His sharp claws and teeth make him a formidable opponent. |\n| 11-20      | Snarlak        | With shaggy gray fur and a perpetually snarling expression, Snarlak is a fierce bugbear warrior who revels in battle.                                       |\n| 21-30      | Gruk the Brute | Gruk is known for his immense strength and his ruthless tactics. He wears a necklace of bones and relishes in the fear he strikes in his enemies.           |\n| 31-40      | Throgar        | Throgar is unusually sly for a bugbear, often using his intelligence to catch his opponents off-guard. He is almost as quick with his wit as he is with his axe.|\n| 41-50      | Lugdush        | One of the largest and most terrifying bugbears in the land, Lugdush wields a massive spiked club and cowers in the shadows waiting for his prey.           |\n| 51-60      | Grozul         | Known for his cunning and ruthlessness, Grozul is a master tactician and strategist. His powerful build and exceptional leadership make him a force to be reckoned with. |\n| 61-70      | Snickersnee    | Quick and agile, Snickersnee is a deadly opponent with her dual-wielding short swords. She is known for her high-pitched cackling laughter that strikes fear in the hearts of her enemies. |\n| 71-80      | Fangar         | Fangar is a hulking brute of a bugbear who wields a massive greatclub with ease. He is feared not only for his size and strength, but also his brutal cunning. |\n| 81-90      | Spinesnap      | Spinesnap is a rogueish bugbear who uses his sharp reflexes and cleverness to outsmart his enemies. He wears a hooded cloak and carries a pair of deadly daggers. |\n| 91-100     | Gorgul         | With matted fur and a slack-jawed expression, Gorgul seems almost slow-witted at first glance. But don't let his appearance fool you - he is one of the deadliest bugbears around, with an unerring aim and incredible strength. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Vesperia | A mysterious changeling who often takes on the appearance of a bird. |\n| 2 | Shade | A skilled spy and assassin who can blend in with any crowd. |\n| 3 | Ember | An empathetic changeling who uses their abilities to help heal others. |\n| 4 | Dax | A charismatic and outgoing changeling who loves to perform and entertain. |\n| 5 | Dusk | A reserved changeling who tends to keep to themselves and observe others. |\n| 6 | Mirage | A master of illusions and deception, capable of fooling even the most discerning eye. |\n| 7 | Kaida | A quick-witted changeling who always seems to be one step ahead of their enemies. |\n| 8 | Raven | A sly and mischievous changeling who enjoys causing trouble for others. |\n| 9 | Lyra | A skilled musician who uses their changeling abilities to enhance their performances. |\n| 10 | Asher | A stoic changeling who doesn't reveal much about themselves, but is highly respected by their peers. |\n| 11 | Aurora | A changeling with a bright and optimistic personality, who always sees the best in people. |\n| 12 | Veil | A stealthy and mysterious changeling who can disappear without a trace. |\n| 13 | Orion | A skilled hunter and tracker who uses their changeling abilities to blend in with the wilderness. |\n| 14 | Zenith | A powerful changeling who can morph into a larger and stronger form to intimidate their enemies. |\n| 15 | Phoenix | A fiery and passionate changeling who always stands up for what they believe in. |\n| 16 | Eclipse | A brooding and enigmatic changeling who seems to have a dark past. |\n| 17 | Celeste | A kind and nurturing changeling who often takes care of others. |\n| 18 | Silhouette | A skilled thief and infiltrator who can blend in with shadows to avoid detection. |\n| 19 | Nimbus | A changeling with a sunny disposition who always looks on the bright side of things. |\n| 20 | Omen | A changeling with dark and foreboding powers, capable of predicting the future. |\n| 21-100 | Roll again | Roll again on this table to generate a new name and description. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 01         | Drakonia the Flamecaller | A fierce and powerful red dragon, known for its fire breath and hoarding treasure in its lair. Drakonia is feared and respected by all those who know of her. |\n| 02         | Auronax the Stormbringer | A blue dragon that rules the skies, known for its lightning breath and ability to summon fierce thunderstorms. Auronax is both feared and admired for its power and fury. |\n| 03         | Krynnar the Magma Mauler | A massive black dragon that lives deep beneath the earth, where it controls the flow of magma and molten rock. Krynnar is a master of subterranean combat, using its claws and teeth to devastating effect. |\n| 04         | Althaea the Ice Queen | A regal white dragon that rules over a frozen wasteland, surrounded by a powerful blizzard that keeps intruders at bay. Althaea is cunning and ruthless, with a cold heart that matches her icy exterior. |\n| 05         | Vylathar the Shadow Stalker | An enigmatic black dragon that lurks in the shadows, using its powers of darkness to ambush and surprise its prey. Vylathar is elusive and mysterious, with an air of menace that chills all those who encounter it. |\n| 06         | Iridia the Radiant | A shining golden dragon that radiates light and warmth, with a mesmerizing presence that inspires awe and wonder. Iridia is a powerful protector and defender, using her divine powers to shield the innocent from harm. |\n| 07         | Thrixia the Acidic | A green dragon that spits a caustic acid, capable of melting through armor and flesh alike. Thrixia is a vicious and cruel creature, reveling in the pain and suffering of others. |\n| 08         | Zephyranthes the Tempestuous | A copper dragon that loves to play pranks and cause mischief, using its breath weapon to create whirlwinds and storms that scatter its foes. Zephyranthes is a cheerful and lively creature, always seeking new experiences and adventures. |\n| 09         | Myrddin the Timeless | An ancient dragon that has lived for centuries, hoarding knowledge and secrets in its vast lair. Myrddin is a master of magic and lore, with a vast library of tomes and scrolls at its disposal. |\n| 10         | Pyrrha the Ancient One | A majestic gold dragon, the embodiment of wisdom and enlightenment. Pyrrha is a revered and respected elder, with a vast repository of knowledge and insights gained through centuries of experience. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 01         | Vrondissar | A wise and ancient dragonborn, with eyes that gleam like emeralds. He is a renowned scholar and spends most of his time studying ancient texts and lore. |\n| 02         | Kethendithas | A fierce warrior, with red scales and golden eyes. He is known for his quick reflexes and deadly strikes. |\n| 03         | Nyria | A beautiful dragonborn, with iridescent blue scales and bright silver eyes. She is a skilled sorceress and often travels to faraway lands, seeking magical knowledge. |\n| 04         | Xalathar | An enigmatic dragonborn, with black scales and piercing yellow eyes. He is a master of shadows and rumors say he is involved in clandestine affairs. |\n| 05         | Drassak | A cunning rogue, with green scales and sharp fangs. He can charm his way out of any situation and is always ready for a daring heist. |\n| 06         | Korrath | A gruff and no-nonsense dragonborn, with brown scales and a scarred face. He is a veteran of many battles and has a reputation as a tough leader. |\n| 07         | Zavakar | A jovial and outgoing dragonborn, with orange scales and a booming laugh. He is a popular entertainer and storyteller, always ready to lift the spirits of those around him. |\n| 08         | Jaxxaran | A brooding and melancholic dragonborn, with purple scales and deep-set eyes. He is a gifted poet and musician, but his lyrics are often tinged with sorrow and longing. |\n| 09         | Galthorius | A stern and disciplined dragonborn, with silver scales and piercing blue eyes. He is a paladin of the highest order, sworn to defend the weak and uphold justice. |\n| 10         | Nalenthir | A scholarly dragonborn, with teal scales and a sharp mind. He is an expert in arcane theory and spends most of his time teaching aspiring wizards. |\n| 11         | Vayiel | An adventurous dragonborn, with bronze scales and a wild spirit. She is a skilled explorer and treasure hunter, always seeking new and exciting challenges. |\n| 12         | Balasar | A towering dragonborn, with crimson scales and a booming voice. He is a fearless warrior and a devoted follower of Tymora, the goddess of luck. |\n| 13         | Syltharion | A mysterious dragonborn, with indigo scales and piercing green eyes. He is a coveted ally of many adventuring parties, but his true motives are shrouded in secrecy. |\n| 14         | Gethrexis | A ruthless dragonborn, with jet black scales and a bloodthirsty attitude. He is a merciless assassin, feared by all who know him. |\n| 15         | Araton | A kindly dragonborn, with pearl white scales and a gentle heart. He is a healer and a mentor, always ready to offer his aid and wisdom to those in need. |\n| 16         | Drogathar | A grizzled and battle-hardened dragonborn, with copper scales and a menacing glare. He is a retired soldier, but often takes up his sword once more when his friends are in danger. |\n| 17         | Myrion | A mischievous dragonborn, with sky blue scales and twinkling eyes. He is a skilled prankster and usually has a trick or two up his sleeve. |\n| 18         | Zelatha | A wise dragonborn, with sage green scales and piercing brown eyes. She is a respected judge and counselor, who has sage advice for all who seek her counsel. |\n| 19         | Derronom | A gluttonous dragonborn, with olive green scales and a voracious appetite. He loves nothing more than feasting and enjoys sharing his bounty with his friends. |\n| 20         | Kelithar | A passionate dragonborn, with ruby red scales and a fiery temper. She is a zealous follower of Bahamut, the platinum dragon, and will do anything to defend his honor. |\n| 21         | Gorrathix | A lumbering dragonborn, with soft yellow scales and a gentle heart. He is a blacksmith and metalworker, who crafts the finest weapons and armor in all the land. |\n| 22         | Zatheth | A graceful dragonborn, with deep blue scales and a serene demeanor. She is a skilled dancer and often performs for royalty and nobility. |\n| 23         | Thorgar | A burly dragonborn, with rust-colored scales and a love of drink. He is a jovial tavern owner, who always has a cold mug of ale ready for his patrons. |\n| 24         | Synalith | A stoic dragonborn, with emerald scales and a quiet aura. She is a skilled archer and often accompanies adventuring parties on dangerous missions. |\n| 25         | Rethorn | A boisterous dragonborn, with bronze scales and a hearty laugh. He is a boastful adventurer, always ready to regale his friends with tales of his exploits. |\n| 26         | Vynathor | An eccentric dragonborn, with lavender scales and a quirky personality. He is a mad scientist of sorts, who is always tinkering with bizarre gadgets and devices. |\n| 27         | Kethryx | A haunted dragonborn, with steel gray scales and a troubled past. He is a jaded mercenary, who has seen too much of the world's cruelty and cynicism. |\n| 28         | Zethyra | A romantic dragonborn, with peach-colored scales and a gentle voice. She is a bard and a storyteller, who weaves beautiful tales of love and passion. |\n| 29         | Naltharion | A paranoid dragonborn, with gold scales and an untrusting nature. He is a skilled spy and often works for powerful factions and organizations. |\n| 30         | Gaxxar | A curious dragonborn, with bright green scales and a love of knowledge. He is an inventor and scholar, who is always seeking new discoveries and inventions. |\n| 31         | Zuxthor | A reclusive dragonborn, with obsidian black scales and a mysterious past. He is a powerful wizard, rumored to have dabbled in dark magic. |\n| 32         | Drexthor | A jolly dragonborn, with candy apple red scales and a love of music. He is a bard and a minstrel, who spreads joy and merriment wherever he goes. |\n| 33         | Xalaxia | A vain dragonborn, with sapphire blue scales and an obsession with her appearance. She is a talented fashion designer and often creates stunning garments and accessories. |\n| 34         | Naladon | A determined dragonborn, with forest green scales and a strong will. He is a paladin of Eldath, the goddess of peace, and is determined to bring harmony to a chaotic world. |\n| 35         | Araxis | A sneaky dragonborn, with deep purple scales and a knack for thievery. He is a charming rogue, who often finds himself on the wrong side of the law. |\n| 36         | Sylthagor | A righteous dragonborn, with silver-blue scales and a fierce determination. He is a warrior-priest of Moradin, the dwarf god of creation, who protects his people from harm. |\n| 37         | Kethros | A grumpy dragonborn, with dusty brown scales and a quick temper. He is a cantankerous old hermit, who lives alone in the mountains and seldom interacts with people. |\n| 38         | Zalistrasza | A visionary dragonborn, with shimmering white scales and a big dream. She is an inventor and engineer, who seeks to revolutionize the world with her creations. |\n| 39         | Gethromir | A curious dragonborn, with deep green scales and a love of exploration. He is an archaeologist and adventurer, who seeks to uncover the secrets of lost civilizations. |\n| 40         | Xarnax | A quiet dragonborn, with deep maroon scales and a mysterious aura. He is a powerful mage, who prefers to keep to himself and study ancient tomes. |\n| 41         | Nalarion | A hedonistic dragonborn, with tawny scales and a love of luxury. He is a wealthy merchant, who indulges in the finer things in life. |\n| 42         | Galarian | A stoic dragonborn, with ash gray scales and a sense of duty. He is a royal guardsman and will do whatever it takes to protect his liege and country. |\n| 43         | Xystrina | A flirtatious dragonborn, with scarlet scales and a sultry voice. She is a courtesan and pleasure seeker, who knows how to seduce both men and women. |\n| 44         | Valthrax | A dreary dragonborn, with charcoal gray scales and a morose nature. He is an undertaker and always seems to be surrounded by death and mourning. |\n| 45         | Kethra | A lighthearted dragonborn, with sky blue scales and a carefree spirit. She is a ranger and often roams the wilderness, seeking adventure and marveling at the natural world. |\n| 46         | Zalthorin | A well-read dragonborn, with ivory scales and a love of literature. He is a scholar and librarian, who has an encyclopedic knowledge of history and culture. |\n| 47         | Ganthor | A brutal dragonborn, with steel blue scales and a love of violence. He is a gladiator and often competes in bloody battles for the entertainment of crowds. |\n| 48         | Xythraxia | A determined dragonborn, with copper-colored scales and a strong sense of justice. She is a bounty hunter, who always brings her prey to justice, no matter the cost. |\n| 49         | Nalaxar | A loyal dragonborn, with bronze scales and a heart of gold. He is a faithful servant of his lord and will do anything to defend his honor. |\n| 50         | Gethranis | A playful dragonborn, with magenta scales and a love of mischief. He is a trickster and often delights in pulling pranks and hoaxes on others. |\n| 51         | Xylthara | An introspective dragonborn, with crystal clear scales and a thoughtful nature. She is a philosopher and often ponders the big questions of life and existence. |\n| 52         | Ketharax | A restless dragonborn, with rust-colored scales and a wanderlust. He is a nomadic trader, who travels from town to town, buying and selling goods. |\n| 53         | Zaladron | A fierce dragonborn, with onyx black scales and a ferocious temper. He is a fierce warrior and a champion of Kord, the god of battle. |\n| 54         | Vytharion | A carefree dragonborn, with sunny yellow scales and a smile on his face. He is a bard and a jester, who brings laughter and merriment to all around him. |\n| 55         | Nalathus | A resourceful dragonborn, with olive green scales and quick wits. He is a rogue and a smuggler, always finding creative ways to move contraband across borders. |\n| 56         | Xalathara | A mysterious dragonborn, with midnight blue scales and a haunting beauty. She is a fortune teller and seer, who can glimpse the future and read the stars. |\n| 57         | Gethralia | A spiritual dragonborn, with lavender scales and a deep connection to the divine. She is a cleric and healer, who channels the power of the gods to aid others. |\n| 58         | Zytharion | A regal dragonborn, with rich gold scales and a commanding presence. He is a prince and leader, who is destined for greatness. |\n| 59         | Xalathorin | A calculating dragonborn, with silvery white scales and a sharp mind. He is a master strategist and tactician, who always stays one step ahead of his opponents. |\n| 60         | Kethrya | A passionate dragonborn, with fiery orange scales and a love of adventure. She is a knight and defender, who is always ready to protect the innocent. |\n| 61         | Zekthor | A cold dragonborn, with icy blue scales and a heart of stone. He is a ruthless mercenary, who will do whatever it takes to complete his mission. |\n| 62         | Valthraxis | An eccentric dragonborn, with neon green scales and a wild imagination. He is an artist and inventor, who creates bizarre and wondrous things. |\n| 63         | Nalaxia | A curious dragonborn, with sea foam green scales and a love of discovery. She is a scientist and inventor, who is always seeking new knowledge and understanding. |\n| 64         | Galaria | A gentle dragonborn, with sky blue scales and a kind heart. She is a healer and caretaker, who dedicates herself to helping those in need. |\n| 65         | Kethranon | An ambitious dragonborn, with cherry red scales and a hunger for power. He is a politician and schemer, who craves wealth and influence. |\n| 66         | Zalazthus | A solitary dragonborn, with dark silver scales and a reclusive nature. He is a hermit and loner, who has little patience for the world of men and women. |\n| 67         | Valtharith | A restless dragonborn, with rust-colored scales and a love of adventure. He is a wanderer and explorer, who has traveled to the far corners of the world. |\n| 68         | Xalthorin | A mysterious dragonborn, with deep purple scales and an enigmatic personality. He is a spy and intelligence gatherer, who always seems to know more than he lets on. |\n| 69         | Nalatharion | A fierce dragonborn, with silver-blue scales and a love of battle. He is a berserker and warrior, who charges headlong into danger. |\n| 70         | Zytharax | A charming dragonborn, with emerald green scales and a quick tongue. He is a diplomat and negotiator, who knows how to smooth over even the most difficult of situations. |\n| 71         | Vytharion | A loyal dragonborn, with golden scales and a strong sense of duty. He is a soldier and patriot, who will do anything to defend his homeland. |\n| 72         | Kethrath | A stoic dragonborn, with obsidian scales and a grim determination. He is a bounty hunter and tracker, who always gets his prey. |\n| 73         | Zelathorin | A practical dragonborn, with silver scales and a no-nonsense attitude. She is a blacksmith and craftsman, who knows how to make things that last. |\n| 74         | Valthar | A jovial dragonborn, with bright green scales and a love of puns. He is a comedian and entertainer, who always knows how to make his audience laugh. |\n| 75         | Nalorin | A sly dragonborn, with ruby red scales and a cunning mind. He is a master thief and con artist, who can talk his way out of any situation. |\n| 76         | Xyltharion | A well-traveled dragonborn, with sandy brown scales and a worldly perspective. He is a merchant and trader, who has seen more of the world than most. |\n| 77         | Gethyrax | A repressed dragonborn, with deep indigo scales and a troubled past. She is a cleric and healer, who seeks to make amends for her past mistakes. |\n| 78         | Kethalari | A mysterious dragonborn, with silver scales and an icy demeanor. She is a hunter and tracker, who stalks her prey with deadly precision. |\n| 79         | Zythar | A solitary dragonborn, with ebony scales and a distrust of others. He is a loner and outsider, who prefers the company of his books to that of people. |\n| 80         | Vyltharion | A charismatic dragonborn, with coral pink scales and a silver tongue. She is a politician and public speaker, who knows how to sway hearts and minds. |\n| 81         | Nalthraxia | A practical dragonborn, with beige scales and a love of engineering. She is an inventor and mechanic, who creates machines and devices that work in harmony with nature. |\n| 82         | Xalthar | A curious dragonborn, with jade green scales and a love of puzzles. He is a scholar and philosopher, who delights in solving riddles and exploring the unknown. |\n| 83         | Zethraxis | A flirtatious dragonborn, with rose pink scales and a love of romance. She is a matchmaker and confidante, who knows how to bring people together. |\n| 84         | Valtharaxia | A brave dragonborn, with chartreuse scales and a love of justice. She is a superhero and defender, who fights for truth and goodness. |\n| 85         | Nalathorin | A brooding dragonborn, with slate gray scales and a troubled soul. He is an antihero and vigilante, who walks the line between good and evil. |\n| 86         | Zelathara | A gentle dragonborn, with butter yellow scales and a love of nature. She is a druid and protector, who has a deep connection to the earth and its creatures. |\n| 87         | Valthorath | A witty dragonborn, with electric blue scales and a rapier wit. He is a journalist and commentator, who always has something clever to say. |\n| 88         | Kethrox | A ruthless dragonborn, with jet black scales and a killer instinct. He is an assassin and mercenary, who will do anything for the right price. |\n| 89         | Zylthara | A vengeful dragonborn, with fiery red scales and\r\n\nChatbot reponse terminated unexpectedly: : length\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01 | Zarae | A striking and fierce priestess of Lolth, with dark hair and skin, and piercing violet eyes |\n| 02 | Sabryna | A manipulative and cunning noble of the drow courts, with long white locks and sharp features |\n| 03 | Xullrae | A rogue with an adventurous spirit, always seeking out new treasures and challenges |\n| 04 | Viconia | A calculating and intelligent wizard, with a no-nonsense attitude and a talent for destruction magic |\n| 05 | Drizzt | A rare exception among his people, Drizzt is a skilled ranger and warrior who rejects the cruel ways of the drow |\n| 06 | Erelhei-Cinlu | A ruthless and ambitious priestess of the drow goddess, Lolth, with a reputation for using any means necessary to achieve her aims |\n| 07 | Gromph Baenre | A powerful archmage and political schemer, with a vast network of spies and informants at his disposal |\n| 08 | Faeryl | A charismatic and curious bard, with a love for music and the finer things in life |\n| 09 | Zin-carla | An elusive and enigmatic assassin, feared throughout the Underdark for her deadly stealth and poison skills |\n| 10 | Liriel Baenre | A rebellious and impulsive teenage mage, with a mischievous streak and a talent for getting into trouble | \n| 11 | Zaknafein Do'Urden | A skilled and respected warrior, renowned for his prowess with the sword and his loyalty to House Do'Urden |\n| 12 | Quenthel Baenre | A calculating and manipulative priestess, with a reputation for destroying her enemies with powerful magic |\n| 13 | Dinin Do'Urden | A ruthless and ambitious warrior, determined to rise through the ranks of his house and gain power |\n| 14 | Ilvaria | A skilled and cunning thief, with a love for shiny objects and a talent for dodging trouble |\n| 15 | Triel Baenre | A sharp and intelligent matron mother, with a keen grasp of politics and a talent for manipulation |\n| 16 | Pharaun Mizzrym | A charming and smooth-talking rogue, with a quick wit and a talent for deception |\n| 17 | Gwydion | A mysterious and aloof ranger, always wandering the wilds and keeping to himself |\n| 18 | Lloth's Chosen | A group of deadly priestesses, each sworn to serve the will of Lolth and carry out her dark bidding |\n| 19 | Masoj Hun'ett | A zealous and devoted knight, always seeking to prove his worth to his goddess and his house |\n| 20 | Chaulssin | A secretive and powerful city that exists in its own pocket dimension, ruled by a council of the most powerful drow in existence |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Roll | Name | Description |\n| --- | --- | --- |\n| 01 | Tordek | A brutish duergar covered in scars, trained in hand-to-hand combat. |\n| 02 | Krag | A hardworking miner, known for their impeccable work ethic. |\n| 03 | Hurgar | An elderly and wise duergar, known for their extensive knowledge of geology. |\n| 04 | Grit | A ruthless duergar who will do whatever it takes to get what they want. |\n| 05 | Nundro | A master craftsman, known for their ability to create stunning works of art from the earth. |\n| 06 | Bupido | A devious duergar who has a talent for sneaking around and stealing things. |\n| 07 | Dugald | A devout follower of the dwarven pantheon, known for their steadfast faith. |\n| 08 | Sorn | A harsh and aggressive duergar, fiercely loyal to their clan. |\n| 09 | Hrym | A skilled warrior, known for their ability to take down foes in a matter of seconds. |\n| 10 | Barik | An introverted duergar who prefers the quiet life of a miner. |\n| 11 | Ulfgar | A boisterous and loud duergar, often found in the local tavern telling tall tales. |\n| 12 | Thardak | An ambitious and cunning duergar who has their sights set on ruling their clan. |\n| 13 | Erevan | An elusive and mysterious duergar, often disappearing for days at a time. |\n| 14 | Kilkax | A gruff and unsocial duergar, known for their distrust of outsiders. |\n| 15 | Duerath | A wise and experienced duergar, often sought after for their council. |\n| 16 | Drogan | A muscular and intimidating duergar, feared by many in the Underdark. |\n| 17 | Gruumsh | A duergar with a reputation for being hot-headed and impulsive. |\n| 18 | Krimm | A skilled blacksmith, often tasked with creating weapons for the clan. |\n| 19 | Nori | A talented cook, known for their delicious underground cuisine. |\n| 20 | Morgran | A cunning and manipulative duergar who always seems to have a hidden agenda. |\n| 21 | Grimgar | A duergar with a penchant for practical jokes, often at the expense of others. |\n| 22 | Drorn | An avid collector of rare underground artifacts and treasures. |\n| 23 | Druik | An experienced ranger, known for their ability to navigate the treacherous Underdark. |\n| 24 | Kragdar | A duergar with a deep-seated hatred for their surface-dwelling kin. |\n| 25 | Baelnar | A devoted family member, always putting the needs of their kin before their own. |\n| 26 | Ulhar | A fierce competitor, always looking for a challenge to prove their worth. |\n| 27 | Rolgan | A skilled negotiator, often acting as a spokesperson for the clan. |\n| 28 | Kilkran | A duergar who has abandoned their clan to pursue a life of adventure. |\n| 29 | Thordak | A proud and honorable duergar, fiercely loyal to their king and country. |\n| 30 | Hurdan | An adept illusionist, often using their magic to deceive and confuse others. |\n| 31 | Bolhur | An accomplished musician, known for their hauntingly beautiful songs. |\n| 32 | Thrarik | A suave and charming duergar, often wooing their way into the hearts of others. |\n| 33 | Krodar | A skilled huntress, known for her ability to track prey through the Underdark. |\n| 34 | Belgar | A devout follower of Laduguer, often leading ceremonies and rituals in his honor. |\n| 35 | Urgar | An experienced cartographer, known for their detailed maps of the Underdark. |\n| 36 | Skardak | A duergar with a deep love and appreciation for gems and precious stones. |\n| 37 | Fror | An idealistic duergar who dreams of a world where all dwarvenkind can live in harmony. |\n| 38 | Thuran | A skilled engineer, often tasked with creating traps and defenses for the clan's tunnels. |\n| 39 | Kragdar | A master of disguise, often infiltrating rival clans to gather intelligence. |\n| 40 | Hunnul | A stoic and reserved duergar, often keeping to themselves in social situations. |\n| 41 | Rarl | A wild and unpredictable duergar, often causing chaos wherever they go. |\n| 42 | Kethik | A skilled diplomat, often sent to negotiate with rival clans and factions. |\n| 43 | Bruenor | A grizzled and battle-worn duergar, with a multitude of scars to prove their bravery. |\n| 44 | Oleanne | A talented spellcaster, often using their magic to heal and protect their fellow duergar. |\n| 45 | Grisla | A restless and adventurous duergar who finds themselves constantly seeking out new experiences. |\n| 46 | Skjoldr | An expert weaponsmith, often creating custom weapons for the clan's warriors. |\n| 47 | Gethin | A cunning and resourceful duergar, always finding a way to get what they want. |\n| 48 | Drirge | An enigmatic duergar who rarely speaks, often leaving others guessing at their motives. |\n| 49 | Drogath | A skilled tactician, often leading the clan's warriors into battle. |\n| 50 | Thorkas | A ferocious duergar warrior known for their fearlessness and tenacity in battle. |\n| 51 | Arnbjorn | A gruff and straightforward duergar, not one to beat around the bush. |\n| 52 | Marta | A skilled hunter, often tasked with providing food for the clan. |\n| 53 | Drokki | An eccentric inventor, always tinkering with gadgets and gizmos in their workshop. |\n| 54 | Kraglin | A duergar with a love for the arts, often found scribbling in notebooks or composing songs. |\n| 55 | Halvar | A deeply compassionate duergar, often putting the needs of others before their own. |\n| 56 | Olafur | A master storyteller, often weaving tales of adventure and heroism. |\n| 57 | Grudgus | A solitary duergar who prefers the company of their own thoughts to that of others. |\n| 58 | Hrolf | An accomplished wrestler, known for their unmatched strength and agility. |\n| 59 | Jarnvargr | A shaman with a deep connection to the earth, often using their magic to protect the clan's mines. |\n| 60 | Kethil | A docile and peaceful duergar who abhors violence of any kind. |\n| 61 | Frida | A talented painter, often capturing the beauty of the Underdark in their art. |\n| 62 | Bjarke | An accomplished mountaineer, often leading expeditions to the highest peaks of the Underdark. |\n| 63 | Horfinn | A skilled archer, known for their deadly accuracy and precision. |\n| 64 | Torhild | An intuitive healer, often using their magic to aid injured or sick duergar. |\n| 65 | Mazur | A duergar with a deep love of books and learning, often found buried in a tome. |\n| 66 | Onund | An accomplished smith, often creating intricate pieces of armor and weaponry. |\n| 67 | Thorbjorn | A duergar with a love for nature, often tending to the fungi gardens that line the clan's tunnels. |\n| 68 | Jorunn | A skilled acrobat, often performing daring feats of agility and strength. |\n| 69 | Nydala | A skilled geologist, often studying and mapping the many layers of rock that make up the Underdark. |\n| 70 | Dagur | A wise and respected duergar elder, often sought after for their counsel on matters of the clan. |\n| 71 | Adalstein | A skilled locksmith, often tasked with creating the many locks and keys that secure the clan's tunnels. |\n| 72 | Oddvar | A fervent believer in the tenets of Laduguer, often preaching the values of loyalty and duty to their fellow duergar. |\n| 73 | Gersemi | A duergar with a love for fashion, often designing and creating intricate garments for their fellow clan members. |\n| 74 | Halldor | A skilled musician, often entertaining their fellow duergar with their melodies. |\n| 75 | Rorik | A skilled navigator, often leading expeditions through the twisting tunnels of the Underdark. |\n| 76 | Runa | A skilled scribe, often tasked with keeping the clan's records and histories. |\n| 77 | Thorleif | A duergar with a deep love for animals, often found tending to the many creatures that live within the clan's walls. |\n| 78 | Vigdis | An adventurous duergar who finds their true calling in exploring the uncharted reaches of the Underdark. |\n| 79 | Brynhild | A skilled blacksmith, often tasked with creating weapons and armor for the clan's warriors. |\n| 80 | Eirikr | A quiet and introspective duergar who often spends their days in deep contemplation and meditation. |\n| 81 | Svein | An accomplished chef, known for their creative use of Underdark ingredients in their dishes. |\n| 82 | Grim | A fearless duergar warrior, often first into battle and last to leave. |\n| 83 | Ormur | A skilled wrestler, known for their ability to take down much larger opponents. |\n| 84 | Thulinn | An ambitious and cunning duergar, willing to do whatever it takes to gain power and influence. |\n| 85 | Roeid | A skilled alchemist, often creating potions and elixirs to aid their fellow duergar. |\n| 86 | Brynjar | A duergar with a love for puzzles and riddles, often challenging their fellow clan members to solve their creations. |\n| 87 | Audhild | A skilled weaver, often creating intricate tapestries and rugs. |\n| 88 | Sigrid | A skilled navigator, often charting new routes through the Underdark. |\n| 89 | Orlygg | A duergar with a love for the stars, often studying the night sky despite being deep below ground. |\n| 90 | Hrapp | A born leader, often looked to as the de facto leader of their clan. |\n| 91 | Herjolf | A skilled carpenter, often tasked with building and repairing the structures within the clan's walls. |\n| 92 | Asgrim | A duergar with a love for puzzles, often creating elaborate mazes deep within the Underdark. |\n| 93 | Eirikur | A skilled navigator, known for their ability to find their way through the most treacherous of tunnels. |\n| 94 | Gudrid | An accomplished astronomer, often providing insights into the workings of the cosmos beyond the Underdark. |\n| 95 | Sigrun | A skilled warrior, known for their ability to fight with both weapons and magic. |\n| 96 | Leifur | A fearless explorer, often venturing into the unknown reaches of the Underdark. |\n| 97 | Olvir | A skilled survivalist, known for their ability to thrive in even the harshest of conditions. |\n| 98 | Thrymr | A master of disguise, often infiltrating rival clans to sow dissent and chaos. |\n| 99 | Thorvald | A stoic and reserved duergar, often keeping their emotions in check even in the most trying of circumstances. |\n| 100 | Eirik | A skilled diplomat, often sent to negotiate peace treaties and alliances with other clans and factions. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| **Dice Roll** | **Name** | **Description** |\n|:-------------:|:--------:|:---------------:|\n| 01            | Balin    | A stout and stocky dwarf with a long beard of braids. He is known for his quick temper and fierce loyalty to his kin. |\n| 02            | Bifur    | A gruff and no-nonsense dwarf with a bushy beard. He is a skilled blacksmith and takes great pride in his work. |\n| 03            | Dwalin   | A rugged dwarf with a scar over his left eye. He has a dry sense of humor and is a fierce warrior. |\n| 04            | Fili     | A young and adventurous dwarf with a beardless chin. He has a reckless streak but is fiercely loyal to his friends. |\n| 05            | Gimli    | A boisterous dwarf with a fiery spirit. He is quick to action and never backs down from a challenge. |\n| 06            | Grimgor  | A brooding dwarf with a dark demeanor. He is fiercely independent and suspicious of outsiders. |\n| 07            | Hugin    | A studious dwarf with a keen intellect. He is a skilled tinkerer and is always inventing new gadgets. |\n| 08            | Kili     | A curious and adventurous dwarf with a mischievous streak. He is always looking for the next thrill. |\n| 09            | Nar    | A grumpy old dwarf with a heavily scarred face. He has a sharp tongue and is quick to criticize. |\n| 10            | Ori    | A meek and mild-mannered dwarf with a sharp mind. He is a talented scribe and takes great pride in his work. |\n| 11            | Thorin   | A regal dwarf with a majestic beard. He is a born leader and commands great respect from his kin. |\n| 12            | Thrarin  | A wise and ancient dwarf who has seen many battles. He is a skilled strategist and is highly respected among his kin. |\n| 13            | Agdag   | A jovial dwarf with a round belly and hearty laugh. He is a master brewer and takes great pride in his ales. |\n| 14            | Bardi   | A skilled archer with an eagle eye. He is a quiet and reserved dwarf who prefers solitude. |\n| 15            | Drog    | A brutish and imposing dwarf with a fierce scowl. He is a skilled blacksmith and takes great pride in his work. |\n| 16            | Eitri   | A master craftsman with a steady hand. He is highly respected among his kin for his skill at the forge. |\n| 17            | Faldor   | A jovial and friendly dwarf with a warm smile. He is a skilled diplomat and enjoys meeting new people. |\n| 18            | Gildor   | A dashing and charismatic dwarf with a silver tongue. He is known for his wit and charm. |\n| 19            | Hildur   | A fierce warrior with a scarred face. She is a skilled fighter and is highly respected among her kin. |\n| 20            | Hogarth   | A burly and hearty dwarf with a booming voice. He is a skilled hunter and tracker. |\n| 21            | Kjell    | A stoic and reserved dwarf with a deep voice. He is a skilled stonemason and enjoys working with his hands. |\n| 22            | Nori    | A crafty and resourceful dwarf with a talent for thievery. He is often seen with a mischievous grin on his face. |\n| 23            | Ourin   | A pious and devout dwarf with a deep love of the gods. He is often seen in prayer and leads his kin in worship. |\n| 24            | Ovindur | A wandering dwarf with a restless spirit. He is always looking for new adventures and challenges. |\n| 25            | Rurik   | A skilled navigator with an encyclopedic knowledge of maps. He is a quiet and reserved dwarf who prefers the company of his maps. |\n| 26            | Thane   | A proud and arrogant dwarf with a regal bearing. He is a skilled warrior and takes great pride in his victories. |\n| 27            | Thrain  | A well-read and erudite dwarf with a sharp mind for history. He is often consulted for his knowledge of ancient lore. |\n| 28            | Viggo   | A quiet and introspective dwarf with a sharp eye. He is a skilled archer and takes pride in his marksmanship. |\n| 29            | Wilfred | A jolly and boisterous dwarf with a good sense of humor. He enjoys the company of others and is always quick with a joke. |\n| 30            | Yorick  | A grizzled old dwarf with a long beard and a permanent scowl. He is highly respected among his kin for his wisdom. |\n| 31            | Alaric | An accomplished fighter and skilled strategist who has retired from adventuring. He now runs a successful mercenary company. |\n| 32            | Anselm | A skilled blacksmith who runs his own forge. He is particularly skilled at creating ornate weapons and armor. |\n| 33            | Dagny | A fierce warrior and skilled tracker who hunts the dangerous beasts of the mountains. |\n| 34            | Einar  | A reclusive dwarf who lives deep in the mountains. He is an expert in mining and metalworking. |\n| 35            | Frithjof | A wise and respected elder who is often called upon to settle disputes within the clan. |\n| 36            | Gest | A skilled alchemist who brews potions and elixirs. He is a recluse who rarely leaves his laboratory. |\n| 37            | Gunnar | A skilled bowyer who crafts fine bows of all sizes. |\n| 38            | Halvar | A master of unlocking and disarming traps. He is often called upon to assist adventurers in dangerous tombs and dungeons. |\n| 39            | Ingemar | A skilled navigator and seafarer who captains a ship from the port city. |\n| 40            | Kjeld | A skilled woodworker who specializes in crafting fine furniture and artwork. |\n| 41            | Leif | A skilled leatherworker who crafts fine armor and clothing. |\n| 42            | Magnus | A skilled carpenter who builds sturdy structures and constructs siege engines. |\n| 43            | Oddvar | A skilled cook who prepares elaborate feasts for festive occasions. |\n| 44            | Ragnar | A skilled miner who extracts rare minerals and gems from the depths of the mountains. |\n| 45            | Sigmund | A skilled calligrapher who produces fine works of art and beautiful documents. |\n| 46            | Snorri | A skilled musician who plays a variety of instruments. He is often hired for festive occasions. |\n| 47            | Thorfinn | A skilled armorer who is famous for crafting some of the finest armor in the land. |\n| 48            | Torsten | A skilled apothecary who brews potent poisons and deadly antidotes. |\n| 49            | Ulf | A skilled weaver who creates fine tapestries and other textiles. |\n| 50            | Valdemar | A skilled jeweler who crafts fine jewelry for the wealthy and powerful. |\n| 51            | Vigdis | A skilled brewer who creates exotic and flavorful ales. She is always looking for new ingredients to experiment with. |\n| 52            | Alvis | A blind dwarf who uses his other senses to navigate the world. He is a skilled storyteller and shares his tales with all who will listen. |\n| 53            | Balder | A talented painter who creates beautiful landscapes and still lifes. |\n| 54            | Darrin | A skilled butcher who provides meat to the local community. |\n| 55            | Egil | A skilled falconer who is often seen with his loyal bird of prey. |\n| 56            | Freyja | A skilled healer who uses natural remedies to treat illness and injury. She is a devout follower of the goddess of healing. |\n| 57            | Gudrun | A skilled weaver who creates fine fabrics for clothing and decorative purposes. |\n| 58            | Halfdan | A skilled engraver who etches beautiful designs onto metal and stone. |\n| 59            | Ingrid | A skilled mapmaker who creates accurate and detailed maps of the local area. |\n| 60            | Jorunn | A skilled lumberjack who harvests wood from the nearby forests. |\n| 61            | Kelda | A skilled midwife who assists in childbirth and provides medical care to expectant mothers. |\n| 62            | Kvasir | A skilled vintner who produces some of the finest mead in the land. |\n| 63            | Mimir | A wise and ancient dwarf who is said to possess vast knowledge. He rarely speaks and is often consulted for advice. |\n| 64            | Modar | A skilled potter who creates beautiful ceramics and pottery. |\n| 65            | Odd | A skilled fisherman who provides fresh fish to the local community. |\n| 66            | Rolf | A skilled shipwright who builds and repairs boats and ships. |\n| 67            | Sigfrid | A skilled weaver who creates intricate tapestries that tell stories and depict great battles. |\n| 68            | Sven | A skilled carpenter who specializes in constructing siege weapons and other military hardware. |\n| 69            | Thorgal | A skilled sailor who captains a ship that plies the treacherous seas. |\n| 70            | Thorvald | A skilled tracker who hunts the elusive beasts of the forests and grasslands. |\n| 71            | Ulfred | A skilled hunter who is known for his deadly accuracy with a bow. |\n| 72            | Yngvar | A skilled metalsmith who crafts fine works of art and ornate jewelry. |\n| 73            | Alfhild | A skilled alchemist who specializes in creating magical potions and elixirs. |\n| 74            | Bjorn | A skilled tanner who produces fine leather goods. |\n| 75            | Dagna | A skilled glassblower who creates beautiful vessels and objects of art. |\n| 76            | Edda | A skilled sculptor who creates beautiful statues and works of art. |\n| 77            | Fafnir | A skilled taxidermist who preserves the beasts of the land. |\n| 78            | Gorm | A skilled gemcutter who produces finely crafted gems and jewelry. |\n| 79            | Haki | A skilled armorcrafter who specializes in creating armor of the highest quality. |\n| 80            | Helga | A skilled farmer who raises crops and livestock. |\n| 81            | Ivar | A skilled brewer who produces a wide variety of ales and beers. |\n| 82            | Jarl | A skilled blacksmith who creates masterpieces of metal and steel. |\n| 83            | Kari | A skilled weaver who creates beautiful fabrics and textiles. |\n| 84            | Lief | A skilled carpenter who builds houses and furniture. |\n| 85            | Magnusson | A skilled sailor who captains a ship that plies the shipping lanes between distant ports. |\n| 86            | Njal | A skilled basketweaver who creates beautiful and functional baskets of all shapes and sizes. |\n| 87            | Olafson | A skilled woodcarver who creates intricate works of art from wood. |\n| 88            | Petursson | A skilled furrier who produces fine garments from the pelts of local creatures. |\n| 89            | Ragnarsson | A skilled stonemason who creates beautiful buildings and monuments. |\n| 90            | Sigrid | A skilled seamstress who creates fine garments and clothing. |\n| 91            | Thorhalla | A skilled baker who produces breads, pastries, and other baked goods. |\n| 92            | Torvaldsson | A skilled engraver who creates beautiful designs on metal and stone. |\n| 93            | Ulfsson | A skilled metalworker who creates intricate designs in metal and steel. |\n| 94            | Valdis | A skilled candlemaker who creates beautiful and fragrant candles of all shapes and sizes. |\n| 95            | Ylva | A skilled leatherworker who creates fine leather goods of all kinds. |\n| 96            | Aslaug | A highly skilled tracker who is known for her ability to find even the most elusive prey. |\n| 97            | Friorik | A skilled glassmaker who creates beautiful vessels and other objects of art from glass. |\n| 98            | Gudbrand | A skilled basketmaker who creates beautiful and functional baskets of all kinds. |\n| 99            | Halldor | A highly skilled metalworker who produces intricate and ornate works of art. |\n| 100           | Thorgny | A highly skilled blacksmith who creates masterpieces from metal and steel. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value |         Name        |                 Description                |\n|:----------:|:-------------------:|:------------------------------------------|\n| 1          | Althaea Windrider   | A curious elf with a love for all things aerial.|\n| 2          | Faralinith Moonwhisper | A mystic elf with a silver tongue and a penchant for divination.|\n| 3          | Lairelosse Leafwalker | A somber elf who seems to have a deep connection to nature.|\n| 4          | Naivara Silverbranch | An elf who is obsessed with the stars and the beauty of the night sky.|\n| 5          | Philethise Loreweaver | An analytical elf who has a vast wisdom of the arcane.|\n| 6          | Aerin Broadleaf | An elf who takes pride in her garden, preferring a rustic lifestyle over fashion.|\n| 7          | Amrunelara Starfade | A witty and acrobatic elf, this rogue is known for her dexterity and mischievous ways.|\n| 8          | Arlathan Goldeneyes | This elf has a confident air and a sharp gaze. He's known to be a skilled hunter and tracker.|\n| 9          | Celandine Duskbloom | This elf is a devout follower of the goddess of love and beauty, and often wears elaborately embroidered clothes.|\n| 10         | Erendriel Silvermane | An elf with a noble aura, well-spoken and highly educated.|\n| 11         | Gilthanas Bladeleaf | A skilled warrior, Gilthanas has a reputation for being both brave and reckless.|\n| 12         | Helvorn Nightshade | An elf with a shadowy aura, Helvorn is reputed to have ties to the underworld. |\n| 13         | Inairi Moonblade | A nimble and elusive elf, she is always seen with her twin daggers at the ready. |\n| 14         | Lithariel Thundersong | A stoic elf with a warrior's spirit. She has a natural authority that commands respect. |\n| 15         | Naiymeth Evernight | A solitary elf with a melancholic aura, she speaks only when necessary but her words are always meaningful. |\n| 16         | Rathalindiel Forestwatcher | A curious and idealistic elf who is driven by a desire to explore uncharted lands. |\n| 17         | Saelihn Blackthorn | A skilled archer, her arrows are said to never miss their mark. |\n| 18         | Thelwynn Shadowmist | An elf with a dark past, Thelwynn often keeps to herself and seldom speaks of anything personal. |\n| 19         | Zephyrus Skyweaver | An elf who possesses a gift for diplomacy, he has a talent for finding common ground with even the most unlikely of allies. |\n| 20         | Aelithen Greenbough | A cheerful elf with a love for animals, she has an innate talent for communicating with even the wildest beasts. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 01         | Abia  | Female Earth Genasi with green skin and sparkling brown eyes who can control plants at will. She's shy but kind-hearted. |\n| 02         | Silex | Male Fire Genasi with red skin and fiery orange eyes who can ignite his body to deal damage to enemies. He's brash and quick to anger. |\n| 03         | Zephyr | Non-binary Air Genasi with pale blue skin and gentle white eyes who can fly with ease. They're serene and detached. |\n| 04         | Terre | Female Earth Genasi with brown skin and strong features who can create minor earthquakes when angry. She's tough and no-nonsense. |\n| 05         | Pyr | Male Fire Genasi with charcoal black skin and intense red eyes who can set objects aflame with a touch. He's arrogant and impulsive. |\n| 06         | Nubis | Non-binary Water Genasi with dark blue skin and hauntingly beautiful eyes who can breathe underwater and talk to marine life. They're mysterious and unpredictable. |\n| 07         | Caven | Male Earth Genasi with gray skin and piercing green eyes who can sink into the ground and tunnel through soil. He's gruff and blunt. |\n| 08         | Auri | Female Air Genasi with silver skin and delicate features who can bend the wind to her will. She's quiet and elusive. |\n| 09         | Ignis | Male Fire Genasi with copper skin and eyes that glow like embers who can manipulate flames to his advantage. He's cunning and fiercely independent. |\n| 10         | Marina | Female Water Genasi with pale green skin and eyes like clear water who can summon rain and create water-based obstacles. She's cheerful and helpful. |\n| 11         | Galem | Male Air Genasi with sky-blue skin and windswept hair who can create gusts of wind and fly effortlessly. He's carefree and charming. |\n| 12         | Thule | Non-binary Earth Genasi with rocky brown skin and cold black eyes who can cause earthquakes and rock slides at will. They're blunt and practical. |\n| 13         | Fira | Female Fire Genasi with bright orange skin and piercing yellow eyes who can create large fireballs to hurl at enemies. She's bold and confident. |\n| 14         | Riva | Non-binary Water Genasi with turquoise skin and hair that looks like seaweed who can breathe underwater and summon friendly sea creatures to aid them in battle. They're self-assured and adventurous. |\n| 15         | Aura | Female Air Genasi with sky-blue skin and a gentle smile who can move around silently and create gusts of wind. She's calm and reserved. |\n| 16         | Tereza | Non-binary Earth Genasi with dark brown skin and kind eyes who can control vines, roots, and other plant life. They're nurturing and protective. |\n| 17         | Asher | Male Fire Genasi with ash-gray skin and piercing red eyes who can conjure smoke and fire to confuse enemies. He's cunning and secretive. |\n| 18         | Ocean | Female Water Genasi with azure skin and hair that shimmers like pearls who can manipulate water and create water-based illusions. She's mysterious and graceful. |\n| 19         | Vento | Male Air Genasi with pale skin and white hair who can create sharp gusts of wind and fly for short periods of time. He's aloof and sarcastic. |\n| 20         | Geo | Non-binary Earth Genasi with tan skin and sparkling green eyes who can meld with stone and tunnel through rock. They're knowledgeable and curious. |\n| 21         | Flamme | Female Fire Genasi with dark red skin and eyes that blaze like the sun who can set objects ablaze with a glance. She's fierce and fearless. |\n| 22         | Bora | Non-binary Air Genasi with silver skin and feathers in their hair who can summon great storms and gusts of wind. They're wild and unpredictable. |\n| 23         | Sylphie | Female Air Genasi with light blue skin and cloud-like hair who can create small tornadoes and levitate objects with her mind. She's whimsical and creative. |\n| 24         | Roca | Non-binary Earth Genasi with brown skin and deep-set eyes who can cause boulders and rocks to levitate. They're grounded and focused. |\n| 25         | Helios | Male Fire Genasi with golden skin and eyes like molten lava who can create searing beams of light to blind enemies. He's proud and haughty. |\n| 26         | Zephyra | Female Air Genasi with pastel pink skin and delicate features who can manipulate air and levitate objects. She's soft-spoken and kind-hearted. |\n| 27         | Terra | Non-binary Earth Genasi with rich brown skin and strong features who can control stone and transform into earth itself. They're stoic and wise. |\n| 28         | Igneous | Male Fire Genasi with deep reddish-brown skin and a sharp gaze who can create walls of fire and molten rock. He's hot-headed and competitive. |\n| 29         | Maritza | Female Water Genasi with deep green skin and hair that billows like seaweed who can create whirlpools and tidal waves. She's adventurous and confident. |\n| 30         | Aerin | Non-binary Air Genasi with pale skin and feathery hair who can control the flow of air and become invisible. They're quiet and introspective. |\n| 31         | Gaia | Female Earth Genasi with brown skin and sparkling green eyes who can make plants grow and flourish even in the harshest conditions. She's nurturing and compassionate. |\n| 32         | Pyrrhus | Male Fire Genasi with dark red skin and eyes that smolder like coals who can ignite his body and deal immense fire damage. He's reckless and volatile. |\n| 33         | Coral | Female Water Genasi with pinkish skin and hair like coral who can breathe underwater and swim at incredible speeds. She's playful and flirtatious. |\n| 34         | Aether | Non-binary Air Genasi with shimmering silver skin and hair who can fly without wings and create powerful storms. They're enigmatic and otherworldly. |\n| 35         | Onyx | Male Earth Genasi with deep black skin and piercing green eyes who can create walls and objects out of stone. He's intimidating and brooding. |\n| 36         | Blaze | Non-binary Fire Genasi with fiery red skin and eyes that burn with intensity who can create bursts of fire and molten rock to attack foes. They're passionate and fierce. |\n| 37         | Marina | Female Water Genasi with pale blue skin and hair like seashells who can control water and summon aquatic creatures. She's bubbly and kind-hearted. |\n| 38         | Gale | Non-binary Air Genasi with wispy white hair and eyes that glow like the moon who can create powerful gusts of wind and cold air. They're aloof and detached. |\n| 39         | Serra | Female Earth Genasi with tan skin and hair like dried grass who can manipulate stone and create tunnels and passages underground. She's pragmatic and resourceful. |\n| 40         | Cinder | Male Fire Genasi with ashen skin and eyes like embers who can create explosions and traps out of fire and ash. He's calculating and ruthless. |\n| 41         | Naida | Non-binary Water Genasi with turquoise skin and hair that flows like water who can breathe underwater and control aquatic life. They're serene and mysterious. |\n| 42         | Anemo | Female Air Genasi with yellow-green skin and hair like sunlight who can create whirlwinds and gusts of wind to attack and control enemies. She's fierce and headstrong. |\n| 43         | Clay | Male Earth Genasi with reddish-brown skin and eyes that glow like fire who can control clay and create earthen golems to fight for him. He's stoic and practical. |\n| 44         | Aurelia | Non-binary Fire Genasi with golden skin and eyes like the sun who can create intense bursts of light and heat. They're confident and charismatic. |\n| 45         | Oceane | Female Water Genasi with aquamarine skin and hair like seafoam who can control water and create strong currents. She's adventurous and free-spirited. |\n| 46         | Tempest | Non-binary Air Genasi with gray skin and hair like dark clouds who can create lightning bolts and thunderstorms. They're intense and unpredictable. |\n| 47         | Malik | Male Earth Genasi with deep brown skin and piercing green eyes who can control soil and plant life to ensnare and trap enemies. He's serious and analytical. |\n| 48         | Vulcan | Non-binary Fire Genasi with orange-red skin and eyes like molten lava who can create magma and molten rock to damage enemies. They're impulsive and volatile. |\n| 49         | Oceanus | Male Water Genasi with blue-green skin and hair like seaweed who can create waves and control the ocean's tides. He's calm and contemplative. |\n| 50         | Nimbus | Non-binary Air Genasi with lavender skin and hair like clouds who can create mist and fog to obscure enemies' vision. They're mysterious and enigmatic. |\n| 51         | Petra | Female Earth Genasi with rough brown skin and sharp features who can control stone and create powerful earthquakes. She's no-nonsense and blunt. |\n| 52         | Ember | Non-binary Fire Genasi with orange-gold skin and eyes that blaze like the sun who can ignite flammable objects and create powerful blasts of fire. They're daring and passionate. |\n| 53         | Delta | Female Water Genasi with deep blue skin and hair like dark waters who can create whirlpools and control aquatic creatures. She's clever and resourceful. |\n| 54         | Aetherius | Non-binary Air Genasi with shimmering silver skin and hair like stardust who can create powerful gusts of wind and teleport short distances. They're aloof and distant. |\n| 55         | Terrin | Male Earth Genasi with rocky gray skin and piercing green eyes who can create fissures and valleys in the earth. He's stubborn and headstrong. |\n| 56         | Phoenix | Non-binary Fire Genasi with golden-red skin and eyes like molten gold who can ignite their entire body in flame and resurrect from the ashes. They're proud and fierce. |\n| 57         | Tidal | Female Water Genasi with rippling blue skin and hair that sways like kelp who can create powerful waves and control the flow of water. She's easy-going and fun-loving. |\n| 58         | Cirrus | Non-binary Air Genasi with pale blue skin and hair like wispy clouds who can create gusts of wind and control the weather. They're carefree and whimsical. |\n| 59         | Gorge | Male Earth Genasi with rough brown skin and lanky features who can create massive sinkholes and pits in the earth. He's pessimistic and cynical. |\n| 60         | Ash | Non-binary Fire Genasi with ashen gray skin and eyes that smolder like coals who can create smokescreens and singe enemies with fire. They're quiet and introverted. |\n| 61         | Lagoon | Female Water Genasi with aqua skin and hair like rippling water who can create calm pools and violent currents at will. She's relaxed and peaceful. |\n| 62         | Sky | Non-binary Air Genasi with white skin and hair that seems to merge with the clouds who can create storms and control the flow of air. They're aloof and introspective. |\n| 63         | Gaia | Female Earth Genasi with brown skin and sparkling brown eyes who can create small earthquakes and manipulate plant life. She's nurturing and kind. |\n| 64         | Ignis | Non-binary Fire Genasi with deep bronze skin and eyes that glow like embers who can create powerful blasts of heat and control objects made of fire. They're passionate and bold. |\n| 65         | Tarn | Male Water Genasi with dark blue skin and hair like seaweed who can create murky clouds in water and control aquatic creatures. He's mysterious and reserved. |\n| 66         | Cyclone | Non-binary Air Genasi with sky-blue skin and hair that whips around like a cyclone who can create dangerous winds and control the direction of storms. They're impulsive and reckless. |\n| 67         | Rhea | Female Earth Genasi with tan skin and hair like wheat who can create powerful quakes and control soil and rock. She's practical and no-nonsense. |\n| 68         | Blaze | Non-binary Fire Genasi with copper skin and eyes that blaze like the sun who can create deadly flames and control objects made of fire. They're competitive and quick-tempered. |\n| 69         | Marina | Female Water Genasi with turquoise skin and hair like sea foam who can control the tides and create whirlpools. She's adventurous and free-spirited. |\n| 70         | Aeolus | Non-binary Air Genasi with shimmering silver skin and hair like wispy clouds who can create powerful gusts of wind and teleport short distances. They're mysterious and aloof. |\n| 71         | Crag | Male Earth Genasi with rough brown skin and deep-set eyes who can create deep chasms and tunnels in rock. He's tenacious and determined. |\n| 72         | Ember | Non-binary Fire Genasi with vermilion skin and eyes like hot coals who can create blazing veins of flame and shoot scorching fireballs. They're intense and headstrong. |\n| 73         | Coral | Female Water Genasi with pale blue skin and hair like coral who can create coral reefs and raise aquatic creatures. She's whimsical and playful. |\n| 74         | Nimbus | Non-binary Air Genasi with slate-gray skin and hair like swirling clouds who can create fog and control the weather. They're distant and enigmatic. |\n| 75         | Gaian | Male Earth Genasi with rough brown skin and eyes like deep earth who can control plants and summon earthen creatures. He's practical and reliable. |\n| 76         | Solar | Non-binary Fire Genasi with golden skin and eyes like the sun who can create intense beams of light and control objects made of fire. They're bold and charismatic. |\n| 77         | Lagoon | Female Water Genasi with azure skin and hair like rippling water who can create calm pools and powerful currents. She's relaxed and easy-going. |\n| 78         | Tempest | Non-binary Air Genasi with gray skin and hair like storm clouds who can create powerful gusts of wind and summon lightning bolts. They're intense and unpredictable. |\n| 79         | Petra | Female Earth Genasi with lanky brown skin and sharp features who can create deep fissures and summon golem-like creatures made of stone. She's stoic and practical. |\n| 80         | Ash | Non-binary Fire Genasi with ashen gray skin and eyes that smolder like coals who can create smokescreens and flames to disorient and damage enemies. They're quiet and introspective. |\n| 81         | Grotto | Female Water Genasi with green skin and hair like seaweed who can create powerful waves and raise sandbars to create new land. She's adventurous and bold. |\n| 82         | Zephyrus | Non-binary Air Genasi with turquoise skin and hair like sea foam who can create gusts of wind and fly with ease. They're elusive and mysterious. |\n| 83         | Rhea | Female Earth Genasi with tan skin and hair like wheat who can create powerful earthquakes and control the flow of soil. She's practical and reliable. |\n| 84         | Helios | Male Fire Genasi with golden skin and eyes like molten lava who can create beams of light and searing heat. He's confident and haughty. |\n| 85         | Cascade | Non-binary Water Genasi with deep blue skin and hair that falls like waterfalls who can create powerful waves and summon sea creatures. They're mysterious and serene. |\n| 86         | Bree | Female Air Genasi with pale skin and hair that whips in the wind who can create gusts of air and control the direction of storms. She's curious and friendly. |\n| 87         | Crust | Male Earth Genasi with rough brown skin and piercing green eyes who can create powerful quakes and control the flow of rock and soil. He's stubborn and headstrong. |\n| 88         | Blaze | Non-binary Fire Genasi with fiery red skin and eyes that burn like coals who can create powerful bursts of fire and molten rock. They're intense and reckless. |\n| 89         | Marina | Female Water Genasi with azure skin and hair like seaweed who can control the tides and summon aquatic creatures. She's adventurous and playful. |\n| 90         | Tornado | Non-binary Air Genasi with white skin and hair that whips around like a tornado who can create deadly winds and control the weather. They're intense and unpredictable. |\n| 91         | Petra | Female Earth Genasi with tan skin and hair like wheat who can create deep fissures and control stone. She's practical and steadfast. |\n| 92         | Cinder | Non-binary Fire Genasi with ashen skin and eyes that smolder like coals who can create smokescreens and conjure flames to damage enemies. They're quiet and enigmatic. |\n| 93         | Wave | Female Water Genasi with pale blue skin and hair that flows like water who can create tidal waves and summon aquatic creatures. She's free-spirited and adventurous. |\n| 94         | Nimbus | Non-binary Air Genasi with light blue skin and hair that sways like a cloud who can create mist and control the weather. They're mysterious and introspective. |\n| 95         | Geode | Male Earth Genasi with rough brown skin and eyes like glittering crystals who can create powerful quakes and control stone and crystal. He's practical and analytical. |\n| 96         | Blaze | Non-binary Fire Genasi with copper-orange skin and eyes that blaze like the sun who can create powerful bursts of flame and molten rock. They're competitive and fiery. |\n| 97         | Ocean | Female\r\n\nChatbot reponse terminated unexpectedly: : length\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01-05 | Alvi Steamwhistle | Alvi is a curious gnome who is never seen without her trusty magnifying glass. She has wild curly hair and is always tinkering with some gadget or contraption. |\n| 06-10 | Bimble Cogwright | Bimble is a short and stout gnome who always wears a pair of thick spectacles. He is an expert in clockwork mechanics and can repair just about anything. |\n| 11-15 | Cinda Copperpots | Cinda is a friendly and bubbly gnome with a knack for cooking. She runs the town's best bakery and always has a sweet treat for her friends. |\n| 16-20 | Diggory Gearspinner | Diggory is a serious-minded gnome who can always be found with his nose buried in a book. He is a scholar and historian, specializing in dwarven ruins and artifacts. |\n| 21-25 | Elvira Steamgear | Elvira is a mischievous gnome with a love of practical jokes. She works as a tinker and inventor and is always coming up with new and inventive gadgets to play pranks with. |\n| 26-30 | Flick Copperplume | Flick is a spry and energetic gnome who loves the thrill of adventure. He is a skilled rogue and always up for a good heist or treasure hunt. |\n| 31-35 | Glimmer Glassfrost | Glimmer is a shy and introverted gnome who works as a glassblower. She creates intricate and delicate works of art, but is always nervous when showing them to others. |\n| 36-40 | Higgles Highgrip | Higgles is a gruff and no-nonsense gnome who runs the town's forge. He is a skilled blacksmith and always has a quick retort for anyone who questions his work. |\n| 41-45 | Ilsa Ironspark | Ilsa is a bold and adventurous gnome who makes her living by exploring and mapping uncharted caves and caverns. She is always looking for the next great discovery. |\n| 46-50 | Jingle Jangle | Jingle is a cheerful and boisterous gnome who sings and dances at every opportunity. She is a bard by trade and loves to entertain others with her music and stories. |\n| 51-55 | Kipper Tinkerton | Kipper is a gregarious gnome who can talk his way out of any situation. He is a traveling merchant and always has a deal for his friends. |\n| 56-60 | Lily Luminous | Lily is a serene and peaceful gnome who practices the healing arts. She is a cleric and always willing to give aid to those in need. |\n| 61-65 | Mimsy Moonstone | Mimsy is a dreamy and whimsical gnome who is always lost in her own thoughts. She works as a potion maker and is known for her elixirs with unusual effects. |\n| 66-70 | Nimble Nimblesparks | Nimble is a hyperactive and lively gnome who loves to run and jump and play. She is a ranger and always ready for an adventure in the great outdoors.|\n| 71-75 | Ollie Oddfellow | Ollie is an eccentric and idiosyncratic gnome who is always experimenting with bizarre and unusual magic. He is a wizard and always has an unexpected solution to any problem. |\n| 76-80 | Penelope Pockets | Penelope is a sly and cunning gnome who has a talent for picking locks and pockets. She is a skilled thief and always ready for a good burglary. |\n| 81-85 | Quibbles Quizzlemire | Quibbles is a fussy and fastidious gnome who has a passion for rare and exotic plants. He is a druid and always seeking out new specimens to add to his collection. |\n| 86-90 | Rufus Ratchet | Rufus is a grumpy and irascible gnome who is never satisfied with his work. He is an artificer and always tinkering with his creations, but is never quite happy with the results. |\n| 91-95 | Tilly Tumbletop | Tilly is a whimsical and playful gnome who always has a smile on her face. She works as a jester and entertainer and loves to make others laugh. |\n| 96-00 | Zipper Zoetrope | Zipper is a daring and intrepid gnome who has a love for flying and soaring through the skies. She is a pilot and always looking for the next great airborne challenge. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01 | Grub | A tiny goblin with a love for large meals. Often found searching for scraps. |\n| 02 | Snik | A sneaky goblin who loves nothing more than stealing shiny objects from unsuspecting adventurers. |\n| 03 | Gack | This goblin is covered in scars from battles won and lost. Has a fierce determination in combat. |\n| 04 | Krog | A portly goblin who loves to gamble. Often found betting on anything he can. |\n| 05 | Zazzle | This goblin is covered in glittering trinkets and loves to adorn herself with jewelry. |\n| 06 | Skreek | A goblin who loves to tinker with machines and traps. Often found in deep concentration on his latest invention. |\n| 07 | Grish | This goblin is unusually tall and skinny. Has a knack for climbing and hiding in tight spaces. |\n| 08 | Krunk | A goblin who has a love for music. Often found humming or singing folk songs to himself. |\n| 09 | Snarly | A fierce goblin with sharp teeth and a quick temper. Not one to be crossed lightly. |\n| 10 | Glimmer | This goblin loves shiny things and often hoards them in her lair. Has a soft spot for gems. |\n| 11 | Hork | A goblin with a gruff personality. Often found barking orders to his underlings. |\n| 12 | Splint | This goblin has a fascination with bones and often decorates his lair with them. |\n| 13 | Drog | A goblin who loves to play practical jokes on his fellow goblins. |\n| 14 | Fizzle | This goblin is covered in burn marks from failed experiments with fire. |\n| 15 | Trog | A goblin who loves a good brawl. Has a talent for using improvised weapons in combat. |\n| 16 | Brunk | This goblin is covered in warts and has a reputation for being extremely unlucky. |\n| 17 | Snig | A goblin who excels in thievery. Often used for reconnaissance and spying. |\n| 18 | Glup | This goblin has a single eye and excels at tracking prey. |\n| 19 | Slag | A goblin who loves to create and maintain traps in his lair. |\n| 20 | Wizgig | This goblin has a talent for magic and loves to experiment with new spells. |\n| 21 | Skrog | A goblin who is unusually strong for his size. Often used as muscle for the tribe. |\n| 22 | Grit | This goblin is covered in grit and grime from living underground. |\n| 23 | Snarl | A fierce goblin with a menacing snarl that can intimidate even the bravest adventurers. |\n| 24 | Pox | This goblin is covered in pustules and warts and has a sickly appearance. |\n| 25 | Zit | A goblin with terrible acne that often bursts at inopportune times. |\n| 26 | Shart | This goblin has a talent for alchemy and loves to create strange potions. |\n| 27 | Digg | A goblin who is skilled at tunneling. Often used to dig new tunnels to expand the tribe's territory. |\n| 28 | Grin | This goblin is always smiling, even in the most dire situations. |\n| 29 | Taz | A goblin who loves to ride giant rats. Often used for scouting purposes. |\n| 30 | Skrag | This goblin has a talent for cooking and loves to prepare all sorts of stews and soups. |\n| 31 | Snatch | A goblin who loves to steal pets and other animals to keep as his own. |\n| 32 | Grump | This goblin is perpetually grumpy and often lashes out at others for no reason. |\n| 33 | Gunk | A goblin who loves to make disgusting noises and smells to irritate others. |\n| 34 | Skulk | This goblin is unusually quiet and hard to spot even for his fellow goblins. |\n| 35 | Slug | A goblin who loves to lounge around all day. Often found sleeping in his lair. |\n| 36 | Fizzgig | This goblin is always tinkering with explosives. |\n| 37 | Krunch | A goblin who has a talent for cooking meat. Often used to prepare meals for the tribe. |\n| 38 | Smirk | This goblin is always smirking in a way that makes others uneasy. |\n| 39 | Grav | A goblin who loves to dig graves and collect bones for his macabre collections. |\n| 40 | Skreech | This goblin has a very high-pitched voice that can shatter glass. |\n| 41 | Spurt | A goblin who loves to run, jump, and tumble. Often used for delivering messages quickly. |\n| 42 | Gnat | This goblin is small even for a goblin and can easily blend in with other insects. |\n| 43 | Snipe | A goblin who loves to shoot arrows from afar. Often used for ambushes. |\n| 44 | Grog | This goblin has a talent for brewing strong ale. |\n| 45 | Hiss | A goblin with a dangerous talent for venom. Can easily poison his enemies. |\n| 46 | Slink | This goblin is very good at staying hidden and sneaking around undetected. |\n| 47 | Runt | A goblin who is even smaller than the typical goblin. Often used for sneaking into tight spaces. |\n| 48 | Gripe | This goblin is always complaining about everything. Often ignored by his fellow goblins. |\n| 49 | Skitter | A goblin who loves to climb walls and ceilings. |\n| 50 | Snark | This goblin is always making sarcastic comments that often get him into trouble. |\n| 51 | Grubnose | A goblin with an unusually large nose. Often used for tracking prey. |\n| 52 | Snaggletooth | This goblin has a single, prominent tooth that juts out of his mouth. |\n| 53 | Gloom | A goblin who always seems to be in a bad mood. |\n| 54 | Gristle | This goblin is exceptionally tough and gristly. |\n| 55 | Skragg | A goblin who loves to fight with his bare hands. |\n| 56 | Snicker | This goblin is always laughing, sometimes at inappropriate times. |\n| 57 | Grovel | A goblin who loves to grovel and beg for mercy. Often used to distract enemies. |\n| 58 | Scraps | This goblin is covered in rags and often scavenges for clothing and other items. |\n| 59 | Skorch | A goblin who loves to set things on fire. |\n| 60 | Snuff | This goblin has an unusually sensitive sense of smell and can detect even the faintest of scents. |\n| 61 | Grind | A goblin who loves to grind up bones and other materials to create powders and potions. |\n| 62 | Spittle | This goblin has a talent for spitting and can hit targets from quite a distance. |\n| 63 | Skank | A goblin with an exceptionally foul odor. Can easily gag enemies with his stench. |\n| 64 | Grist | This goblin has a love for grains and often hoards wheat and other crops. |\n| 65 | Snif | A goblin who is excellent at tracking by scent. Often used to track down fugitives. |\n| 66 | Growl | This goblin is always growling and snarling, even when he's happy. |\n| 67 | Spark | A goblin who loves to create sparks with metal and rock. |\n| 68 | Grot | This goblin is always covered in mud and filth. |\n| 69 | Skorn | A goblin who loves to insult others. Often used to distract enemies. |\n| 70 | Snarltooth | This goblin has several prominent teeth that resemble fangs. |\n| 71 | Gripeface | A goblin with a permanently grumpy expression. |\n| 72 | Skritch | This goblin is always itching and scratching at his skin. |\n| 73 | Groan | A goblin who loves to moan and groan for no apparent reason. |\n| 74 | Scowl | This goblin is always scowling and never seems to smile. |\n| 75 | Gnarl | A goblin with incredibly gnarled and twisted fingers. |\n| 76 | Squint | This goblin always squints his eyes, as if to see something in the distance. |\n| 77 | Gruffle | A goblin who loves to grunt and snort like a pig. |\n| 78 | Skulkface | This goblin has a permanently sneaky expression. |\n| 79 | Snuffle | A goblin who is always sniffling and has a perpetually runny nose. |\n| 80 | Gruff | This goblin talks in a low, gruff voice that can be difficult to understand. |\n| 81 | Sneeze | A goblin who is always sneezing, even in the cleanest of environments. |\n| 82 | Grim | This goblin has a permanently grim expression. |\n| 83 | Grouch | A goblin who loves to complain and grouse about everything. |\n| 84 | Soot | This goblin is always covered in black soot from working in the forges. |\n| 85 | Grizzle | A goblin who has a permanent five o'clock shadow. |\n| 86 | Skeeter | This goblin is always swatting at bugs and mosquitoes. |\n| 87 | Snort | A goblin who loves to snort like a pig. |\n| 88 | Gruffface | This goblin has a permanently gruff expression. |\n| 89 | Skreechface | A goblin who has a permanently frightened expression. |\n| 90 | Growly | This goblin talks in a low, growly voice that can be intimidating. |\n| 91 | Screech | A goblin who loves to make loud, high-pitched noises. |\n| 92 | Grumble | This goblin loves to grumble and mutter under his breath. |\n| 93 | Skornface | This goblin has a permanently angry expression. |\n| 94 | Snuffelnose | A goblin with a perpetually sniffly and runny nose. |\n| 95 | Grizzleface | This goblin has a permanently unshaven and gruff expression. |\n| 96 | Scream | A goblin who loves to scream and yell. |\n| 97 | Grouchy | This goblin is always in a grouchy mood and never seems to cheer up. |\n| 98 | Skeezix | This goblin has a perpetually puzzled expression. |\n| 99 | Grunt | A goblin who loves to grunt and make guttural noises. |\n| 100 | Skreechtooth | This goblin has several prominent pointed teeth that resemble fangs. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 01         | Grondar Stoneheart | A towering figure with skin like granite and a powerful build to match. Grondar has a heart of gold and a keen mind for strategy. |\n| 02         | Brekka Frostblade | With skin as pale as freshly fallen snow and eyes that gleam like ice, Brekka is a fierce warrior with a quick wit. |\n| 03         | Kjell Fireborn | Kjell's dark skin is accented by bright crimson hair and a beard to match. He is quick to anger but fiercely loyal to those he trusts. |\n| 04         | Sigrun Ironfist | Sigrun is as tough as the steel her people mine. Her iron-like grip and unstoppable determination make her a formidable ally. |\n| 05         | Thorgar Thunderstrike | With a booming voice and electricity crackling around him, Thorgar is a force to be reckoned with. He never backs down from a fight. |\n| 06         | Eirik Giantsbane | Eirik is a towering figure with a personality to match. His booming laughter and love of ale make him a welcome addition to any adventuring party. |\n| 07         | Hilda Mountainbreaker | Hilda is a skilled blacksmith with hands as strong as the mountains she was born beneath. Her kind heart and even temperament make her a trustworthy friend. |\n| 08         | Gunnar Silverbeard | Gunnar's silver hair and beard are as iconic as his love for adventure and unshakable sense of justice. |\n| 09         | Ingrid Stonefist | Ingrid is a stoic warrior with skin as hard as stone. Her no-nonsense approach to life can come across as cold, but she always has the best interests of her allies at heart. |\n| 10         | Olaf Frostfury | Olaf's blue-tinted skin and icy demeanor make him an intimidating presence, but his loyalty to his friends is unwavering. | \n| 11         | Ragni Stormtalon | Ragni's white hair and dark skin give her a striking look, but her quick thinking and lightning-fast reflexes make her a deadly opponent. |\n| 12         | Torstein Ironclad | Torstein's unbreakable will and sturdy frame make him a natural leader. His strategic mind and protective nature make him a valuable ally. |\n| 13         | Ulfar Mountainrider | Ulfar's love of nature and affinity for animals make him an unconventional Goliath. But his bravery and resourcefulness make him a valuable asset to any team. |\n| 14         | Valdis Skywatcher | Valdis has always been fascinated by the sky, and her keen eyesight and ability to predict weather patterns make her a skilled ranger. |\n| 15         | Asgeir Thunderfoot | The sound of Asgeir's footsteps can shake the ground beneath your feet. His imposing size and raw strength make him a natural fighter. |\n| 16         | Solveig Graymane | Solveig's gray hair and wolf-like features make her look wise beyond her years. Her calm demeanor and knowledge of nature make her a valuable guide. |\n| 17         | Arne Firebrand | With hair as red as flames and a temper to match, Arne is a fierce warrior with an unquenchable thirst for battle. |\n| 18         | Kari Stonebreaker | Kari is a skilled blacksmith with a passion for fashioning weapons and armor from the toughest materials. Her even temperament and sharp wit make her good company. |\n| 19         | Magnus Icebreaker | Magnus has a keen mind for strategy and an even keener blade. His unwavering loyalty and determination make him a valuable ally. |\n| 20         | Svenja Frostweaver | Svenja has a gift for weaving magic through ice and snow. Her gentle nature and love of beauty make her a calming presence in any situation. |\n| 21         | Bjorn Mountainheart | Bjorn's heart is as sturdy as the rock of his homeland, and his willingness to always lend a helping hand makes him an invaluable ally. |\n| 22         | Freya Stormborn | Freya was born during a ferocious storm, and her command of the elements has been unmatched ever since. Her boisterous nature and genuine kindness make her a beloved companion. |\n| 23         | Einar Rocksplitter | Einar's ability to split even the toughest stone has made him a master at both mining and combat. His quick thinking and dry wit make him a formidable opponent. |\n| 24         | Gudrun Iceheart | Gudrun's icy exterior belies her warm, nurturing nature. Her fierce determination and healing powers make her a valuable asset in any situation. |\n| 25         | Halvard Thunderfoot | Halvard's thunderous footsteps can be heard from miles away. His imposing size and friendly demeanor make him an unlikely but valued traveling companion. |\n| 26         | Liv Stonebinder | Liv's skills as a bard are enhanced by her ability to bind magic to stone. Her bohemian nature and love of the arts make her a welcome addition to any group. |\n| 27         | Mikkel Frosthammer | With a name like Frosthammer, it's no surprise that Mikkel is a skilled blacksmith. But his gentleness and love of nature may surprise you. |\n| 28         | Ragna Ironheart | Ragna is a true warrior, with a heart as strong as the iron she works with. Her unwavering loyalty and protective nature make her a valuable asset. |\n| 29         | Soren Firebringer | Soren's fire magic is matched only by his fiery passion for adventure. His quick thinking and fearless nature make him a deadly opponent. |\n| 30         | Thora Stormcaller | Thora is a master of lightning magic, able to call bolts of electricity down from the sky to smite her enemies. Her quick wit and adventurous spirit make her a valuable ally. |\n| 31         | Verner Icefist | Verner's icy exterior hides a warm heart and a love of adventure. His strength and quick thinking make him a formidable opponent. |\n| 32         | Astrid Mountainclimber | Astrid's love of climbing and exploration has taken her to the highest peaks in the land. Her sharp wit and resourcefulness make her a valuable ally. |\n| 33         | Eilif Skywatcher | Eilif has an unerring sense of direction and a love of the open sky. His calm demeanor and sharp eyes make him a skilled scout. |\n| 34         | Frida Fireheart | With a fiery temper to match her bright red hair, Frida is a force to be reckoned with. Her loyalty and love for her friends make her an invaluable ally. |\n| 35         | Hakon Stonefist | Hakon's enormous stone fists are as powerful as they are intimidating, but his gentle nature and love of music may surprise you. |\n| 36         | Inga Stormsurge | Inga's control of the seas is matched only by her control of lightning magic. Her calm demeanor and quick thinking make her a skilled navigator. |\n| 37         | Jorgen Icebeard | Jorgen's love of ale is matched only by his love of adventure. His quick thinking and loyalty make him a valuable ally. |\n| 38         | Leif Stormwatcher | Leif's sharp eyes and uncanny sense of the weather make him a skilled navigator. His love of stories and music make him a cherished companion. |\n| 39         | Nils Ironskin | Nils's skin is as hard as iron, and his determination is equally unbreakable. His love of tinkering and crafting make him a skilled artificer. |\n| 40         | Ragnar Windrider | Ragnar's ability to ride the winds makes him a formidable opponent. His quick thinking and love of adventure make him a valuable ally. |\n| 41         | Sigrunn Mountainclimber | Sigrunn's love of climbing and fearlessness make her a skilled explorer. Her even temperament and quick thinking make her a valuable ally. |\n| 42         | Thane Thundergrip | Thane's grip is as strong as the lightning that surrounds him. His quick thinking and unwavering loyalty make him an invaluable asset. |\n| 43         | Ulla Stonebreaker | Ulla's skills as a blacksmith are matched only by her love of danger and adventure. Her sharp wit and protective nature make her a valuable ally. |\n| 44         | Valdemar Iceblade | Valdemar's cold steel is matched only by his icy demeanor. His quick thinking and unwavering loyalty make him a valuable ally. |\n| 45         | Asmund Stormstriker | Asmund's skills with a storm hammer are matched only by his love of adventure and his sharp wit. |\n| 46         | Svea Mountainfort | Svea's enormous size and unshakable determination make her a natural leader. Her love of hiking and exploration make her a valuable guide. |\n| 47         | Grim Firefist | Grim's fiery temper and quick reflexes make him a dangerous opponent. But his unwavering loyalty and love for his friends make him a valued ally. |\n| 48         | Kol Ironsoul | Kol's unbreakable spirit and tireless work ethic make her a valuable member of any team. Her ability to communicate with the dead can be both a gift and a curse. |\n| 49         | Rurik Thundercaller | Rurik's ability to call down lightning makes him a formidable opponent. But his love of stories and music make him a cherished companion. |\n| 50         | Viggo Icebreaker | Viggo's love of exploration and his determination to break through any obstacle make him a skilled adventurer. His sharp wit and loyalty make him an invaluable ally. |\n| 51         | Aina Stormweaver | Aina's mastery of wind magic is matched only by her love of the great outdoors. Her gentle nature and sharp eyes make her a skilled scout. |\n| 52         | Birger Mountainborn | Birger's love of the mountains and his affinity for stone magic make him a skilled spelunker. His unwavering loyalty and sharp wit make him an invaluable ally. |\n| 53         | Erlend Ironhide | Erlend's unbreakable toughness and tireless work ethic make him a valuable member of any team. His natural hair and beard have been known to attract small animals. |\n| 54         | Gorm Stormchaser | Gorm's ability to chase storms is matched only by his love of adventure. His quick thinking and unwavering loyalty make him an invaluable ally. |\n| 55         | Livvy Icebinder | Livvy's ability to bind magic to ice is matched only by her love for her friends. Her quick thinking and gentle nature make her a valuable ally. |\n| 56         | Magnus Mountainstrider | Magnus's long legs and love of the outdoors have taken him to every corner of the land. His quick thinking and love of good ale make him a cherished companion. |\n| 57         | Orvar Thunderfoot | Orvar's thunderous footsteps are matched only by his ability to call down lightning. His love of the open road and fierce loyalty make him an invaluable ally. |\n| 58         | Rikard Rockbreaker | Rikard's love of mining and his knowledge of stone magic make him a valuable member of any team. His dry wit and quick thinking are also assets. |\n| 59         | Svend Firestarter | Svend's ability to control fire is matched only by his love of adventure. His quick thinking and unwavering loyalty make him a valuable asset. |\n| 60         | Thorene Stormcaller | Thorene's control of the weather is matched only by her unwavering loyalty to her friends. Her sharp wit and love of stories make her a cherished companion. |\n| 61         | Anders Iceheart | Anders's icy demeanor can be deceiving. His love of music and uncanny sense of direction make him a cherished companion. |\n| 62         | Bjarne Mountaincrusher | Bjarne's love of climbing and ability to crush stone make him a valuable member of any team. His love of ale and adventures make him a cherished companion. |\n| 63         | Edda Thunderstrike | Edda's love of thunder and lightning is matched only by her quick reflexes. Her gentle nature and love of stories make her a valuable ally. |\n| 64         | Finn Icefisher | Finn's love of fishing and control of ice magic make him a natural choice for any team navigating icy waters. His quick wit and sharp eyes make him a skilled lookout. |\n| 65         | Helge Stormrider | Helge's love of riding the winds and his quick reflexes make him a formidable opponent. But his love of music and gentle nature make him a cherished companion. |\n| 66         | Ivor Ironhorn | Ivor's iron horn can be heard from miles away, but it's his unwavering loyalty and gentle nature that make him a valuable ally. |\n| 67         | Kelda Firebrand | Kelda's fiery temper is matched only by her love of adventure. Her quick thinking and unwavering loyalty make her an invaluable asset. |\n| 68         | Leifur Iceclimber | Leifur's love of climbing and his mastery of ice magic make him a skilled spelunker. His sharp wit and even temperament make him good company. |\n| 69         | Njalla Mountainrunner | Njalla's love of running and her quick reflexes make her a valuable scout. Her love of good food and good ale make her a cherished companion. |\n| 70         | Runa Stormwielder | Runa's command of the elements and her quick reflexes make her a formidable opponent. But her love of music and gentle nature make her a cherished companion. |\n| 71         | Sigurd Ironmace | Sigurd's powerful mace is matched only by his unwavering loyalty and tireless work ethic. His dry wit and quick thinking make him an invaluable ally. |\n| 72         | Thordis Firecaller | Thordis's command of fire magic and sharp wit make her a formidable opponent. But it's her love of good ale and stories that make her a cherished companion. |\n| 73         | Viktor Iceberg | Viktor's ability to control ice and his love of fishing make him a valuable member of any team traveling icy waters. His quick wit and love of stories make him good company. |\n| 74         | Alaric Stormbringer | Alaric's mastery of lightning magic and quick reflexes make him a formidable opponent. But it's his love of music and storytelling that make him a cherished companion. |\n| 75         | Bengt Mountainbinder | Bengt's ability to bind magic to stone and his tireless work ethic make him a valuable member of any team. His love of ale and stories make him good company. |\n| 76         | Eldrid Fireheart | Eldrid's fiery temper and unwavering loyalty make her a formidable ally. Her love of music and gentle nature make her a cherished companion. |\n| 77         | Gjord Ironfist | Gjord's iron fist and quick reflexes make him a formidable opponent. But it's his love of tinkering and his tireless work ethic that make him a valuable member of any team. |\n| 78         | Ilsa Iceweaver | Ilsa's ability to weave magic through ice and snow and her even temperament make her a skilled guide. Her love of stories and gentle nature make her good company. |\n| 79         | Kjellrun Mountaincarver | Kjellrun's love of carving and shaping mountains with her bare hands and her love of storytelling make her a cherished companion. Her sharp wit and even temperament make her good company. |\n| 80         | Maren Stormchaser | Maren's ability to chase storms and her love of music make her a valuable member of any team. Her even temperament and love of good ale make her good company. |\n| 81         | Olav Icehorn | Olav's mastery of ice magic and his quick reflexes make him a formidable opponent. But it's his gentle nature and love of good stories that make him a cherished companion. |\n| 82         | Ragnaar Stormwielder | Ragnaar's command of the elements and his love of good ale make him a valuable member of any team. His sharp wit and love of stories make him good company. |\n| 83         | Sigrid Ironheart | Sigrid's unwavering loyalty and tireless work ethic make her a valuable member of any team. Her love of music and gentle nature make her a cherished companion. |\n| 84         | Thoral Mountainforged | Thoral's skills as a blacksmith and his love of storytelling make him a cherished companion. His quick wit and tireless work ethic make him invaluable. |\n| 85         | Ursa Firestorm | Ursa's fiery temper and mastery of fire magic make her a formidable opponent. But it's her love of good ale and her gentle nature that make her a cherished companion. |\n| 86         | Valder Ironhand | Valder's iron hand and love of the outdoors make him a valuable member of any team. His love of stories and even temperament make him good company. |\n| 87         | Asta Icefall | Asta's ability to cause the ground to shake and her love of skiing make her a valuable member of any team. Her sharp wit and gentle nature make her a cherished companion. |\n| 88         | Bjarke Mountaintrail | Bjarke's love of trailblazing and his quick reflexes make him a skilled scout. His even temperament and love of stories make him good company. |\n| 89         | Eirikur Stormrider | Eirikur's love of riding the winds and his formidable lightning magic make him a valuable member of any team. His love of good ale and music make him good company. |\n| 90         | Fridtjof Icebreaker | Fridtjof's love of adventure and his mastery of ice magic make him a valuable member of any team. His even temperament and love of stories make him good company. |\n| 91         | Hrolf Ironhide | Hrolf's unbreakable toughness and tireless work ethic make him\r\n\nChatbot reponse terminated unexpectedly: : length\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01-05 | Alyndra | A half-elf bard with a love for storytelling and a haunting singing voice. She has piercing green eyes and braided hair. |\n| 06-10 | Calantha | A half-elf ranger who has a deep connection to the natural world. She has short hair and carries a longbow and a quiver of arrows. |\n| 11-15 | Erevan | A half-elf rogue with a quick wit and a charming smile. He wears a hooded cloak and carries a short sword and a crossbow. |\n| 16-20 | Feyre | A half-elf druid who can shape-shift into animal forms. She has long brown hair and carries a quarterstaff. |\n| 21-25 | Galadriel | A half-elf wizard who studies ancient magic and arcane lore. She has a silver circlet on her head and carries a spellbook. |\n| 26-30 | Isolde | A half-elf paladin who is sworn to protect the innocent and uphold justice. She wears gleaming armor and carries a holy symbol. |\n| 31-35 | Kaida | A half-elf monk who has mastered unarmed combat. She has a shaved head and wears simple robes. |\n| 36-40 | Lirien | A half-elf sorcerer who harnesses the power of the elements. She has wavy black hair and wears flowing robes. |\n| 41-45 | Maelora | A half-elf cleric who worships a nature deity. She wears a green cloak and carries a mace and a shield. |\n| 46-50 | Niamh | A half-elf warlock who made a pact with a powerful entity. She has piercing blue eyes and wears a black cloak. |\n| 51-55 | Ophelia | A half-elf bard who specializes in enchantment magic. She has curly blonde hair and carries a harp. |\n| 56-60 | Rhiannon | A half-elf fighter who is skilled with both sword and shield. She has a scar across her cheek and wears studded leather armor. |\n| 61-65 | Sylvi | A half-elf rogue who specializes in thievery and deception. She has a mischievous smile and carries a set of lock picks. |\n| 66-70 | Thalia | A half-elf ranger who is an expert tracker and huntsman. She has a bow slung over her shoulder and wears a cloak of bear fur. |\n| 71-75 | Vesper | A half-elf sorcerer who manipulates the shadows and darkness. She has a hooded cloak and carries a wand of shadow magic. |\n| 76-80 | Ysadora | A half-elf druid who can call on the powers of the earth and sky. She has long white hair and carries a staff made of twisted roots. |\n| 81-85 | Zephyr | A half-elf monk who moves with lightning-fast speed and grace. He has a shaved head and wears loose-fitting clothing. |\n| 86-90 | Arin | A half-elf paladin who is devoted to a god of war and battle. He wears gleaming plate armor and carries a greatsword. |\n| 91-95 | Faelivrin | A half-elf wizard who specializes in illusion magic. She wears a cloak of shimmering colors and carries a wand of illusions. |\n| 96-00 | Lyra | A half-elf warlock who made a pact with a demon lord. She has fiery red hair and wears a cloak of flames. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:--------:|:---------------:|\n| 1              | Brug     | A gruff, muscular half-orc with a scar over one eye. Brug is a blacksmith who is always covered in soot and sweat. |\n| 2              | Gromak   | A stocky, bald half-orc with a thick beard. Gromak is a pub owner and local brawler who always has a joke to tell. |\n| 3              | Hruk     | A tall, lanky half-orc who wears a hooded cloak and carries a bow. Hruk is a hunter and tracker who always seems to be in deep thought. |\n| 4              | Korgath  | A battle-scarred half-orc warrior with a shaved head and a fierce scowl. Korgath is a feared enforcer who works for the local crime boss. |\n| 5              | Krusk    | A grizzled half-orc with a braided beard and a lazy eye. Krusk is a fisherman who tells tall tales of sea monsters and lost treasure. |\n| 6              | Mug     | A short, rotund half-orc with a bushy mustache and twinkling eyes. Mug is a cook who serves up hearty meals and questionable jokes. |\n| 7              | Shump    | A hulking half-orc with a wild mane of hair and bulging arms. Shump is a lumberjack who can fell a tree in a single strike. |\n| 8              | Throg    | A scarred half-orc with a broken nose and a raspy voice. Throg is a pit fighter who never backs down from a challenge. |\n| 9              | Ug      | A wiry half-orc with a perpetual smirk and a quick wit. Ug is a street hustler who always has a scheme up his sleeve. |\n| 10             | Varg     | A silent, brooding half-orc with a haunted look in his eyes. Varg is a mercenary who fights for whoever pays the most. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Arlo Greenfoot | A portly and jolly halfling with rosy cheeks and a bushy beard. He wears a green cap and carries a large pouch of freshly picked vegetables. |\n| 2 | Lila Hilltopple | An older halfling woman with a kind smile and twinkling eyes. She bakes the best pies in the village, and always has a warm welcome for anyone who stops by her home. |\n| 3 | Milo Swifttoe | A young and adventurous halfling with a bright grin and a quick wit. He's always eager to try new things and explore the world beyond his hometown. |\n| 4 | Poppy Underhill | A quiet and reserved halfling who prefers the company of animals to people. She's often seen tending to her garden or wandering through the nearby woods. |\n| 5 | Rollo Smokeleaf | A mischievous halfling with a sly smile and a love for pranks. He's quick with a joke or a witty remark, and is always looking for a good time. |\n| 6 | Willowfoot Thistleberry | A serious and focused halfling who takes her duties as a town merchant very seriously. She's always looking for the best deals and the highest quality goods to bring back to her shop. |\n| 7 | Finn Meadowlark | A carefree and energetic halfling who loves nothing more than a good adventure. He's always up for a challenge, and can often be found exploring the nearby mountains or wandering through distant lands. |\n| 8 | Daisy Smallhands | A shy and timid halfling who often struggles to speak up for herself. Despite her quiet nature, she has a kind heart and will go out of her way to help those in need. |\n| 9 | Barnaby Longbottom | A gruff and no-nonsense halfling with a booming voice and a stern demeanor. He takes his role as the town's sheriff very seriously, and is feared by many of the local troublemakers. |\n| 10 | Lenny Quickstep | A fast-talking and charismatic halfling with a love for gambling and risk-taking. He's always looking for the next big score, and isn't above cheating to get it. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name | Description |\n|---|---|---|\n|1|Narg | Hulking brute with a massive scar running down his face. Wields a greataxe with deadly precision.|\n|2|Kraak | Cunning strategist with a sharp mind. Often seen studying maps and battle plans.|\n|3|Torg | Swift-footed scout with a knack for getting in and out unnoticed. Carries a shortbow and several small knives.|\n|4|Urzog | Brutal enforcer who takes pleasure in causing pain. Carries a spiked mace and wears studded leather armor.|\n|5|Gruum | Stoic and disciplined, Gruum is the captain of the hobgoblin guard. Carries a longsword and shield.|\n|6|Drog | Shifty-eyed thief who is always on the lookout for an opportunity to make a quick profit. Carries a crossbow and a pouch of stolen goods.|\n|7|Korg | Arrogant and boastful, Korg fancies himself a hero in the making. Carries a longspear and fancies himself a knight in shining armor.|\n|8|Zaruk | Crafty inventor who loves tinkering with traps and gadgets. Carries a hand crossbow and a set of tools.|\n|9|Grath | Cunning diplomat who enjoys haggling and negotiating. Dresses in fine clothes and carries a slender rapier.|\n|10|Razak | Mysterious shaman who performs dark rituals and speaks to dark powers. Carries a staff and a pouch of reagents.|\n|11|Varg | Ruthless warlord who rules over a band of hobgoblin mercinaries. Carries a battleaxe and wears heavy plate armor.|\n|12|Maglub | Pious cleric who believes in the superiority of hobgoblins over all other races. Carries a mace and wears chain mail armor.|\n|13|Drogath | Sinister assassin who delights in silently stalking his targets before dealing a deadly blow. Carries poisoned daggers and wears studded leather armor.|\n|14|Throg | Simple-minded brute who acts as muscle for whoever pays him. Carries a greatclub and wears little armor.|\n|15|Zorg | Gruff trapper who knows the local wilderness like the back of his hand. Carries a hunting bow and various traps.|\n|16|Nuk | Cowardly scout who prefers to avoid combat and gather valuable information. Carries a shortbow and a quiver of arrows.|\n|17|Korgath | Ambitious lieutenant who seeks to overthrow his superior and take control. Carries a longsword and wears chain mail armor.|\n|18|Drak | Fanatical worshipper of the god of war, Drak revels in violence and destruction. Carries a battleaxe and wears splint armor.|\n|19|Goruk | Greedy smuggler who makes a living transporting contraband across the land. Carries a shortsword and a hidden stash of goods.|\n|20|Zarr | Wily thief who uses charm and craftiness to get what she wants. Carries a set of lockpicks and several small knives.|\n|21|Thruk | Nimble acrobat who is skilled at dodging and weaving around opponents. Carries a pair of short swords and wears leather armor.|\n|22|Kruk | Short-tempered brawler who gets into fights at the drop of a hat. Carries a knuckleduster and no armor.|\n|23|Valk | Calculating strategist who considers all possible moves before making a decision. Carries a longbow and several scrolls of tactical plans.|\n|24|Grak | Unpredictable jester who enjoys making a fool of anyone he thinks takes themselves too seriously. Carries a jester's prop mace and several balloons.|\n|25|Jorg | Loyal guard who would do anything to protect his lord. Carries a halberd and wears chain mail armor.|\n|26|Bagguk | Stoic blacksmith who is renowned for his expert craftsmanship. Carries a heavy warhammer and a set of tools.|\n|27|Nazg | Proud noble who has devoted his life to the hobgoblin cause. Carries a rapier and a sense of superiority.|\n|28|Krakka | Berserker who throws herself into battle with reckless abandon. Carries a pair of hand axes and wears leather armor.|\n|29|Rok | Quick-witted thief who is always looking for a way to make a quick buck. Carries a short sword and a bag of stolen goods.|\n|30|Zug | Timid scout who avoids conflict whenever possible. Carries a shortbow and wears studded leather armor.|\n|31|Drogg | Cynical mercenary who has seen it all and trusts no one. Carries a pike and wears scale mail armor.|\n|32|Kazzog | Grizzled veteran who has survived countless battles. Carries a scimitar and shield and wears chain mail armor.|\n|33|Throz | Shrewd diplomat who prefers to use words over weapons. Carries a cane and wears fine clothes.|\n|34|Kronk | Boastful gladiator who enjoys putting on a show for the crowds. Carries a pair of tridents and a net.|\n|35|Varguk | Confident warlord who leads his troops from the front lines. Carries a greatsword and wears plate mail armor.|\n|36|Razzak | Mysterious assassin who kills for an unknown employer. Carries a pair of daggers and wears dark clothing.|\n|37|Frogg | Opportunistic thief who specializes in pickpocketing and breaking into homes. Carries a pair of lockpicks and a small knife.|\n|38|Throkka | Agile duelist who prefers one-on-one combat. Carries a rapier and a buckler.|\n|39|Krag | Gruff veteran who hates working with rookies. Carries a spear and a large shield.|\n|40|Zugg | Tortured soul who has been scarred by past trauma. Carries a crossbow and keeps to himself.|\n|41|Drogga | Reckless berserker who charges into battle without a care. Carries a battleaxe and no armor.|\n|42|Kraknak | Cunning smuggler who trades in exotic goods. Carries a shortsword and a hidden stash of goods.|\n|43|Thug | Lazy scout who would rather sleep than keep watch. Carries a shortbow and a pillow.|\n|44|Vazzog | Devout cleric who seeks to spread the word of the hobgoblin gods. Carries a mace and wears leather armor.|\n|45|Grog | Drunken sot who thinks he's invincible. Carries a tankard and his fists.|\n|46|Kragguk | Vicious pit fighter who doesn't hold back. Carries a trident and no armor.|\n|47|Orka | Roughneck who enjoys a good bar fight. Carries a heavy club and wears leather armor.|\n|48|Zazzak | Wily thief who uses her feminine wiles to get what she wants. Carries a short sword and a flirty attitude.|\n|49|Throk | Adventurous explorer who enjoys discovering new lands. Carries a spear and wears explorer's gear.|\n|50|Kruzz | Sadistic torturer who delights in breaking spirits. Carries a whip and wears torture tools on his belt.|\n|51|Gruk | Quiet assassin who prefers to strike from the shadows. Carries a dagger and wears dark clothing.|\n|52|Dugg | Paranoid bandit who trusts no one. Carries a shortsword and wears studded leather armor.|\n|53|Kkorg | Smooth-talking merchant who is always looking for a way to make a profit. Carries a ledger and several small bags of coin.|\n|54|Skrax | Brutish thug who enjoys dishing out punishment on behalf of his boss. Carries a heavy club and wears studded leather armor.|\n|55|Zugga | Eccentric inventor who creates bizarre and often dangerous gadgets. Carries a bag of tools and several tinkering gizmos.|\n|56|Thrazz | Unpredictable wild card who enjoys causing chaos. Carries a pair of handaxes and a wicked grin.|\n|57|Krukka | Careful strategist who is always aware of her surroundings. Carries a short sword and a notebook.|\n|58|Drazz | Patient huntsman who enjoys tracking prey. Carries a longbow and a hunting knife.|\n|59|Gazzok | Arrogant noble who looks down on anyone who isn't hobgoblin. Carries a rapier and a sense of entitlement.|\n|60|Zrok | Mysterious monk who keeps to herself. Carries a staff and wears monk's robes.|\n|61|Throgg | Opportunistic thief who is always looking for a quick score. Carries a spiked club and a satchel of stolen goods.|\n|62|Karguk | Wily opportunist who knows how to play both sides of a conflict. Carries a shortsword and a smile.|\n|63|Dakk | Boisterous jester who enjoys making mischief wherever he goes. Carries a prop mace and several noisemakers.|\n|64|Zakka | Thorny negotiator who enjoys getting the better of others. Carries a ledger and several contracts.|\n|65|Thrag | Grim soldier who carries out orders without question. Carries a spear and wears chain mail armor.|\n|66|Krakka | Brave captain who leads her crew through dangerous waters. Carries a cutlass and wears a captain's hat.|\n|67|Vugg | Sullen blacksmith who doesn't speak much. Carries a heavy hammer and a set of tools.|\n|68|Krazzak | Reclusive scholar who studies ancient texts and artifacts. Carries a book and a set of scrolls.|\n|69|Hrakk | Vengeful criminal who seeks revenge on those who wronged him. Carries a shortsword and a burning anger.|\n|70|Zarg | Loyal bodyguard who would take a bullet for his charge. Carries a halberd and wears plate mail armor.|\n|71|Karruk | Streetwise thug who knows all the back alleys and escape routes. Carries a pair of brass knuckles and a switchblade.|\n|72|Dazzog | Bold adventurer who is always seeking new challenges. Carries a longsword and wears explorer's gear.|\n|73|Kragg | Devoted cleric who seeks to bring light to the darkness. Carries a mace and wears chain mail armor.|\n|74|Tharuk | Sneaky spy who gathers intelligence through any means necessary. Carries a short sword and several disguises.|\n|75|Kazzak | Bold duelist who enjoys the thrill of combat. Carries a greatsword and a broad grin.|\n|76|Gorakk | Cautious tactician who considers every possible outcome before taking action. Carries a crossbow and a set of maps.|\n|77|Vorg | Scheming criminal who is always looking for a way to turn a profit. Carries a ledger and several small bags of coin.|\n|78|Zurkk | Ruthless enforcer who ensures his boss gets what he wants. Carries a cudgel and wears studded leather armor.|\n|79|Thokka | Thoughtful philosopher who ponders the mysteries of life. Carries a tome and a quill.|\n|80|Krelk | Sadistic interrogator who takes pleasure in breaking down his targets. Carries a whip and several torture tools.|\n|81|Gazzik | Greedy merchant who charges exorbitant prices for his wares. Carries a ledger and several small bags of coin.|\n|82|Zarlug | Ambitious lieutenant who seeks to take control for himself. Carries a greatsword and wears plate mail armor.|\n|83|Thraz | Quiet assassin who prefers to work alone. Carries a pair of daggers and a hidden knife.|\n|84|Krak | Careful scout who avoids combat whenever possible. Carries a shortbow and wears leather armor.|\n|85|Drogka | Bully who enjoys picking on those weaker than himself. Carries a heavy club and wears no armor.|\n|86|Grukk | Veteran soldier who has seen countless battles. Carries a spear and wears battered chain mail armor.|\n|87|Krazzog | Greedy opportunist who is always looking for a way to make a profit. Carries a shortsword and a small bag of stolen goods.|\n|88|Throgka | Quiet diplomat who prefers to keep to himself. Carries a cane and wears fine clothes.|\n|89|Kraknakka | Evasive thief who slips through traps and escapes from bonds with ease. Carries a set of lockpicks and several small tools.|\n|90|Zark | Dedicated bodyguard who puts himself in harm's way to protect his charge. Carries a spiked mace and wears plate mail armor.|\n|91|Draz | Cold-hearted killer who takes pleasure in ending lives. Carries a pair of poison-tipped daggers and wears dark clothing.|\n|92|Kruzzak | Manipulative spy who uses charm to get what she wants. Carries a short sword and a wicked smile.|\n|93|Grok | Quick-tempered brawler who loves a good brawl. Carries a set of brass knuckles and wears no armor.|\n|94|Tharogg | Ambitious warlord who seeks to conquer new territory. Carries a massive battleaxe and wears heavy plate armor.|\n|95|Krakkar | Charming rogue who talks his way out of trouble. Carries a rapier and a quick wit.|\n|96|Drakk | Brutish enforcer who enjoys making people suffer. Carries a spiked flail and wears studded leather armor.|\n|97|Karg | Deceitful charlatan who uses his wits to trick people out of their money. Carries a wrist-mounted crossbow and several fake gems.|\n|98|Zarzak | Shifty-eyed assassin who is always looking for a job. Carries a poisoned dagger and a hidden knife.|\n|99|Thrik | Merry prankster who loves making people laugh. Carries a set of jester's props and several noisemakers.|\n|100|Krunn | Fearless gladiator who is unbeatable in the arena. Carries a trident and a net, and wears no armor. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1          | Barnabus | A gruff and serious farmer, Barnabus is always tired from tending to his fields. |\n| 2          | Gertrude | A kindly old woman who runs the local apothecary. Gertrude is always happy to dispense advice, but be careful not to cross her! |\n| 3          | Hilda | A hardworking blacksmith who can often be found hammering away in her forge. Hilda is well-respected in the community for her craftsmanship. |\n| 4          | Milton | A travelling bard with a quick wit and a silver tongue. Milton can always be counted on to liven up any dull evening. |\n| 5          | Reginald | A haughty nobleman who is always looking for ways to increase his power and wealth. He has more enemies than friends. |\n| 6          | Gwendolyn | A young woman with a fierce spirit who dreams of adventure. Despite her youth, Gwendolyn is a skilled fighter. |\n| 7          | Bartholomew | A grizzled old soldier who has seen his fair share of battles. Bartholomew is always ready for a fight and is fiercely loyal to those he trusts. |\n| 8          | Beatrice | A timid barmaid who is often overlooked. Despite her shyness, Beatrice is a keen observer and often picks up on details that others miss. |\n| 9          | Percival | A pompous wizard who is quick to boast about his magical ability. While he can be a bit insufferable, there's no denying that Percival is a powerful spellcaster. |\n| 10         | Adelaide | A former courtesan who has left her old life behind to start anew. Adelaide is always looking for ways to help others and make amends for her past mistakes. |\n| 11         | Oswald | A mysterious figure who always seems to be lurking in the shadows. Little is known about Oswald, but there are rumors that he is involved in some very shady dealings. |\n| 12         | Wilhelmina | A kindly old cleric who devotes her life to caring for the sick and needy. Wilhelmina is beloved by all who know her. |\n| 13         | Ezekiel | A gruff ranger who has spent his life hunting dangerous beasts in the wilderness. Though he can be a bit rough around the edges, there's no one better to have by your side in a fight. |\n| 14         | Celeste | A naive young noblewoman who has never known hardship. Despite her sheltered upbringing, Celeste is kindhearted and always eager to help those in need. |\n| 15         | Samuel | A stoic warrior who has seen his fair share of tragedy. Samuel's quiet strength and determination are an inspiration to all who know him. |\n| 16         | Ingrid | A sharp-tongued merchant who is always looking for ways to make a profit. Ingrid is not above bending the rules to get what she wants. |\n| 17         | Magnus | A brash young knight who is eager to prove himself. Though he can be impulsive at times, Magnus's courage and enthusiasm are infectious. |\n| 18         | Edna | A crotchety old hermit who lives alone in the woods. Edna is not fond of visitors, but those who take the time to get to know her may find that she has a wealth of knowledge to share. |\n| 19         | Leonard | A bumbling apprentice wizard who is always making mistakes. Though his spells often go awry, Leonard's good intentions usually shine through. |\n| 20         | Lavinia | A manipulative sorceress who is always looking for ways to increase her power. Lavinia has many secrets and is not to be trusted. |\n| 21         | Julius | A scholarly scribe who spends all his time in dusty old libraries. Julius is somewhat eccentric, but his vast knowledge of the arcane is invaluable. |\n| 22         | Constance | A stern judge who is feared by criminals throughout the land. Though she may seem cold and unfeeling, Constance is deeply committed to bringing justice to the realm. |\n| 23         | Ignatius | A jovial tavern owner who is always ready with a cold pint of ale. Ignatius loves to hear stories and can often be found holding court in his establishment. |\n| 24         | Dorothea | A wise old witch who lives in a tiny hut on the edge of town. Dorothea is rumored to have amazing powers, but those who seek her out should beware her unpredictable nature. |\n| 25         | Agatha | A vain noblewoman who is obsessed with her own beauty. Agatha will stop at nothing to maintain her youthful appearance, no matter the cost. |\n| 26         | Thaddeus | A gruff and reclusive hunter who is quick to take offense. Thaddeus prefers the company of his loyal hounds to that of people. |\n| 27         | Lucinda | A flighty young bard who is always on the lookout for inspiration for her next song. Lucinda is a hopeless romantic who falls in love with every handsome stranger who crosses her path. |\n| 28         | Horatio | A precocious young wizard who is eager to show off his magical ability. Horatio can be a bit of a know-it-all, but his heart is in the right place. |\n| 29         | Henrietta | An eccentric collector who spends all her time amassing strange and unusual objects. Henrietta is always looking for the next oddity to add to her collection. |\n| 30         | Omar | A weather-beaten sailor who has spent his life on the high seas. Omar has seen things that most people could never even imagine. |\n| 31         | Cassandra | A melancholy scholar who spends her days poring over ancient tomes. Cassandra has dedicated her life to unlocking the secrets of the past. |\n| 32         | Augustine | A charismatic preacher who wields the power of the divine. Augustine is a gifted healer and has many followers who look up to him as a spiritual leader. |\n| 33         | Isadora | A flamboyant performer who tells tall tales of derring-do and adventure. Isadora is a consummate entertainer who can hold audiences spellbound with her stories. |\n| 34         | Gregor | A grizzled old pirate who has looted and pillaged his way across the seas. Though he may seem rough around the edges, Gregor has a code of honor that he always abides by. |\n| 35         | Selena | A melancholy ranger who has lost everything she ever loved. Selena roams the wilds alone, seeking solace in the beauty of nature. |\n| 36         | Leopold | A cunning thief who is always looking for ways to make a quick coin. Leopold is a master of deception and can talk his way out of almost any situation. |\n| 37         | Hermione | A brilliant wizard who spends her days holed up in her laboratory. Hermione is happiest when she's experimenting with new spells and potions. |\n| 38         | Donovan | A fearsome barbarian who has a penchant for violence. Donovan is always looking for a good fight and has little patience for those who stand in his way. |\n| 39         | Priscilla | A flirtatious courtesan who knows how to please both the body and mind. Priscilla is a master of seduction and can manipulate men with ease. |\n| 40         | Edmund | A wise old knight who has served his kingdom tirelessly. Edmund is a paragon of chivalry and is deeply respected by all who know him. |\n| 41         | Laurel | A reclusive herbalist who knows the secrets of the forest like the back of her hand. Laurel is deeply connected to nature and has many powerful allies among the beasts of the wood. |\n| 42         | Victor | A ruthless bandit who preys on travelers and merchants. Victor has no qualms about killing those who stand in his way. |\n| 43         | Rowena | A skilled archer who has traveled far and wide. Rowena is always on the lookout for new challenges to test her skills. |\n| 44         | Klaus | A gruff and intimidating blacksmith who takes great pride in his work. Klaus is not one to suffer fools gladly. |\n| 45         | Penelope | A headstrong young princess who is determined to make a name for herself. Penelope is not content to sit idly by while others do the hard work. |\n| 46         | Lucius | A mysterious scholar who is rumored to be more than he appears. Lucius has many secrets and is not easily trusted. |\n| 47         | Evangeline | A gentle healer who devotes her life to easing the suffering of others. Evangeline is deeply compassionate and has a gift for calming even the most troubled spirits. |\n| 48         | Heinrich | A tireless crusader who is committed to destroying all who threaten the kingdom. Heinrich is a force to be reckoned with in battle. |\n| 49         | Patience | A kind-hearted orphan who has had to fend for herself from a young age. Patience is adept at surviving in the harshest of conditions. |\n| 50         | Thalia | A vivacious young actress who can play any role to perfection. Thalia is a gifted performer and can turn even the most mundane script into a masterpiece. |\n| 51         | Isaac | A shadowy figure who operates in the murky world of espionage. Isaac is a master of disguise and can infiltrate even the most secure strongholds. |\n| 52         | Fleur | A gentle gardener who has a way with plants. Fleur's garden is her pride and joy, and she takes great pleasure in sharing its beauty with others. |\n| 53         | Rupert | A doddering old wizard who can be forgetful at times. Despite his advanced age, Rupert is still a formidable spellcaster. |\n| 54         | Daphne | A fierce warrior who has little patience for those who don't take the threat of evil seriously. Daphne is a force to be reckoned with in battle. |\n| 55         | Atticus | A scrappy young thief who is always getting into trouble. Atticus is surprisingly resourceful and has a knack for getting out of tight spots. |\n| 56         | Lysandra | A wise old sorceress who has seen it all. Lysandra is reluctant to commit to any one course of action, preferring to weigh all her options carefully. |\n| 57         | Hector | A hot-headed paladin who is quick to rush into battle. Though he can be reckless at times, Hector's devotion to his cause is unquestionable. |\n| 58         | Melinda | A bubbly young bard who loves nothing more than to sing and dance. Melinda is a joy to be around and always knows how to lighten the mood. |\n| 59         | Edmund | An elderly retired adventure who has seen and done it all. Edmund now spends his time telling tall tales in the local tavern. |\n| 60         | Giselle | A cunning rogue who is always looking for ways to profit from other people's misfortune. Giselle is not to be trusted. |\n| 61         | Miles | A gruff and pragmatic captain who has sailed the seas for many years. Miles is not one to mince words or waste time. |\n| 62         | Zelda | A reclusive hermit who lives in a cave atop a jagged mountain. Zelda is rumored to have great power, but those who seek her out should beware the dangers that lurk in her domain. |\n| 63         | Able | A jovial innkeeper who loves to share stories with his patrons. Able's Inn is the hub of activity in the town. |\n| 64         | Penelope | A skilled thief who is always one step ahead of the law. Penelope is a master of disguise and can blend in anywhere. |\n| 65         | Anselm | A haunted warrior who bears the scars of many battles. Anselm is tormented by the things he has seen and done. |\n| 66         | Octavia | A mysterious woman who always seems to be one step ahead of everyone else. Octavia is not easily trusted, but she has a knack for getting things done. |\n| 67         | Peregrine | A gentle giant who is slow to anger but fearsome in battle. Peregrine is deeply loyal to those he considers friends. |\n| 68         | Cassandra | A moody sorceress who struggles to control her emotions. Cassandra's spells are unpredictable, but when they work, they work extremely well. |\n| 69         | Alastair | A brilliant inventor who is always tinkering with his latest creations. Alastair's gadgets are a marvel to behold. |\n| 70         | Yolanda | A headstrong young knight who is determined to prove herself on the field of battle. Yolanda is a fierce warrior who is not to be underestimated. |\n| 71         | Horatio | A pompous nobleman who is always looking down his nose at others. Horatio is not well-liked, but his wealth and power make him a force to be reckoned with. |\n| 72         | Rosalind | A shy young acolyte who is still learning the ways of the divine. Rosalind's faith is strong, but she lacks confidence in her abilities. |\n| 73         | Felix | A cheerful alchemist who is always experimenting with new potions. Felix's concoctions can be unpredictable, but they often have surprising effects. |\n| 74         | Gwendolyn | A skilled diplomat who is always looking for ways to avoid conflict. Gwendolyn is a master of negotiation and is highly respected in diplomatic circles. |\n| 75         | Nigel | A ruthless high priest who wields the power of his deity with impunity. Nigel is feared by all who know him. |\n| 76         | Ophelia | A melancholy artist who finds beauty in the darkest of places. Ophelia's paintings are a reflection of her soul. |\n| 77         | Ulrich | A dashing swashbuckler who can charm his way out of almost any situation. Ulrich is a consummate ladies' man. |\n| 78         | Anastasia | A calculating necromancer who is always looking for new corpses to animate. Anastasia's powers are not to be taken lightly. |\n| 79         | Percival | A brilliant strategist who has won countless battles for his kingdom. Percival's tactical genius is the stuff of legend. |\n| 80         | Valencia | A shrewd businesswoman who knows how to make a profit. Valencia is not above using underhanded tactics to get what she wants. |\n| 81         | Ignatius | A fearless adventurer who is always looking for the next challenge. Ignatius has a reputation for taking on impossible quests and emerging victorious. |\n| 82         | Nadia | A fierce warrior who will stop at nothing to protect her loved ones. Nadia is highly skilled in combat and is not to be trifled with. |\n| 83         | Marius | A surly mercenary who will do anything for the right price. Marius's loyalty can be bought, but it comes at a steep cost. |\n| 84         | Daphne | A mysterious assassin who operates in the shadows. Daphne is a master of infiltration and can take out her targets with deadly precision. |\n| 85         | Leonard | An absent-minded professor who is always getting lost in his own thoughts. Leonard's mind is a unique and brilliant one. |\n| 86         | Seraphina | A reclusive painter who creates breathtaking works of art. Seraphina is known to spend weeks at a time locked away in her studio. |\n| 87         | Reginald | A proud knight who will defend his honor and his kingdom to the death if necessary. Reginald is a force to be reckoned with on the battlefield. |\n| 88         | Celeste | A stargazing astronomer who is always looking up at the sky. Celeste has a deep fascination with the mysteries of the universe. |\n| 89         | Archibald | A bumbling scholar who is always getting things wrong. Archibald's well-meaning intentions are usually met with disaster. |\n| 90         | Harriet | A dour librarian who guards her books jealously. Harriet is not fond of outsiders and can be quite prickly. |\n| 91         | Augustus | A gruff old sea captain who has spent his life on the waves. Augustus's experiences have left him with many stories to tell. |\n| 92         | Rosalind | A gentle florist who has a way with plants. Rosalind's flower shop is the most beautiful in the land. |\n| 93         | Simon | A brilliant engineer who has built many of the most impressive structures in the kingdom. Simon is a true master of his craft. |\n| 94         | Cordelia | A reclusive scholar who spends her days poring over dusty old tomes. Cordelia's vast knowledge of history is deeply respected. |\n| 95         | Frederick | A gruff and stoic warrior who prefers action over words. Frederick is a man of few words, but his deeds speak volumes. |\n| 96         | Lysander | A bookish mage who is more comfortable in his laboratory than on the battlefield. Lysander is highly respected by his peers for his intellect. |\n| 97         | Hermione | A studious clerk who keeps immaculate records. Hermione's organizational skills are the envy of all who know her. |\n| 98         | Conrad | A mysterious figure who is always lurking in the shadows. Conrad is rumored to be involved in some very shady dealings. |\n| 99         | Odessa | A fierce pirate queen who commands a crew of cutthroats. Odessa is feared by all who sail the seas. |\n| 100        | Maximilian | A flashy showman who loves to put on a good spectacle. Maximilian's magic shows are the talk of the town. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| **Dice Value** | **Name** | **Description** |\n|:--------------:|:--------:|:---------------:|\n| 1 | Skitter | Skitter is a muscular kobold with rough scales the color of dry soil. Their eyes are a deep red, and they move quickly and gracefully. |\n| 2 | Sneezle | Sneezle is a small and wiry kobold with patches of scales missing on their arms and legs. They're prone to fits of sneezing, but are generally friendly and quick-witted. |\n| 3 | Klikk | Klikk wears a long coat made of patchwork leather, with dozens of pockets and pouches. They're a bit dim-witted, but their coat is filled with all sorts of useful odds and ends. |\n| 4 | Rikkit | Rikkit is a kobold with slick, polished scales the color of wet slate. They always seem to be grinning, and they're quick to make a joke or a bet. |\n| 5 | Zort | Zort is an old kobold with clouded eyes and a crooked back. They're a bit crotchety, but they're also incredibly wise and knowledgeable about the local area. |\n| 6 | Snik-Snak | Snik-Snak is a short and chubby kobold who is always munching on something (usually insects). They're friendly enough, but their breath smells terrible. |\n| 7 | Gribble | Gribble is a scrappy little kobold with a fierce temperament. They're quick with a knife and not afraid to stand up for themselves or their friends. |\n| 8 | Chirp | Chirp is a curious and talkative kobold with a bright and cheerful personality. They're always asking questions and trying to learn new things. |\n| 9 | Drukk | Drukk is a kobold who loves to tinker and invent things. They're always carrying around bits of scrap metal and wire, and they're always busy working on some new creation. |\n| 10 | Grack | Grack is a well-spoken kobold with a gift for persuasion. They're often the face of their small kobold tribe, dealing with outsiders and negotiating deals. |\n| 11 | Squeak | Squeak is a kobold with large, sensitive ears and a talent for mimicry. They can imitate the sounds of any creature they've ever heard, and they're an excellent scout and ambush predator. |\n| 12 | Noggen | Noggen is a kobold with a keen sense of smell and a love of all things spicy. They're an excellent cook, and their campfire meals are the stuff of legend. |\n| 13 | Bleat | Bleat is a timid and easily frightened kobold who is afraid of just about everything. They make up for their lack of bravery with a talent for hiding and sneaking. |\n| 14 | Skree | Skree is a noisy and obnoxious kobold who loves to play pranks and cause trouble. They're not necessarily malicious, but they can be incredibly annoying. |\n| 15 | Snarl | Snarl is a kobold with a short temper and a love of fighting. They're always looking for a good brawl, and they're not afraid to pick a fight with creatures much larger than themselves. |\n| 16 | Hiss | Hiss is a quiet and reserved kobold who communicates mostly through body language and hissing noises. They're an excellent tracker and hunter, and they're always ready to pounce on their prey. |\n| 17 | Gnash | Gnash is a kobold with large, razor-sharp teeth and a deep and gruff voice. They're not much of a talker, but they're an excellent fighter and guard. |\n| 18 | Spur | Spur is a kobold with long and spindly arms and legs. They're incredibly nimble and quick, and they're an excellent climber and acrobat. |\n| 19 | Glimmer | Glimmer is a kobold who is fascinated by shiny objects and gems. They're always looking for ways to acquire more treasure, and they're an excellent thief and scavenger. |\n| 20 | Squint | Squint is a kobold with squinty eyes and a sharp mind. They're an excellent problem solver and strategist, and they can often find ways out of tricky situations. |\n| 21-100 | *Roll again or invent your own!* | *Roll again or invent your own NPC name and description with a kobold theme!* |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01 | Hisska | This Lizardfolk has dark green scales and piercing yellow eyes. Their slitted nostrils emit a constant hiss. |\n| 02 | Chomper | One of the larger Lizardfolk, Chomper is covered in mottled brown scales and has a mouth full of razor-sharp teeth. |\n| 03 | Swamper | Swamper is a Lizardfolk with vibrant blue scales and wide, expressive eyes. They move with a graceful, almost fluid manner. |\n| 04 | Slash | This Lizardfolk has a scar running down one side of their face, giving them a fearsome appearance. Their scales are a dull grey-green. |\n| 05 | Coil | Coil is a sleek and sinewy Lizardfolk, with glossy black scales. Their movements are precise and almost snake-like. |\n| 06 | Snapper | With broad, powerful jaws and mottled green scales, Snapper is an intimidating presence. But they often have a sly look in their eye that suggests a sense of humor. |\n| 07 | Flicker | Flicker is a Lizardfolk with shimmering gold scales that catch the light in an almost hypnotic way. Their tongue flicks in and out of their mouth nervously. |\n| 08 | Rustle | This Lizardfolk is covered in rough, rust-colored scales that almost blend in with their surroundings. They have a cautious and observant air about them. |\n| 09 | Scale | Scale is a Lizardfolk with a scrappy, almost scruffy appearance. Their scales are a mix of greens and browns, and they tend to be quick and agile in their movements. |\n| 10 | Glimmer | With deep, moody purple scales that almost seem to glow in the dark, Glimmer is a memorable sight. They have a tendency to brood and keep to themselves. |\n| 11 | Thrasher | Thrasher is a burly Lizardfolk with thick, knobbly scales and a fierce expression. They have a tendency to charge headfirst into conflict. |\n| 12 | Ember | This Lizardfolk's scales are a bright, fiery red. They have a restless energy about them and are always on the hunt for something new and exciting. |\n| 13 | Scuttle | Scuttle is a small and wiry Lizardfolk, with a sandy-yellow color to their scales. They move quickly and quietly, with a skittering gait. |\n| 14 | Bask | Bask is a Lizardfolk with shimmering copper-green scales that give off a warm, friendly vibe. They enjoy soaking up the sun and relaxing when they can. |\n| 15 | Drifter | This Lizardfolk has a wandering, aimless air about them. Their scales are a mix of greys, silvers, and blues that shimmer in the light. |\n| 16 | Slither | Slither is a sleek and deadly-looking Lizardfolk, with jet black scales and keen, intelligent eyes. They tend to move in a stealthy and unpredictable manner. |\n| 17 | Snap | Snap is a Lizardfolk with a quick and explosive temper. Their scales are a brassy, metallic yellow that seems to match their fiery personality. |\n| 18 | Rust | Rust has a weathered and rugged appearance, with deep brown scales that have a rough, scaly texture. They're usually seen with a thoughtful expression on their face. |\n| 19 | Sizzle | This Lizardfolk's scales are a shimmering, iridescent blue that seems to crackle with energy. They tend to have an impulsive and excitable personality. |\n| 20 | Glide | Glide is a graceful and fluid Lizardfolk, with emerald green scales and piercing blue eyes. They're known for their agility and quick reflexes. |\n| 21 | Spit | With a snakelike tongue that's constantly flicking in and out of their mouth, Spit has a lizard-like intensity to them. Their scales are a mix of black and reddish-brown. |\n| 22 | Rattle | Rattle is a Lizardfolk with a menacing and intimidating air about them. Their scales are a dull, earthy brown, and they tend to move with a coiled intensity that suggests a dangerous predator. |\n| 23 | Smolder | Smolder is a Lizardfolk with a smoky charcoal-grey color to their scales. They have a tendency to brood and hold grudges. |\n| 24 | Dart | This Lizardfolk is quick and nimble, with scales that are a deep and vivid purple. They're known for their lightning-fast reflexes and agility. |\n| 25 | Lurk | Lurk is a shadowy and mysterious figure, with slate-grey scales that blend in with their surroundings. They have a wary and observant air about them. |\n| 26 | Gape | With a mouth that seems to gape open at all times, this Lizardfolk has a somewhat goofy appearance. Their scales are a mix of greens and browns. |\n| 27 | Blaze | Blaze has shimmering orange scales that give off a warm and inviting vibe. They have a kind and generous personality, but can also be fiercely protective. |\n| 28 | Strike | Strike is a Lizardfolk with a fiery and impulsive personality. Their scales are a deep, rich red, and they tend to charge into situations headfirst. |\n| 29 | Skulk | With deep and brooding brown scales, Skulk has a crafty and wily personality to match. They tend to keep to themselves and stay out of the limelight. |\n| 30 | Glare | Glare is an intense and intimidating figure, with scales that are a dusty and muted red. They have a tendency to stare down their foes with an unblinking, almost hypnotic gaze. |\n| 31 | Smack | Smack is a Lizardfolk with thick and heavy scales that almost look like armor. They tend to be blunt and straightforward in their dealings with others. |\n| 32 | Dusk | With scales that are a muted and somber grey, Dusk has a melancholy and introspective air about them. They tend to be deep thinkers and introspective souls. |\n| 33 | Stalker | Stalker is a Lizardfolk with a slinking and predatory gait. Their scales are a deep, dark green that almost seems to blend in with the shadows. |\n| 34 | Bolt | Bolt is a quick and energetic Lizardfolk, with scales that are a vibrant and sparkling blue. They're known for their lightning-fast reflexes and agility. |\n| 35 | Skim | With scales that are a glimmering and reflective silver, Skim is a Lizardfolk with a quick and darting personality. They tend to be flighty and always on the move. |\n| 36 | Curl | Curl is a Lizardfolk with deep, mossy green scales that almost look fuzzy to the touch. They have a gentle, almost domestic air about them. |\n| 37 | Crawl | Crawl is a Lizardfolk with scales that are a faded and dusty brown. They move with a slow and steady gait, and tend to be deliberate thinkers. |\n| 38 | Spark | With scales that glimmer and crackle with a fiery energy, Spark is a Lizardfolk with a vivacious and excitable personality. They tend to be outgoing and eager to make new friends. |\n| 39 | Strikeout | Strikeout is a Lizardfolk with a fierce and competitive streak. They have scales that are a vibrant and standout green, and tend to always be looking for the next challenge. |\n| 40 | Squirm | With smooth and glossy scales that almost seem to glow, Squirm is a Lizardfolk with a playful and curious personality. They enjoy exploring their surroundings and trying new things. |\n| 41 | Thrive | Thrive is a Lizardfolk with deep, earthy brown scales. They move with a confident and assured gait, and tend to be ambitious and driven. |\n| 42 | Fang | Fang is a Lizardfolk with razor-sharp teeth and a fierce expression. Their scales are a mix of deep greens and browns, and they tend to be formidable opponents in battle. |\n| 43 | Razzle | With scales that are a iridescent and glittering gold, Razzle is a Lizardfolk with an outgoing and charismatic personality. They tend to be the life of the party. |\n| 44 | Fangs | Fangs has a menacing and predatory aura about them. Their scales are a deep, earthy brown that almost looks like tree bark. |\n| 45 | Twirl | Twirl is a Lizardfolk with shimmering blue scales that almost seem to dance in the light. They have a playful and whimsical personality, and tend to enjoy having fun. |\n| 46 | Spawn | Spawn is a Lizardfolk with rough and heavy scales that suggest a hard and brutal life. They tend to have a surly and defensive personality. |\n| 47 | Slink | With scales that are a deep, smoky grey, Slink is a Lizardfolk with a sly and sneaky personality. They tend to move with a quiet and stealthy gait. |\n| 48 | Flame | Flame is a Lizardfolk with scales that are a vibrant and fiery orange-red color. They have a tumultuous and intense personality that tends to burn hotly. |\n| 49 | Stare | Stare is a Lizardfolk with piercing and hypnotic eyes. Their scales are a deep and sultry purple that seems to almost shimmer in the light. |\n| 50 | Snapjaw | With a mouth that seems to snap constantly, Snapjaw is a Lizardfolk with a somewhat irritating presence. They tend to be impulsive and quick to anger. |\n| 51 | Swoop | Swoop is a quick and graceful Lizardfolk, with scales that are a deep and calming blue. They tend to move with a fluid and almost effortless grace. |\n| 52 | Shamble | Shamble is a Lizardfolk with scales that are a dull and muted grey. They have a tired and lethargic aura about them, often looking physically exhausted. |\n| 53 | Twitch | Twitch is a Lizardfolk with a nervous and skittish personality. Their scales are a deep and dark blue, almost navy in color. |\n| 54 | Molt | Molt is a Lizardfolk with scales that seem to be constantly in a state of flux. They're always shedding old ones and growing new ones, giving them a somewhat impermanent appearance. |\n| 55 | Swirl | With scales that are an iridescent and shimmering mix of blue and green, Swirl is a Lizardfolk with an outgoing and effervescent personality. They tend to be positive and upbeat. |\n| 56 | Glisten | Glisten is a Lizardfolk with scales that almost seem to sparkle in the light. They have a warm and welcoming aura about them, but can also be somewhat vain. |\n| 57 | Plod | Plod is a Lizardfolk with scales that are heavy and cumbersome. They have a slow and laborious gait, and tend to be somewhat reserved. |\n| 58 | Rip | Rip is a Lizardfolk with a fearsome and ferocious presence. Their scales are a bold and striking crimson, and they tend to be quick to anger. |\n| 59 | Swoosh | Swoosh is a Lizardfolk with scales that are a deep and calming green. They have a gentle and soothing aura about them, and tend to be good listeners. |\n| 60 | Rusty | With scales that are a pitted and worn brown, Rusty has a tough and weathered appearance. They tend to be stubborn and unwilling to budge on issues. |\n| 61 | Squeeze | Squeeze is a Lizardfolk with a somewhat floppy and awkward appearance. They tend to have a gentle and unassuming personality. |\n| 62 | Tarnish | Tarnish has scales that are a dull and tarnished brown color. They tend to be somewhat morose and pessimistic in their outlook. |\n| 63 | Zest | With scales that are a bright and vibrant green, Zest is a Lizardfolk with an enthusiastic and energetic personality. |\n| 64 | Slap | Slap is a Lizardfolk with scales that are rough and almost bristly in texture. They tend to be abrupt and somewhat confrontational in their dealings with others. |\n| 65 | Stride | Stride is a Lizardfolk with a confident and commanding presence. Their scales are a deep and powerful shade of green. |\n| 66 | Glint | With scales that glimmer and catch the light, Glint is a Lizardfolk with a somewhat flashy and showy personality. They enjoy being the center of attention. |\n| 67 | Stomp | Stomp is a Lizardfolk with scales that are thick and heavy, giving them a somewhat lumbering appearance. They tend to have a stubborn and persistent personality. |\n| 68 | Tangle | Tangle is a Lizardfolk with scales that seem to knot and tangle together in places. They tend to be somewhat disheveled in their appearance. |\n| 69 | Flick | Flick is a Lizardfolk with a quick and almost darting presence. Their scales are a deep and vivid blue. |\n| 70 | Pounce | Pounce is a Lizardfolk with a fierce and predatory presence. Their scales are a deep and striking black, and they tend to be intimidating foes. |\n| 71 | Burst | Burst is a Lizardfolk with a somewhat explosive personality. Their scales are a deep and passionate red. |\n| 72 | Churn | Churn is a Lizardfolk with scales that seem to twist and turn in strange patterns. They tend to have a whimsical and unpredictable personality. |\n| 73 | Gripe | Gripe is a Lizardfolk with a surly and complaining aura about them. Their scales are a dull and almost dirty green. |\n| 74 | Glug | With scales that have a somewhat bumpy and lumpy appearance, Glug is a Lizardfolk with a lackadaisical and somewhat slovenly aura. |\n| 75 | Sprawl | Sprawl is a Lizardfolk with scales that almost seem to sprawl out in all directions. They tend to be laid-back and easygoing in their personality. |\n| 76 | Sludge | Sludge is a Lizardfolk with a somewhat heavy and ponderous aura. Their scales are a murky and swampy brown. |\n| 77 | Strikeforce | With scales that are a vivid and passionate red, Strikeforce is a Lizardfolk with a fiercely competitive personality. |\n| 78 | Glimpse | Glimpse is a Lizardfolk with scales that seem to be constantly changing color and texture. They tend to be somewhat mysterious and enigmatic. |\n| 79 | Shimmer | With scales that glimmer and shine in the light, Shimmer is a Lizardfolk with a graceful and almost ethereal presence. |\n| 80 | Hunker | Hunker is a Lizardfolk with scales that almost seem to be hunkering down onto their body. They have a cautious and defensive personality. |\n| 81 | Jolt | Jolt is a Lizardfolk with a quick and impulsive personality. Their scales are a vibrant and striking purple. |\n| 82 | Smatter | Smatter is a Lizardfolk with scales that are a mottled and patchwork mixture of colors. They tend to be somewhat scatterbrained and unfocused. |\n| 83 | Slump | Slump is a Lizardfolk with a lethargic and apathetic presence. Their scales are a muted and faded brown. |\n| 84 | Sway | Sway is a Lizardfolk with a fluid and almost hypnotic gait. Their scales are a deep and calming green. |\n| 85 | Scrape | With scales that are rough and almost abrasive to the touch, Scrape is a Lizardfolk with a somewhat prickly and confrontational personality. |\n| 86 | Skein | Skein is a Lizardfolk with scales that seem to weave together in intricate and complex patterns. They tend to be patient and methodical in their thinking. |\n| 87 | Sparkle | Sparkle is a Lizardfolk with scales that catch and reflect the light in dazzling patterns. They tend to be effusive and outgoing in their personality. |\n| 88 | Slouch | Slouch is a Lizardfolk with a somewhat lazy and lethargic aura. Their scales are a dull and muted grey. |\n| 89 | Slinker | Slinker is a Lizardfolk with a sly and sneaky personality. Their scales are a deep and dark black. |\n| 90 | Sneak | Sneak is a Lizardfolk with scales that are a muted and almost stealthy green. They tend to move with a quiet and secretive gait. |\n| 91 | Smear | Smear is a Lizardfolk with scales that seem to smear together in strange and unusual patterns. They tend to be somewhat mischievous in their personality. |\n| 92 | Smirk | Smirk is a Lizardfolk with a smug and self-satisfied personality. Their scales are a deep and sultry black. |\n| 93 | Smug | With a superiority complex that's hard to shake, Smug is a Lizardfolk with scales that are a glistening and self-satisfied green. |\n| 94 | Snicker | Snicker is a Lizardfolk with a somewhat annoying and irritating presence. Their scales are a muted and dull brown. |\n| 95 | Sob | Sob is a Lizardfolk with a melancholy and sad demeanor. Their scales are a muted and almost mournful black. |\n| 96 | Splice | Splice is a Lizardfolk with scales that seem to be spliced together in strange and unusual patterns. They tend to have a slightly unsettling aura about them. |\n| 97 | Spout | With a talkative and expressive personality, Spout is a Lizardfolk with scales that are a deep and intense blue. |\n| 98 | Squint | Squint is a Lizardfolk with eyes that seem to squint and almost disappear into their face. Their scales are a dull and muddy green. |\n| 99 | Strut\r\n\nChatbot reponse terminated unexpectedly: : length\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01-05 | Gruumsh | A large and imposing orc with a deep, booming voice. Scarred from many battles, he wears a necklace of bones as a sign of his victories. |\n| 06-10 | Drog | Short and stocky, Drog is a skilled blacksmith and armor smith. He has a no-nonsense attitude and takes great pride in his work. |\n| 11-15 | Vorg | A skilled hunter and tracker, Vorg is quick and stealthy. His leather armor is adorned with the teeth and claws of the creatures he's hunted. |\n| 16-20 | Gort | Gort is a shaman who specializes in the ancient orcish art of blood magic. He is often called upon to heal wounded orcs and to perform rites of passage. |\n| 21-25 | Korgul | A brute of an orc, Korgul is incredibly strong and incredibly stupid. He's often used as muscle by other orcs, but has a soft spot for animals and children. |\n| 26-30 | Hurgath | Hurgath is a cunning merchant who deals in all manner of goods, both legal and illegal. He's always looking for a way to make a profit. |\n| 31-35 | Zog | Zog is a renowned bard among the orcish tribes. He uses his music to tell tales of their history and culture, and to inspire his fellow orcs. |\n| 36-40 | Ugluk | Ugluk is a fierce warrior who never backs down from a fight. He's always looking for a new challenge, and often takes on opponents much larger than himself. |\n| 41-45 | Glar | Glar is a skilled trapmaker and engineer. He enjoys setting traps for unsuspecting prey and taking them down with his clever devices. |\n| 46-50 | Grishnak | Grishnak is a former slave who escaped from his human captors. He now leads a rebellion against their kind, hoping to free other orcs from bondage. |\n| 51-55 | Brorg | Brorg is a loyal guard and bodyguard. He's fiercely protective of the orcish leaders he serves, and will do whatever it takes to keep them safe. |\n| 56-60 | Krak | A solitary orc who lives in isolation in the mountains. No one knows why he lives there or what he does, but his reputation as a fearsome opponent keeps most orcs away. |\n| 61-65 | Rorg | Rorg is a skilled engineer who specializes in siege weaponry. He's always on the lookout for new and creative ways to take down fortifications and walls. |\n| 66-70 | Gruum | Gruum is a respected elder among the orcish tribes. He's seen it all and done it all, and often offers wisdom and guidance to the younger generation. |\n| 71-75 | Zug | Zug is a skilled wrestler, known for his immense strength and ability to take down much larger opponents. He's sometimes hired as muscle or for entertainment. |\n| 76-80 | Drogath | Drogath is a fierce warrior who relies on her agility and quickness to outmaneuver her opponents. She's often underestimated because of her size, but proves them all wrong. |\n| 81-85 | Gorgath | Gorgath is the leader of a powerful orcish tribe. He's a skilled strategist and diplomat, and has made alliances with other races to strengthen his people. |\n| 86-90 | Krug | Krug is a skilled assassin who specializes in taking out high-value targets. He's a master of stealth and always has a trick up his sleeve. |\n| 91-95 | Urgath | Urgath is a skilled necromancer who uses his powers to raise armies of undead to serve his people. He's feared and respected by all who know him. |\n| 96-00 | Grukk | Grukk is a notorious pirate who roams the seas raiding ships and plundering treasure. He's a feared opponent on land and sea, and is always looking for his next big score. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 01-03 | Akmenos | A Tiefling with black horns and a silver tongue. He's known for his deceitful ways. |\n| 04-06 | Calaxia | A Tiefling with ruby red eyes and auburn hair. She's a talented bard and travels the land performing her music. |\n| 07-09 | Dantalion | A Tiefling paladin with golden eyes and a sense of justice that's unwavering. He's always ready to fight for what's right. |\n| 10-12 | Eryndor | A Tiefling wizard with deep blue skin and a love for knowledge. He spends most of his time holed up in his tower reading ancient tomes. |\n| 13-15 | Falx | A Tiefling rogue with emerald green eyes and a sharp wit. She's quick to pick a pocket or two and has a knack for getting out of trouble. |\n| 16-18 | Grazzan | A Tiefling fighter with obsidian horns and a fierce determination. He's a skilled warrior and often leads groups into battle. |\n| 19-21 | Helia | A Tiefling cleric with eyes that glow with divine power. She's a devout follower of her god and will stop at nothing to spread their word. |\n| 22-24 | Jazirian | A Tiefling ranger with flame-red hair and eyes that change with the seasons. They're at one with nature and can navigate even the most treacherous terrain. |\n| 25-27 | Kaelis | A Tiefling warlock with smoky grey skin and a deal with a devil. They're both feared and respected for their dark powers. |\n| 28-30 | Lirien | A Tiefling sorcerer with violet eyes and an unpredictable nature. Their magic is wild and often results in unintended consequences. |\n| 31-33 | Mazikeen | A Tiefling rogue with raven-black hair and a shadowy demeanor. She's a skilled assassin and can disappear into the darkness with ease. |\n| 34-36 | Naberius | A Tiefling bard with silver hair and a silver tongue. He's a charming and charismatic performer, but also has a bit of a reputation as a ladies' man. |\n| 37-39 | Ophirae | A Tiefling wizard with eyes that glow with inner fire. She's a master of pyromancy and can conjure flames with ease. |\n| 40-42 | Pharzuph | A Tiefling cleric with golden skin and a love for battle. She's a fierce warrior and often leads armies into war. |\n| 43-45 | Qemuel | A Tiefling rogue with eyes that seem to sparkle with mischief. He's a quick-witted thief and often gets into trouble with the law. |\n| 46-48 | Raze | A Tiefling fighter with a face that's been scarred in battle. He's a hardened veteran and a skilled tactician. |\n| 49-51 | Samael | A Tiefling paladin with deep red skin and eyes that seem to glow with holy light. He's a champion of justice and always fights for the innocent. |\n| 52-54 | Tethys | A Tiefling ranger with eyes that seem to change with the tides. She's at home on the water and can navigate even the most treacherous seas. |\n| 55-57 | Uzza | A Tiefling warlock with eyes that seem to pierce the soul. She's a master of eldritch magic and wields dark powers with ease. |\n| 58-60 | Valtiel | A Tiefling sorcerer with eyes that sparkle with vibrant energy. His magic is unpredictable and often results in wild, explosive displays. |\n| 61-63 | Xaphan | A Tiefling rogue with eyes that seem to glitter like gold. He's a smooth operator and is often found working as a hired thief or assassin. |\n| 64-66 | Yazidi | A Tiefling cleric with eyes that glow with inner light. She's a powerful healer and often travels the land helping those in need. |\n| 67-69 | Zepar | A Tiefling bard with eyes that seem to twinkle with music. He's a talented performer and often travels with his band of musicians. |\n| 70-72 | Abraxas | A Tiefling wizard with eyes that seem to contain entire worlds. He's a master of arcane magic and is rumored to know secrets that could shake the very foundations of the world. |\n| 73-75 | Bael | A Tiefling paladin with eyes that glow like the sun. He's a fierce warrior and a devout follower of his god. |\n| 76-78 | Cimeries | A Tiefling ranger with obsidian skin and a love for the hunt. He's a skilled tracker and often takes on contracts to hunt dangerous beasts. |\n| 79-81 | Decarabia | A Tiefling warlock with eyes that seem to contain the void. She's a master of dark magic and can summon otherworldly horrors with ease. |\n| 82-84 | Eligor | A Tiefling sorcerer with hair that seems to be made of pure silver. Her magic is fluid and graceful, like a dance. |\n| 85-87 | Flauros | A Tiefling rogue with eyes that gleam with greed. He's a skilled thief and often takes on jobs with high payouts. |\n| 88-90 | Gaap | A Tiefling cleric with eyes that seem to glow with holy light. He's a powerful preacher and often travels the land spreading the gospel of his god. |\n| 91-93 | Halphas | A Tiefling bard with eyes that seem to twinkle like stars. She's a talented performer and often regales her audience with tales of adventure and romance. |\n| 94-96 | Iblis | A Tiefling wizard with eyes that seem to contain the flames of hell. His magic is fiery and he's a master of destruction spells. |\n| 97-99 | Jinn | A Tiefling paladin with eyes that seem to radiate goodness. She's a fierce fighter and a devout follower of her god. |\n| 100 | Kalki | A Tiefling ranger with eyes that seem to contain the essence of nature. She's at one with animals and can communicate with them on a primal level. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}