{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "Dungeons & Dragons Rolltables",
  "description": "A compendium of 5e compatible rolltables generated by ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n| d20 Roll | Critical Failure Effect |\n|---|---|\n| 1 | Your weapon slips from your hand and lands 10 feet in a random direction. |\n| 2 | You strike a solid surface with your weapon, dealing its minimum damage to it instead. |\n| 3 | You overextend yourself in your attack, becoming unbalanced. Your speed is halved until the start of your next turn. |\n| 4 | Your attack ricochets back, dealing the weapon's minimum damage to yourself. |\n| 5 | You stumble and fall prone. |\n| 6 | You leave an opening in your defense. The next attack against you has advantage. |\n| 7 | Your weapon becomes lodged in a nearby object or surface and requires a successful Strength check to free. |\n| 8 | Your weapon suffers a -1 penalty to damage rolls until repaired. |\n| 9 | You twist awkwardly during your swing shifting your armor. Until you spend an action to fix it, your AC is reduced by 1. |\n| 10 | You hit an unintended target (determined by the DM) with your attack instead. |\n| 11 | Your attack misses completely, causing you to spin around and becoming disoriented. You can't take reactions until the start of your next turn. |\n| 12 | Your weapon's string, strap, or handle breaks, rendering it unusable until repaired. |\n| 13 | Your overreach leaves you vulnerable, your opponent can make one melee attack against you as a reaction. |\n| 14 | Your weapon strikes a nearby object, creating a loud noise that attracts nearby entities. |\n| 15 | Your weapon clatters to the ground at your feet. Picking it up requires an action. |\n| 16 | You strike yourself lightly, taking 1 point of bludgeoning damage. |\n| 17 | You strain a muscle during your swing. Your Strength or Dexterity (your choice) is reduced by 1 until you finish a short or long rest. |\n| 18 | You lose your grip and throw your weapon, it lands 15 feet in a random direction. |\n| 19 | The recoil from your attack leaves you temporarily blind. You are blinded until the start of your next turn. |\n| 20 | During your attack, you trip and fall, becoming prone. Additionally, you accidentally kick your weapon 5 feet away from you. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Melee"
    },
    {
      "rawText": "## Ranged\r\n| d20 roll | Mishap |\n| --- | --- |\n| 1 | Your weapon backfires, dealing its normal damage to you.\n| 2 | Your projectile veers off course, striking the nearest ally for half damage.\n| 3 | Your projectile veers off course, striking a random object. Roll to determine if the object is destroyed.\n| 4 | Your projectile snaps in half upon firing, making you take 1d4 piercing damage.\n| 5 | Your bowstring snaps, rendering the weapon unusable until repaired.\n| 6 | Your weapon slips from your grip, landing 1d10 feet away in a random direction.\n| 7 | Your ranged attack ricochets, crashing into an unintended object, it could draw unwanted attention.\n| 8 | Your failed attempt seizes your weapon; it won't function again until you spend an action to fix it.\n| 9 | You overextend your shot, causing strain. The next attack roll made within 24 hours is at disadvantage.\n| 10 | Your ammunition is flawed, causing it to explode upon firing. Deal 1d6 fire damage to yourself.\n| 11 | Your attack shakes your combat readiness. You lose your next bonus action. \n| 12 | Your mishap dislocates your shoulder. Suffer -1 to all attack rolls until you can take a short or long rest.\n| 13 | You stumble during your attack, moving 5 feet in a random direction, potentially causing opportunity attacks.\n| 14 | Your grip slips, and the weapon goes flying from your hand, landing 2d6 feet in a random direction.\n| 15 | A string, cord, or linkage on your gear catches, causing your whole ranged setup to unravel. It takes one full action to get it ready again.\n| 16 | You misjudge the wind and your aim deviates widely, potentially alerting enemies to your presence.\n| 17 | Your mishandling of the weapon causes it to jam. You must succeed a DC15 Dexterity check to unjam it.\n| 18 | Your attack goes extremely wide, potentially causing a cave-in or rockslide if in an unstable area.\n| 19 | Your released missile goes wildly off course, potentially hitting an object of sentimental importance.\n| 20 | You draw too powerfully, your ranged weapon snaps causing damage equal to the weapon's die to yourself. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Ranged"
    },
    {
      "rawText": "## Arcane\r\n**d20 Rolltable: Arcane Mishaps from a Critical Failure**\n\n| d20 Roll | Effect |\n|-------------|-------------------------------------------------|\n| 1 | A surge of arcane energy backlashes, causing you to take damage equal to the spell level. |\n| 2 | You inadvertently open a temporary portal to a random plane of existence. A harmless but often alarming entity appears and immediately flees. |\n| 3 | The misfired spell causes your arcane focus to shatter, rendering it useless. |\n| 4 | Spells cast by you cause sensory hallucinations in a 20-foot radius until dispelled. |\n| 5 | The misdirected magic amplifies auditory senses around you - your party's Stealth checks will be at disadvantage for the next hour. |\n| 6 | The spell's fallout causes gravity to fluctuate within a 30 foot radius. This unpredictable gravity lasts for 1d4 rounds. |\n| 7 | Arcane energy swirls around you wildly, reducing your movement speed by half for 10 minutes. |\n| 8 | The failed spell forms a short-lived but terrifying illusory image of a powerful monster. |\n| 9 | Your magic distorts the fabric of reality temporarily. For the next minute, time seems to slow down for everyone but you. |\n| 10 | Your arcane magic lashes out, randomly banishing an unattended object within a 10 foot radius to another plane of existence. |\n| 11 | Your spell rebounds to imbue the nearest adversary with a minor, random boon for 1d4 rounds. |\n| 12 | The spell discharges a burst of light, blinding you for 1d4 rounds. |\n| 13 | You temporally lost control over your magic. Your spells are replaced with random cantrips for 1d4 rounds. |\n| 14 | Your spell arcs off course, creating an elemental creature of the spell's type that is hostile to you. |\n| 15 | Your magic implode inwards. You cannot use magic and have disadvantage on all attacks for 1d4 rounds. |\n| 16 | Errant arcane explosion makes all creatures within 20 ft radius Deafened for 1d4 rounds. |\n| 17 | Your misfire creates an aura of arcane energy around you. All allies within 10 ft radius lose Resistances and Immunities for 1 minute. |\n| 18 | The spell unexpectedly splits, affecting a random secondary target with a halved dice roll. |\n| 19 | The force of the magical mishap sends you flying 10 feet in the opposite direction. |\n| 20 | Arcane energy builds up inside you. Your next spell has a 50% chance to fail, but if it succeeds, it counts as a critical success. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Arcane"
    },
    {
      "rawText": "## Melee\r\n| d20 Roll | Boon |\n|---------|---------|\n| 1 | Your critical hit opens up an opportunity for an ally, granting them advantage on their next attack. |\n| 2 | Your hit inspires your allies. They each gain a d4 that they can add to a check, attack or saving throw within the next minute. |\n| 3 | Your strike resonates with power, causing your target to take an additional die of damage. |\n| 4 | Your hit disorients your target. Their speed is reduced by half until the start of your next turn. |\n| 5 | Your devastating strike agitates the environment, causing small objects to be hurled at other enemies, dealing 1d4 damage to them. |\n| 6 | Your powerful strike leaves a lingering impact. The target has disadvantage on its next attack roll.  |\n| 7 | Your strike is so overwhelming that the target is stunned until the end of its next turn. |\n| 8 | Your hit is so well-placed that the target gets pushed 10ft away from you. |\n| 9 | Your critical hit leaves the target vulnerable, and it takes double damage from the next attack that hits it before the end of your next turn. |\n| 10 | Your melee attack disarms your target. Horizontal blows force the target to drop an item of your choice that it’s holding. |\n| 11 | Your strike causes your weapon to glow with power until the start of your next turn. The next creature hit by it takes additional radiant damage equal to your level. |\n| 12 | Your melee attack scares all enemies within 20ft of you, causing them to have disadvantage on their next attack. |\n| 13 | Your successful attack leaves your target off balance. Your target has disadvantage on Dexterity (Acrobatics) checks until the start of your next turn. |\n| 14 | Your powerful hits grant you a shield of momentum. Gain temporary hit points equal to half the damage dealt to the enemy. |\n| 15 | Your hit explodes with force and shrapnel, imposing disadvantage on the target's next attack roll or ability check. |\n| 16 | You are in perfect sync with your weapon, granting you +2 to Armor Class until the start of your next turn. |\n| 17 | Your melee hit allows you to immediately make one additional attack as a bonus action. |\n| 18 | Your hit shocks the opponent, causing it to be silenced until the end of its next turn. |\n| 19 | Your critical hit connects with such force that the target is knocked prone. |\n| 20 | In a stunning display of skill and precision, your hit causes maximum damage. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Melee"
    },
    {
      "rawText": "## Ranged\r\n| d20 Roll | Boons due to a Critical Success on a Ranged Attack |\n| --- | --- |\n| 1 | The attack deals max damage, then roll the damage dice again and add the total. |\n| 2 | The projectile pierces through the target, potentially hitting another target behind it. |\n| 3 | Stunning shot. The target is stunned until the end of your next turn. |\n| 4 | The target drops whatever it is holding as your shot hits its hand or equivalent. |\n| 5 | Your ranged attack disorients the target, giving it disadvantage on its next attack roll. |\n| 6 | Your attack shatters the target's armor or natural armor, reducing its AC by 1 until repaired/restored. |\n| 7 | Your attack causes the target to be knocked prone. |\n| 8 | The critical hit causes a major wound, the target loses 1 hit point each round until healed. |\n| 9 | Your shot hits the target in a sensitive area, reducing their speed by half until healed. |\n| 10 | The critical hit causes the target to be blinded until the end of its next turn. |\n| 11 | Double the range of your next ranged attack due to an improved understanding of your weapon. |\n| 12 | You find a weak point in your target's defense. Your next attack roll on the same target has advantage. |\n| 13 | Your attack inspires fear to observers. Enemies within 30 feet of the target must succeed a DC 15 Wisdom saving throw or become frightened of you until the end of your next turn. |\n| 14 | The shot ricochets off the target into another, roll another attack for the second target. |\n| 15 | Your shot makes a loud impact echoing through the vicinity and all creatures within 60 feet are aware of your location. |\n| 16 | Your target is pushed 10 feet back from the force of the blow. |\n| 17 | Disrupting shot. The target can’t take reactions until the end of its next turn. |\n| 18 | Your critical success grants you immediate insight. Gain advantage on the next attack roll against this target. |\n| 19 | Pathfinding shot. You can see the shortest path to the target until the end of the combat. |\n| 20 | Fatality shot. If the target's hit points are 10 or lower, it is slain instantly. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| D20 Roll | Boon Due to Critical Success on Arcane Attack |\n|----------|----------------------------------------------|\n| 1        | Arcane energy lingers, providing a +2 bonus to the next attack roll. |\n| 2        | A surge of magic strengthens your body, temporarily increasing your maximum hit points by 4. |\n| 3        | Your spell resonates with the energies of the Weave, causing your next spell to consume half the usual spell slot. |\n| 4        | Your next successful arcane attack is imbued with a minor smite, dealing an additional 1d6 damage. |\n| 5        | The arcane energy allows you a glimpse into the future. You gain advantage on the next saving throw. |\n| 6        | Your next cantrip is treated as if cast at one level higher than your current. |\n| 7        | The arcane energy forms a temporary barrier, providing +2 AC for one round. |\n| 8        | Your magic brims with vitality, restoring 1d4 hit points to you or an ally within 30 feet. |\n| 9        | Your spell leaves a smouldering glyph on the target that aids your sight, giving advantage on the next attack against it. |\n| 10       | The echo of your spell strengthens you, granting temporary resistance to one damage type of your choice for one round. |\n| 11       | Your spellword resonates in the world, causing your next spell to require no verbal component. |\n| 12       | The arcane energies fortify your body, temporarily increasing your Strength, Dexterity, or Constitution by +1 for one hour. |\n| 13       | You channel extra energy into your spell, causing your next spell of 1st level or higher to deal an additional 1d4 damage. |\n| 14       | Your arcane attack rebounds, and your target takes an additional 1d6 force damage. |\n| 15       | The spell's potency gives you a surge of confidence, granting advantage on the next Charisma-based check or saving throw. |\n| 16       | Tendrils of magic reach out to your allies, providing them a +1 bonus to their next attack roll. |\n| 17       | Your successful attack resonates with arcane power, forcing your opponents to make a saving throw against being pushed 10 feet away from you. |\n| 18       | Your spell lands with perfect accuracy, bypassing any damage resistance the target may have. |\n| 19       | You rejuvenate some spell energy, recovering a used spell slot of a level lower than the spell just cast. |\n| 20       | Your arcane attack overflows with energy, hitting an additional target within range. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Skycaller Featherbrew | A grim, battle-hardened warrior with eyes like glittering sapphires. Detailed feathers line his arms. |\n| 2 | Windweaver Brightplume | A strong and silent figure whose stern expression is only broken by the faded scars marking his beak. |\n| 3 | Sunflight Swiftfeather | Tall, with an air of unyielding authority. His eyes display a depth of wisdom beyond his years. |\n| 4 | Skywatcher Fleetwing | Stoic and alert, her feathered brow never seems to relax. Her piercing gaze never misses a detail. |\n| 5 | Windcaller Stormclaw | A figure marshaled by the harshest winds, with a quiet aura of commanding respect. |\n| 6 | Rainwalker Dreambeak | Agile and perceptive, his every movement betrays a lifetime of stealth and subtlety. |\n| 7 | Flameheart Quickbeak | A hardened soldier with a stoic disposition and an ironclad sense of duty.|\n| 8 | Cloudseeker Lightplume | Battle-worn and authoritative, her silver feathers catch the light in a striking display. |\n| 9 | Autumnveil Fireflight | A weathered figure, his eyes carrying the weight of countless battles. |\n| 10 | Cloudhunter Skytalon | Silent and resolute, but beneath her calm demeanor lies a sharp strategic mind. |\n| 11 | Swiftflight Emberplume | Fierce and daunting, she commands respect with her hawk-like gaze and battle-hardened stance. |\n| 12 | Windwalker Dustbeak | A shadowy figure whose stern demeanor speaks of countless battles weathered. |\n| 13 | Stormchaser Dawnclaw | An ancient warrior, whose bright feathers contrast dark eyes filled with wisdom and secrets. |\n| 14 | Ironveil Sunwing | Stern, yet commanding, his swift movements hint at a lifetime of combat. |\n| 15 | Stormbearer Mistfeather | A brooding figure, his solemn expression betrays years of survival against untold challenges. |\n| 16 | Moonshadow Eagletalon | Stoic, with a thousand-yard stare that bespeaks years of sacrifices made in the line of duty. |\n| 17 | Windtreader Frostbeak | A grizzled veteran of many storms, his piercing gaze betrays a strong and resilient spirit. |\n| 18 | Thundercaller Starwing | Steely-eyed and noble, his stern gaze and firm posture speak volumes of his leadership. |\n| 19 | Stormwatcher Peakplume | Deriving strength from years of battle, her scarred beak betrays a tumultuous past. |\n| 20 | Raindancer Cloudfeather | Brooding and foreboding, her sense of seriousness can be felt by all those around her. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Seraphina | A celestial guide with silver hair and vibrant violet eyes, she emits a gentle glow and has an air of divine wisdom about her. |\n| 2 | Gabriel | A golden-haired Aasimar, his ivory wings reflect the light beautifully. His tranquil expression suggests deep, divine wisdom. |\n| 3 | Agalia | A serious, blue-eyed Aasimar with silver wings, her sapphire gaze portrays a blend of determination and kindness. |\n| 4 | Elysia | A striking Aasimar woman with golden hair and subtle, ethereal wings. Her eyes hold a spark of divine power. |\n| 5 | Raziel | A mighty warrior, his muscular frame is graced by shining, steel-colored wings and his eyes glow with divine intensity. |\n| 6 | Uriel | An Aasimar with a stern expression, his silver wings and amber eyes emit an air of solemn authority. |\n| 7 | Galadriel | Her flowing silver hair is complemented by iridescent wings, her soft smile is calming yet tinged with an air of sadness. |\n| 8 | Ithuriel | A scholarly Aasimar, his grey eyes hold an endless depth of knowledge. His book-laden attire complements his tranquil demeanor. |\n| 9 | METATRON | A stoic Aasimar with a strong aura, his silvered wings and dark eyes are an embodiment of solemn grace. |\n| 10 | Evangeline | A serene Aasimar with silver hair and gentle blue eyes. Her radiant wings spread wide, embodying peace and harmony. |\n| 11 | Nathanael | A wise Aasimar with a calm demeanor. His golden wings gently flutter, and his deep eyes seem to hold profound divine truths. |\n| 12 | Zerachiel | A solemn Aasimar with a commanding presence. His silvered wings and piercing gaze mirror his authoritative nature. |\n| 13 | Jophiel | A thoughtful Aasimar with an air of mystery. His massive wings and thoughtful expression reflect an aura of divine wisdom. |\n| 14 | Raphael | An Aasimar of gentle demeanour and soothing voice. His wings shed a warm light that brings comfort to those in his presence. |\n| 15 | Cassiel | A scholarly Aasimar, his eyes filled with an inquisitive spark. His golden wings flutter as he discovers overlooked divine truths. |\n| 16 | Haniel | A strong-willed Aasimar with sturdy wings and a disciplined manner. His serious expression portrays his dedication toward his divine duty. |\n| 17 | Michael |  A determined Aasimar with a stern demeanor. Her shimmering silver wings spread wide, reflecting her steadfast resolve. |\n| 18 | Azrael | An Aasimar whose eyes reflect deep sorrow. His limp wings echo the somber and serious nature of his divine calling. |\n| 19 | Samael | A fervent Aasimar with flame-colored hair and bright wings. His fervor and dedication illuminate his divine origins. |\n| 20 | Ariel | A charismatic Aasimar whose silver hair and wattage wings never cease to dazzle. Her poised demeanor appears very dedicated. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Gruug Beast-Bane | A stern Bugbear veteran with a brilliant mind for tactics and warfare. |\n| 2 | Zorrg the Ruthless | Known for his grim demeanor and unrelenting fierceness in battle. |\n| 3 | Varghast the Silent | Mysterious, with a quiet dread that seems to follow him. |\n| 4 | Farg Spider-Eater | Spotted with grizzly trophies from his arachnid prey. |\n| 5 | Yagg Throat-Ripper | Gruesomely detailed in his storytelling of past brawls.|\n| 6 | Sarug Bone-Crusher | An intimidating brute who boasts many victories. |\n| 7 | Hargrak the Dark | Primarily moves and hunts under shadow of night. |\n| 8 | Krootad Gloom-Caller | Known for his ominously foreboding war chants. |\n| 9 | Narzug One-Eye | Lost an eye in battle, but it only stoked his battle fervor. |\n| 10 | Gormog Skull-Splitter | Brutally efficient warrior, his weapon of choice is a shard-bone axe. |\n| 11 | Darg Blood-Painter | Decorates his armor with the blood of his vanquished enemies. |\n| 12 | Vugg the Mountain | Notable for his immense size and enduring strength. |\n| 13 | Brorg Iron-Hide | Known for his impenetrably tough hide, as enduring as iron. |\n| 14 | Grask the Devourer | Has a monstrous appetite, rumored to consume his defeated foes. |\n| 15 | Torg Steel-Fang | Craves the thrill of the hunt, his teeth replaced with steel points. |\n| 16 | Klorg Flesh-Raker | A fearsome Nightmare to all those who dare face him. |\n| 17 | Raggu Dead-Walker | Is cold and distant, known to consort with spirits of the dead. |\n| 18 | Bogg Dread-Marker | Marks his enemies with dread, his name spoken in hushed whispers. |\n| 19 | Gurn Torment-Giver | Strikes fear in the heart of his enemies by torturing his captives. |\n| 20 | Urg the Unyielding | An immovable force on the battlefield, outlasting all adversaries. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Erevan | A somber Changeling with silver eyes whose true form features sharp facial features and thin lips. As a rogue, he changes shape to gather information. |\n| 2 | Silaqui | An elusive Changeling sorcerer, her true form has amethyst eyes and wavy hair. She relies on her changeling abilities to deceive enemies. |\n| 3 | Fenris | A Changeling cleric with milky white eyes in their true form. Known for their somber personality, they takes on the guise of an old sage during journeys. |\n| 4 | Aelar | A reserved Changeling paladin with smooth skin and large green eyes in their true form, they use their shape-shifting abilities to scout enemy lines. |\n| 5 | Ilithra | A stern Changeling warlock, who prefers to remain in her true form displaying her silvery hair and pale yellow eyes. |\n| 6 | Daelis | A Changeling bard with silver-white eyes whose real form has uniquely pointed ears. He uses his shape-changing ability to charm and entertain. |\n| 7 | Eilin | She is a reserved Changeling druid. Her true form displays solid blue eyes. She uses her shifting abilities to blend into natural surroundings. |\n| 8 | Cailan | A stoic Changeling fighter with flat facial features and smooth skin in their true form adopts the forms of formidable warriors to battle foes. |\n| 9 | Idril | A daunting Changeling ranger with pure white hair and almond-shaped eyes in true form. She uses her transformative skills to track and hunt. |\n| 10 | Arannis | A formidable Changeling wizard, his true form has lavender eyes and thin lips. He manipulates his form for various magical research and incantations. |\n| 11 | Namirin | An austere Changeling monk, whose true form is bald with sea-green eyes. He utilizes his unique abilities for meditation and spiritual exploration. |\n| 12 | Onnim | A serious Changeling artificer, with opaque white eyes in their true form. They often take on the guise of skilled craftspeople to apply their trades. |\n| 13 | Quenell | A stern Changeling rogue. Her true form has short, fine hair with angular facial features. She utilizes her shifting abilities for espionage. |\n| 14 | Tholamin | This somber Changeling cleric rarely leaves their true form showing his colorless eyes and hair. They heal others under the guise of different races. |\n| 15 | Daemar | He is an introspective Changeling paladin with soft blue eyes in his true form. Adopts the forms of indomitable knights in his quest for justice. |\n| 16 | Miral | A stoic Changeling warrior, her true form features tall and lanky build with deep-set eyes. She changes form to adapt in warfare. |\n| 17 | Haliar | A stern, seasoned Changeling ranger. His true form displays pearl-white hair and eyes. He uses his shifting ability for ultimate survival. |\n| 18 | Veradin | A serious Changeling wizard with soft blue eyes in their true form. Frequently changes forms to tap into their magical prowess from different perspectives. |\n| 19 | Galadon | A Changeling sorcerer with solid silver eyes and smooth skin in their true form. He manipulates his form to execute mysterious arcane rituals. |\n| 20 | Luthra | She is a hardened Changeling rogue, whose true form features slender build and solid black eyes. Makes use of her abilities for stealthy operations. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Azygous the Stoic | A granite-scaled ancient dragon known for its stern demeanor and complete indifference. |\n| 2 | Inexorable Voracity | A massive terracotta dragon renowned for both its insatiable hunger and unyielding determination. |\n| 3 | Ghastspine | An eerie, skeletal dragon whose every motion jangles with the echo of countless tormented spirits. |\n| 4 | Blusterhold the Unyielding | Imposing dragon with scales like a mountain, stubborn to the point of recklessness. |\n| 5 | Obsidian Heart | Abyssal black dragon with a heart as cold and unyielding as the obsidian rock it is named for. |\n| 6 | Icefang the Merciless | A frost dragon known for its relentless and ruthless pursuit of prey. |\n| 7 | Gilded Ruin | Intricately adorned gold dragon, endlessly mournful of long lost civilizations. |\n| 8 | Cinderwing the Eradicator | Fire dragon with wings of constantly shifting ash, known for its policy of scorched earth. |\n| 9 | Ironclad Regret | Steel-scaled dragon brooding over past actions, its regret as impenetrable as the metal it embodies. |\n| 10 | Unheard Lament | Dragon of sapphire hue known for its melancholic aura and a mournful cry that echoes in the heart, but cannot be heard. |\n| 11 | Sandshroud the Immutable | Desert dragon known for its dry and calculating demeanor, unchanging as the dunes themselves. |\n| 12 | Umbral Echo | Abyssal dragon whose presence can only be noticed by the chilling void it leaves in its wake. |\n| 13 | Thundertide the Uncompromising | Storm dragon known for its unbending will, striking with the force of an unending tempest. |\n| 14 | Terragard the Stoic | Earth dragon whose rigid scales reflect its stern and unyielding personality. |\n| 15 | Bloodgale the Ruthless | Red dragon known for its savage attacks and complete lack of mercy. |\n| 16 | Gloomhaven | Twilight dragon enshrouded in a constant darkness, a living embodiment of despair. |\n| 17 | Silent Pyre | Fire dragon that burns without a sound, its silent inferno unnerving to all who behold it. |\n| 18 | Endure | A tortoise-shelled dragon as ancient as the mountains, unyielding to the sands of time. |\n| 19 | Diamond Sorrow | Crystal dragon radiating a chilling sadness, its sorrow as hard and unyielding as the diamond it embodies. |\n| 20 | Etherbound the Enduring | Astral dragon that drifts aimlessly through the cosmos, its timeless existence a testament to endurance. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Axandemar | A stern, disciplined Dragonborn Paladin of Gold ancestry. He has scales that sparkle like coins, and a battle-scarred halberd as his weapon. |\n| 2 | Bothagan | A librarian of Silver ancestry with a passion for collecting ancient texts. Beneath the calm exterior lies a fierce individual, unafraid to fight for his beliefs. |\n| 3 | Craggnorar | A sapphire-scaled Black Dragonborn, he remains a mystery to many. This stoic individual is a Rogue by trade and thrives in cunning and deceit. |\n| 4 | Dayzurin | An architect of Bronze ancestry with an unmatched eye for detail. His scales have a weathered look, demonstrating his hard work and endurance. |\n| 5 | Eragos | A serious-minded Dragonborn Warrior of Copper ancestry, Eragos has a lean yet strong body cased in shiny scales.|\n| 6 | Fargrinn | A shrewd and calculating trade merchant. Fargrinn, a Green Dragonborn, is known for his hard bargaining and relentless business strategies. |\n| 7 | Githoura | A healer of rare Blue Dragonborn lineage. Githoura is wise beyond her years, her calming presence provides comfort to the ailing and injured. |\n| 8 | Hezzek | A dedicated scholar with scales in the deepest shade of Red. Known for his vast knowledge and wisdom, Hezzek always seems to have an advice to share. |\n| 9 | Ithizir | A Dragonborn paladin of White lineage, known for her adherence to the principles of justice and righteousness. |\n| 10 | Jargrin | A quiet and unassuming Red Dragonborn, Jargrin works tirelessly as a smith, turning raw materials into creations of great value. |\n| 11 | Kaskus | A Brass Dragonborn with an incessant curiosity about the world. Kaskus makes his living as a seasoned explorer and cartographer of uncharted territories. |\n| 12 | Lzandar | A Gold Dragonborn nobility known for his honorable disposition. Lzandar is revered among peers for his indomitable spirit and commanding presence. |\n| 13 | Mordan | A stoic, silent White Dragonborn ranger with silver eyes that never miss a thing. His skills as a tracker and hunter are legendary in his village. |\n| 14 | Nazaak | A Blue Dragonborn cleric known for his solemn oaths. Nazaak is a beacon of hope and epitomizes the virtue of selfless service, tending to peoples need. |\n| 15 | Orzoth | A Bronze Dragonborn sailor known for his dominance over the waves. His stern eyes have an oceanic depth reflecting years on high seas. |\n| 16 | Panjis | A Silver Dragonborn who excels at crafting exquisite jewelry. Panjis's scales shimmer with a splendor rivaling that of her creations. |\n| 17 | Qildrak | A Dragonborn warrior of Black ancestry with a fearsome reputation. Qildrak's deeply tessellated scales stand as a testament to countless battles he has weathered. |\n| 18 | Ragnarr | A Copper Dragonborn known for his serious demeanor. Yet beneath this exterior, he is a highly regarded bard who can stir emotions with his deeply resonant tales. |\n| 19 | Shaydrin | A Green Dragonborn ranger known for his unerring vision. His quiet demeanor belies an unyielding determination to protect his woodland home. |\n| 20 | Thamaddir | An accomplished Bronze Dragonborn spellcaster. Thamaddir possesses a deep-rooted love for arcane knowledge and a dedication to unravel the magic's mysteries. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Ilmryn Xiloscient | A stoic Drow rogue, known for his silent footsteps and piercing crimson eyes. |\n| 2 | Vae'ryn Shattermoon | A grim Drow cleric, a fervent devotee of Lolth with a long, weaving spider tattoo covering his arms. |\n| 3 | Drizzt Cin'afay | A stoic Drow ranger, an outcast in his own society due to his disdain for their ruthless ways. |\n| 4 | Zebithra Rhuidhen | A cool-headed Drow warlock, her eyes glow an eerie purple when casting spells, perpetually bound by an otherworldly pact. |\n| 5 | Querchard Fiendline | A stern Drow fighter, clad in a polished obsidian plate, known for his swift and deadly swordplay. |\n| 6 | Shaddara Netherstar | A disciplined Drow monk, her fluid movements in combat are as hypnotic as they are deadly. |\n| 7 | Nunirol Stardust | A serious Drow wizard, his gaze is as deep and mysterious as the spells he so effortlessly casts. |\n| 8 | Caelkoth Shadowmantle | A guarded Drow druid, who finds solace in the carnivorous plants of the undergrowth. |\n| 9 | Rizzen Stonehunter | A hardened Drow barbarian, his silent fury is felt in the echoes of his thunderous strikes. |\n| 10 | Haelra Darkweaver | A meticulous Drow enchanter, she bends the will of others with an unnerving calm. |\n| 11 | Faeryl Thundermaul | A resolute Drow paladin, whose honorable intentions contrast with his intimidating demeanor. |\n| 12 | Jhaelra Silence | A reticent Drow thief, able to meld into shadows and whose presence is often noticed too late. |\n| 13 | Faen Vandree | An unyielding Drow knight, known for his impressive discipline and expert swordsmanship. |\n| 14 | Isolde Moonspear | A devoted Drow cleric of Eilistraee, soothing the pain of others while shunned by her own people. |\n| 15 | Bri'ar Icevein | A frosty Drow sorcerer, her chilling spells mirror the cold detachment with which she faces her foes. |\n| 16 | Ryltar Nightshadow | A brooding Drow necromancer, surrounded by the icy aura of death and decay. |\n| 17 | Solaufein Vrinn | A stolid Drow ranger, his hawk-eyed accuracy with the bow is feared by many. |\n| 18 | Darim Chillwind | A stern Drow bard, his melancholic melodies echo the lament of an isolated life. |\n| 19 | Iylara Veilwalker | A cold Drow mystic, who can peer into other realms and unravel the fabric of reality itself. |\n| 20 | Nyloth Duskryn | An imperious Drow noble, his every word laced with cold command, feared and respected in the cutthroat politics of Drow society. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Thorgar Steelshade | A gruff and serious duergar blacksmith who prides himself on the quality of his weapons and armor. |\n| 2 | Rurik Deepdelver | This stern duergar miner is known for his relentless digging in pursuit of rare gems and ores. |\n| 3 | Sharn Stoneshield | A seasoned warrior with countless skirmishes under her belt, she is now a military advisor for her clan. |\n| 4 | Kava Greyhand | A skilled engineer, she designs and crafts the sturdy stone structures of the duergar city. |\n| 5 | Durrak Ironbrow | Known for his unwavering dedication to his forges, this master weaponsmith is responsible for some of the finest weapons in the underdark. |\n| 6 | Gilk Battlehammer | A stoic commander with a strategic mind, he leads his soldiers with iron discipline. |\n| 7 | Oskar Mithrilbeard | An elder duergar with a wealth of lore and knowledge about the underdark, he advises the king on matters of tradition and law. |\n| 8 | Ysuran Quickshadow | An elusive spy and scout, his expertise helps protect his kin from surprise attacks. |\n| 9 | Vondal Rockgut | This stern brewmaster is known for his potent and uniquely flavored mushroom ales. |\n| 10 | Hulda Silvervein | A highly respected cleric, her spiritual guidance is sought by many in times of strife. |\n| 11 | Brogar Flameseeker | This stoic wizard delves into the mysteries of elemental magic, drawing his power from the earth and fire. |\n| 12 | Morgran Ironfist | A skilled master-at-arms who teaches the next generation of warriors the art of combat. |\n| 13 | Durin Goldtooth | A successful and shrewd merchant, he has amassed considerable wealth and influence through trade. |\n| 14 | Nissa Darkmind | A quiet and solemn enchanter, her magical protection wards keep the city safe. |\n| 15 | Sigrun Shardstone | A scholarly loremaster, she delves deep into ancient chronicles seeking wisdom of the past. |\n| 16 | Tordek Hammerfall | The moody and stern executioner, he ensures justice is dealt within the duergar society. |\n| 17 | Gurdis Coldflame | A dour and humorless shaman, she communes with spirits of the underdark. |\n| 18 | Zanros Nightscar | An imposing duergar, he works as the bodyguard for the city's most influential merchant. |\n| 19 | Eldeth Orevein | A veteran miner who has been through many cave-ins, she now oversees mining expeditions. |\n| 20 | Thrane Blightaxe | A ruthless duergar reaver, he leads raids against other underdark dwellers. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Balin Coppervein | An experienced dwarven blacksmith known for his durable, meticulously crafted tools and weapons. |\n| 2 | Thoren Graniteheart | A stern dwarven cleric devoted to Moradin, the Soul Forger. Primarily found in the local temple. |\n| 3 | Nori Ironhide | A veteran warrior and war strategist. He exhibits a gritty countenance, marked by numerous battle scars. |\n| 4 | Gimli Deeproot | A taciturn and gruff ranger with an intimate knowledge of the mountainous terrains. |\n| 5 | Bofur Flintfoot | An agile dwarf scout who has been traversing perilous lands for many years. |\n| 6 | Dwalin Hammerhand | A dwarven artisan known for his stone-carving skills and innovative architectural designs. |\n| 7 | Oin Rockshoulder | An elder statesman among dwarves, known for his wisdom and diplomatic acumen. |\n| 8 | Bombur Barrelbody | A jovial tavern owner whose establishment is renowned for its mulled wine and hearty feasts. |\n| 9 | Fili Goldenspear | A highly respected royal guard who has faithfully served the dwarven monarchy for decades. |\n| 10 | Kili Steelarm | A disciplined lieutenant of the dwarven army's frontline viaduct. Has impressive strength and endurance. |\n| 11 | Dori Gemseeker | A treasure hunter with an unmatched knack for locating precious gems and valuable metals. |\n| 12 | Dwalin Firebeard | Known for his bright red beard, Dwalin is a talented dwarven alchemist with a knack for creating powerful explosive concoctions. |\n| 13 | Gloin Silvertongue | An influential dwarven bard celebrated for his classic ballads about epic battles and heroic deeds. |\n| 14 | Bifur Frosthammer | A dwarven berserker feared for his chilling rage on the battlefield. His weapon of choice is an enormous warhammer. |\n| 15 | Nain Stoneshield | The respected captain of the royal guard, known for his steadfast loyalty and protective nature. |\n| 16 | Nori Steelbrow | A veteran dwarven warrior with an unflinching stare from below his heavily scarred browline. |\n| 17 | Fundin Ironhand | A dwarven historian with an encyclopedic knowledge about the long history of dwarven kin. |\n| 18 | Balin Windhelm | A seasoned dwarven sailor, known for navigating the toughest waters with his sturdy windship. |\n| 19 | Thrain Shadowfoot | A covert operative within the dwarven community, known for his stealth and unseen presence. |\n| 20 | Dain Ironfoot | The wise King under the Mountain, greatly admired for his leadership and bravery. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Thalion | A reserved elf, with long silver hair and piercing blue eyes. He is a skilled mage, respected for his wisdom and magical prowess. |\n| 2 | Aerandir | A stern and serious elf, with a scar over one eye, proof of his experience as a ranger in the elven forest. |\n| 3 | Galadriel | An elf with an unwavering air of grace and dignity. She strikes a majestic image with her golden hair and calmly authoritative demeanour. |\n| 4 | Elrohir | A warrior elf, carrying the weight of too many battles. He is finely attuned to the martial arts of the elves and his determination is a source of inspiration for many. |\n| 5 | Orophin | A quiet, scholarly elf. His grey eyes display a world filled with knowledge and understanding that can only come through centuries of study. |\n| 6 | Lúthien | A beautiful elf maiden, known for both her kindness and her talent with the harp. She seems to exude tranquility and strength simultaneously. |\n| 7 | Erestor | A stern, almost unapproachable elf. His wisdom and insight are respected, though his intense eyes can be intimidating. |\n| 8 | Elladan | A rugged elf with marks of wilderness and combat. He is a legendary tracker and survivalist in the elven forest. |\n| 9 | Celeborn | An older and very respected elf. He is a careful and thoughtful leader who doesn't speak often, but when he does, his words are very wise. |\n| 10 | Glorfindel | A charismatic elf with a warm, vibrant energy. He's an exceptional warrior, with a reputation that extends even beyond the elven kingdom. |\n| 11 | Nerdanel | A gentle and kind-hearted elf. Her comforting presence and ability to heal both physical and emotional wounds make her a cherished figure in the elven community. |\n| 12 | Caranthir | An aloof and somewhat mysterious elf. His vast knowledge and natural affinity for magical arts has led to a respect that borders on caution from others. |\n| 13 | Arwen | An elf of a noble lineage, known for her profound wisdom and inherited power. Her presence commands respect and reverence. |\n| 14 | Haldir | A dedicated elf guard who has defended the elven lands for centuries. His stern gaze and strong arms show the result of his tireless effort. |\n| 15 | Beleg | A respected elf archer, known for his sharp aim and keen eyes. His silent but sturdy demeanor makes him a reliable presence in the battlefield. |\n| 16 | Curufin | A black-haired elf with a stern face, but soft spoken. His unmatched skill in weapon smithing has given him a unique position among the elves. |\n| 17 | Fingon | A charismatic elf whose courage and spirit in battle rallies those around him. He leads with conviction and inspires courage in others. |\n| 18 | Legolas | A legendary elf ranger much admired for his navigational skills and archery prowess. His green eyes seem to reflect the spirit of the forest. |\n| 19 | Thranduil | A noble elf with a dominant and royal aura. His silver hair and timeless grace mark him as someone of high-ranking stature in the elven society. |\n| 20 | Gil-galad | An elf king of renown. His abilities and wise leadership have ensured peace and prosperity in the lands he rules. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Prax | An Earth Genasi, Prax has a chiseled physique and stone-like skin texture. His eyes resemble shining coal. |\n| 2 | Hydriana | Hydriana, a Water Genasi, has flowing hair that resembles a stream and skin as blue as the ocean. Her eyes twinkle like sapphires.|\n|3 | Taisila | Taisila, an Air Genasi, has hair and clothes that flutter even when there is no wind. Her eyes are bright, like the morning sky. |\n| 4 | Ignis | Ignis, a Fire Genasi, has brilliant red hair that flickers like flames. His bronze skin glistens as if always caught in sunset light. |\n| 5 | Durendal | An Earth Genasi merchant, Durendal's limbs are as solid as clay. His deep-set eyes mirror the unyielding nature of bedrock. |\n| 6 | Maelis | Maelis, a Water Genasi sailor, has a form which ebbs and flows with the rhythm of the tides. Her eyes glow with the coolness of a pact still pond. |\n| 7 | Zephra | An Air Genasi bard, Zephra moves with the grace of a breeze. Her eyes convey a tempest of creativity in their vibrant blue hue. |\n| 8 | Pyrrhos | A Fire Genasi blacksmith, Pyrrhos has a robust physique, with skin that crackles subtly like a live ember. |\n| 9 | Thalkor | Thalkor, an Earth Genasi miner, has sturdy limbs and a back hardened by years working the mines. His eyes are the gray of pewter, laced with veins of silver. |\n| 10 | Nixi | A Water Genasi healer, Nixi's movements have the rhythm of a calming wave. Her gaze is merciful, the color of turquoise. |\n| 11 | Galea | Galea, an Air Genasi archer, moves with the subtle shifts of the wind. Her eyes have the piercing sharpness of a hawk. |\n| 12 | Ferva | Ferva, a Fire Genasi sorcerer, has a sharp tongue that matches the spark of his fiery orange eyes. |\n| 13 | Krum | An Earth Genasi soldier, Krum’s stern posture mirrors the unwavering nature of the mountain terrain. His gaze is as unforgiving as granite. |\n| 14 | Ondine | Ondine, a Water Genasi ambassador, commands respect with the serenity of a deep lake reflected in her eyes. |\n| 15 | Sirocco | An Air Genasi thief, Sirocco has an elusive quality, blending into crowds as seamlessly as a gust of wind. His gaze is sharp, like a slicing gale. |\n| 16 | Incendia | Incendia, a Fire Genasi cleric, possesses a passion that burns bright in her warm amber eyes. |\n| 17 | Petra | Petra, an Earth Genasi scholar, has a solidity about her that is comforting. Her eyes, gray as slate, hold a steady, intelligent gaze. |\n| 18 | Marilla | Marilla, a Water Genasi chef, has a soothing presence, just as a clear spring. Her sapphire eyes are alight with brilliant culinary ideas. |\n| 19 | Boreas | An Air Genasi wizard, Boreas moves with an air of unpredictability. His stormy eyes hold an arsenal of arcane secrets. |\n| 20 | Caldera | Caldera, a Fire Genasi warrior, has a fearsome aura akin to a volcano on the brink of eruption. Her molten eyes speak volumes of her tenacity. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Belgrettle | A venerable gnome with wispy white hair and sharp features. Known for his precise clockwork inventions. |\n| 2 | Ferrindale | A serious-faced gnome alchemist, dressed in heavy robes, always lost in thought. |\n| 3 | Guthwol | This gnome blacksmith is muscular, burly and has a grim facial expression. |\n| 4 | Miriath | A gnome cartographer with a meticulously maintained map collection. Always looking for new places to chart. |\n| 5 | Nezzor | This gnome scholar wears glasses perched on the end of his nose and carries an ancient tome wherever he goes. |\n| 6 | Orvanna | An elderly gnomish lady, who runs the local apothecary with a stern hand and keen eye. |\n| 7 | Pelnore | A bald gnome with a long white beard, toying with various ring puzzles. Known as the locksmith of the town. |\n| 8 | Rindelle | This gnome is an austere cleric with a stern sense of duty and dedicated to her divine studies. |\n| 9 | Sallit | A reserved and quiet gnome librarian who values quietness and order above all else. |\n| 10 | Tindomerel | A gnome ranger, always stoic, leads her companions through the wilderness with unerring accuracy. |\n| 11 | Uliria | An exacting gnome jeweler, known for the precision and care she puts into every piece. |\n| 12 | Vindle | This gnome professor of archaeology has a keen eye for detail and an impressive knowledge of ancient history. |\n| 13 | Wezzleghob | A stern gnome judge, expert in the law and unyielding in his decisions. |\n| 14 | Xzerda | A quiet gnome herbalist, she provides her customers with meticulously prepared remedies. |\n| 15 | Yxiy | This gnome seamstress is known for her exquisite tailoring skills, paying attention to even the smallest detail. |\n| 16 | Zefron | An ill-tempered gnome tinkerer, skilled at fixing almost any mechanical device. He rarely smiles. |\n| 17 | Attor | Gnome spice merchant, always seen tasting and inspecting his spices, ensuring they are of the finest quality. |\n| 18 | Dikto | This gnome, though small in stature, runs the town's postal services with an iron fist. |\n| 19 | Hypperwick | A gnome bard, he maintains a perfect poker face, making it hard for others to guess his true feelings. |\n| 20 | Pradbag | This gnome shipwright, always serious, can discern a ship’s weakness with a single glance. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name          | Description                                                  |\n|------------|---------------|-------------------------------------------------------------|\n| 1          | Grit          | A savvy goblin commander with a scarred face.                     |\n| 2          | Snarl         | A hunched-over goblin alchemist carrying a pouch of herbs.          |\n| 3          | Tusk          | A burly goblin warrior with boar-like tusks.                      |\n| 4          | Wart          | A goblin minion with bulbous features, often succumbs to panic.     |\n| 5          | Chalk         | A goblin spy, known for leaving white markings with crushed chalk. |\n| 6          | Shriek        | A goblin sentry known to have a piercing shriek.                   |\n| 7          | Flash         | A goblin fire mage with a penchant for setting traps.              |\n| 8          | Shred         | An eerily quiet goblin assassin wielding sharp daggers.            |\n| 9          | Kreeper       | A goblin scout, notorious for moving undetected in the shadows.    |\n| 10         | Bolt          | Skilled goblin archer who never seems to miss his mark.            |\n| 11         | Wrench        | A robust goblin engineer with a unique knack for machinery.        |\n| 12         | Fang          | Fierce goblin berserker known for his jagged, sharp teeth.         |\n| 13         | Mink          | A cunning goblin thief with a quick hand and quicker feet.         |\n| 14         | Squint        | A watchful goblin guard with a glassy-eyed stare.                  |\n| 15         | Creak         | A goblin elder known for his ancient, cracking bones.              |\n| 16         | Pike          | A stoic goblin soldier always seen wielding his namesake weapon.   |\n| 17         | Scorch        | A goblin sorcerer known to have a cruel, burning magic.            |\n| 18         | Scuffle       | A rowdy goblin brawler who loves to start fights.                  |\n| 19         | Squire        | A goblin runt, often overlooked and underestimated.                |\n| 20         | Kingpin       | The goblin chieftain, feared and respected by all in the tribe.     |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n| Dice Value | Name         | Description                                                                                         |\n|------------|--------------|-----------------------------------------------------------------------------------------------------|\n| 1          | Kavaki       | A no-nonsense, weathered Goliath hunter, known for his tracking skills and survival expertise.          |\n| 2          | Vaunea       | A solemn, stone-faced Goliath stonecarver. She speaks little and lets her work do the talking.        |\n| 3          | Thotham      | An imposing, steadfast Goliath watchman. His presence alone is enough to deter potential troublemakers. |\n| 4          | Loagog       | A gruff Goliath that takes care of the tribe's goats. Respected for his determination and resilience.    |\n| 5          | Gae-Al       | This elder Goliath is known for his wisdom and sound judgement. He mediates disputes within the tribe.    |\n| 6          | Ilikas       | A distant but respected Goliath guide who knows the mountain paths like the back of his hand.           |\n| 7          | Aukan        | A Goliath blacksmith. His steady hand and stoic demeanor are evident in the weapons he crafts.        |\n| 8          | Gautha       | A Goliath healer who quietly tends to the injured and ill. She carries the weight of her duty without complaint. |\n| 9          | Eglath       | He's a Goliath sentinel standing rigidly at the tribe's perimeter, an unmovable force in the face of danger.  |\n| 10         | Donaar       | A serious and disciplined Goliath warrior. His battle scars tell tales of countless skirmishes.           |\n| 11         | Muathi       | A reserved Goliath stone shaper, intensely focused on her work, barely acknowledging those around her.     |\n| 12         | Thalai       | An experienced Goliath scout. Distant and austere, she excels in her duty to find game and spot threats. |\n| 13         | Kahrash      | A Goliath warden, he spends his days in quiet observation of their territory, brooking no intrusion.            |\n| 14         | Velog        | This Goliath fisherman's stoic exterior hides a wealth of knowledge of the rivers and lakes.            |\n| 15         | Paavu        | A Goliath elder, deeply respected for her sagacity. She speaks rarely, but when she does, the tribe listens. |\n| 16         | Thothak      | He's Chief Thothak, a Goliath leader who carries his responsibility with solemn determination and grit.       |\n| 17         | Gaebolg      | An elderly Goliath storyteller. His grave demeanor does little to diminish the captivating tales he shares. |\n| 18         | Kuori        | A young, serious-minded Goliath shaman in training. She has great respect for the spirits and her duties.  |\n| 19         | Ogolai       | A harsh Goliath drillmaster responsible for training the tribe's warband. He tolerates no weakness.         |\n| 20         | Iyag         | A pragmatic, hardworking Goliath artisan skilled in bone and hide crafting, his work is reliable and durable. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name            | Description                                                                                                 |\n|------------|-----------------|-------------------------------------------------------------------------------------------------------------|\n| 1          | Eolanar Sylvar  | A solemn half-elf druid who serves as a guardian of an ancient forest.                                      |\n| 2          | Sorandil Faein  | A serious and silent ranger, respected by his community for his tracking skills.                            |\n| 3          | Eala Brightmoon | A competent blacksmith, after her human mother, while also mastering the elven magic from her father.       | \n| 4          | Tholamin Wavestrider | A sea-loving rogue half-elf with very few personal ties. Prefers the solitude of the open sea.           |\n| 5          | Veladorn Greycastle | A retired military officer, uses his strategic skills to serve as a town councilor.                      |\n| 6          | Daelis Songsteel | A master swordsman, known for his harmonious fighting style that gives an appearance of a dance.              |\n| 7          | Lareth Longshadow | A tight-lipped wizard with an inclination towards shadow magic.                                              |\n| 8          | Yevelda Clearwater | A friendly cleric who often aids the town's hearty fisherfolk and sea traders.                           |\n| 9          | Naris Wildfriend | A ranger with extraordinary mastery over the wilderness. Has remarkable rapport with animals.                |\n| 10         | Yaris Greenwhisper | A druid deeply concerned about the encroachment of civilization into his sacred groves.                  |\n| 11         | Loraena Cloudwatcher | An artist and poet. Creates masterpieces inspired by her elven heritage and human creativity.          |\n| 12         | Faerin Shadowsong | A bard with a hypnotic voice that can soothe the fiercest beasts or incite a riot.                            |\n| 13         | Soril Faebar | A librarian with an extensive knowledge of elven lore and ancient history.                                      |\n| 14         | Naeris Tirolar | An alchemist seeking to bridge the gap between elven natural magic and human scientific discovery.            |\n| 15         | Quinrel Windwhisper | A scout for his community, known for his stealth and agility.                                             |\n| 16         | Pelnae Featherstep | A rogue known for her nimble fingers and quick wit. Often works as a freelancer.                          |\n| 17         | Erevan Moonshadow | A scholar and magic practitioner. Seeks to uncover and maintain ancient arcane secrets.                      |\n| 18         | Theris Starglow | A reputed healer who has saved countless lives through her combination of magic and medicinal knowledge.      |\n| 19         | Laucian Webstrider | A solitary ranger known for his unmatched skill in navigating through dangerous terrains.                  |\n| 20         | Selanae Silverfrond | A skilled artisan who crafts exquisite jewelry imbued with elven magic.                                  |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| Dice Value | Name        | Description                                                                        |\n|------------|-------------|------------------------------------------------------------------------------------|\n| 1          | Karg        | A stoic, silent half-orc with a scar running down his face indicating old battles. |\n| 2          | Gorga       | She's a steadfast and disciplined half-orc warrior, bearing the scars of war.      |\n| 3          | Thrum       | An observant half-orc with keen eyes and a strategic mind, known in local taverns. |\n| 4          | Bramak      | A skulking and sullen half-orc, always found in the corner of darkened inns.       |\n| 5          | Grisha      | A complex, thoughtful half-orc with the manners of a noble and the strength of an ox.|\n| 6          | Zoga        | Patient and reserved half-orc, recognized for his articulate speech.               |\n| 7          | Urak        | A disciplined half-orc, bearing marked armor and a well-kept blade.                |\n| 8          | Yagra       | A serious half-orc, always alert for any sign of threat to her clan.              |\n| 9          | Thog        | A deeply religious half-orc who serves his deity with fervor.                     |\n| 10         | Narv        | A steady and stern half-orc, whose mind is as sharp as his blade.                 |\n| 11         | Ilga        | A solemn half-orc, who commands respect with her measured words.                  |\n| 12         | Brunkf      | A wary half-orc with an unreadable gaze, always seen with a book.                 |\n| 13         | Thash       | This half-orc has a steely calmness in his demeanor and relentless endurance.     |\n| 14         | Krol        | A dedicated half-orc who shows honor in all situations, respected in his clan.    |\n| 15         | Volga       | A precise and calculating half-orc, always sizeing up opponents.                  |\n| 16         | Drak        | A stoic and disciplined half-orc respected for his leadership skills.             |\n| 17         | Blurga      | She is a wise advisor, her counsel valued by many despite her stern demeanor.     |\n| 18         | Korsk       | Half-orc guildmaster known for his meticulous detail and strict conduct.          |\n| 19         | Rargh       | A deft hunter, his focus never faltering, always returning with a full catch.     |\n| 20         | Vronk       | A formidable half-orc, balancing his intimidating presence with sharp intellect.  |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Thain Underbough | A serious-looking halfling, with sharp eyes and a disapproving frown. A veteran fighter who is known for his strict discipline. |\n| 2 | Ponto Greenhill | A mysterious halfling druid. He is typically silent and brooding, focused on the balance of nature and the world around him. |\n| 3 | Marroc Goodbarrel | A no-nonsense halfling rogue. He is very professional and efficient, always getting the job done without unnecessary risks. |\n| 4 | Eglantine Brushgather | A serious-minded halfling cleric. She views healing as a solemn duty and takes her role within the community very seriously. |\n| 5 | Doderic Brandybuck | A reputable halfling merchant. He is known for his stern bargaining skills and low tolerance for trickery. |\n| 6 | Rosamunda Tealeaf | An elderly, sagacious halfling wizard. She is quite strict in her teachings, always pushing her students to delve deeply into magic's intricacies. |\n| 7 | Fosco Took | A halfling sheriff known for his glaring seriousness. He is unwavering in his commitment to uphold the law and keep the peace. |\n| 8 | Tansy Burrow | A halfling herbalist with a grave demeanor. She prepares her concoctions with utmost precision and seriousness. |\n| 9 | Berilac Whitfoot | A rigorous halfling scholar. His stern eyes have spent countless hours pouring over ancient texts in his study. |\n| 10 | Prisca Baggins | A resolute halfling ranger, always serious about the task at hand and dedicated to protecting the borders of her homeland. |\n| 11 | Moro Bracegirdle | A staunch halfling bard. His ballads are serious accounts of halfling history, meant to educate rather than entertain. |\n| 12 | Hilda Grubb | A stern halfling matriarch, managing her large family with stringent rules and high expectations. |\n| 13 | Drogo Hornblower | A halfling ship captain, known for his stern command and zeal for meticulous navigation. |\n| 14 | Esmeralda Bolger | A halfling blacksmith, committed to producing the finest work with a quiet, stern concentration. |\n| 15 | Galadriel Proudfoot | A halfling animal trainer, strict but fair with her animals, ensuring they are well trained and disciplined. |\n| 16 | Lotho Sackville-Baggins | A draconian halfling mayor who insists on proper protocol and runs the halfling town with a tight, organized grip. |\n| 17 | Fastred Fairbairn | A halfling scholar specializing in archaeology. Known for his thoroughness and rigorous attention to detail. |\n| 18 | Primrose Twofoot | A halfling chef who takes her cuisine very seriously. She runs her kitchen with stern, disciplined orderliness. |\n| 19 | Hamfast Gamgee | A halfling farmer bent on following the traditional ways of farming. He is solemn and works with a meticulous hand. |\n| 20 | Lobelia Boffin | An aloof halfling wine merchant, very precise and serious in her deals. She will accept only the best quality wines. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Uroth | A tall, muscular hobgoblin with darkened red skin. He is efficiently cruel and is the leader of a local warband. |\n| 2 | Varguk Bloodfist | A brutal hobgoblin warrior with a large, bloodstained fist which he uses to crush his enemies. |\n| 3 | Tharak the Stern | An experienced tactician with a tendency to plan for every possible scenario. His face is always serious and his demeanour is no-nonsense. |\n| 4 | Nargul the Ardent | A fervent hobgoblin cleric who has consecrated himself to the service of a war god. He wears worn-out, but meticulously clean ritualistic armor. |\n| 5 | Darz the Silent | A hobgoblin rogue who is a master of stealth and shadows. He speaks very rarely but is always direct and to the point when he does. |\n| 6 | Garzuk Heartrender | A fearsome hobgoblin warlord known for his ruthless tactics and completely lack of mercy on the battlefield. |\n| 7 | Hargul Swiftblade | A nimble hobgoblin scout with uncanny agility and speed. He has a serious demeanor and is always alert. |\n| 8 | Tharag Ironfoot | A disciplined hobgoblin soldier known for his heavy footfalls and his relentless pursuit of enemy forces. |\n| 9 | Ragnak the Unflinching | A fearless hobgoblin leader who never wavers in front of his enemies, regardless of the odds. |\n| 10 | Varguk Darkshield | A stoic hobgoblin warrior equipped with a blackened shield that he uses to protect his allies. |\n| 11 | Zorgak the Broken | A battle-scarred hobgoblin veteran whose physical and emotional wounds have never fully healed. He remains a determined fighter despite his injuries. |\n| 12 | Nargak Blooddancer | A cruel and efficient hobgoblin assassin known for his swift and deadly attacks. |\n| 13 | Darag Redeye | A savage hobgoblin berserker with a bloodshot eye from numerous battles. He rarely smiles but his bloodlust is evident in combat.| \n| 14 | Grafuk Bladescar | A seasoned hobgoblin soldier with countless scars adorning his body, each representing a battle he survived. |\n| 15 | Krazak Ironhelm | A sturdy hobgoblin warrior with a metallic, well-worn helmet. He's known for his stoic nature and unyielding resilience. |\n| 16 | Tarzak the Relentless | A disciplined hobgoblin commander who never allows his troops to show any signs of weakness. |\n| 17 | Zargak Stonefist | A rugged hobgoblin known for his solid, unyielding punches. His demeanor is as hard and unyielding as the stones he's named after. |\n| 18 | Borgak the Unseen | An elusive hobgoblin rogue who thrives in the shadows. His presence is often only noticed after he has already vanished. |\n| 19 | Frarg the Pathfinder | A resourceful hobgoblin ranger who has an uncanny ability to find the safest paths through the deadliest terrains. |\n| 20 | Worgak the Ravenous | A fearsome hobgoblin berserker known to devour his enemies in the heat of battle. His stern demeanor is often broken by bouts of vicious bloodlust during combat. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Elgar Reed | A stern-faced blacksmith known for his unmatched skill in crafting weapons of war. |\n| 2 | Greta Hearth | A poised and strict matron who governs the local orphanage with a firm but loving hand. |\n| 3 | Jareth Hollows | A stoic wizard who resides in the town library, devoting his life to the arcane. |\n| 4 | Lady Aveline Fairfax | The well-respected, austere noblewoman ruling over the town; known for her sharp wit. |\n| 5 | Brother Edmund | A quiet cleric who offers services at the local shrine, famous for his healing touch. |\n| 6 | Mistress Raelene | An enigmatic fortune teller whose cryptic and precise predictions hold the town in thrall. |\n| 7 | Captain Rollo | A serious and capable captain of the guards who protects the town from external threats. |\n| 8 | Eamon the Grey | A reclusive and precise hermit, rumored to harbor vast knowledge on beasts and monsters. |\n| 9 | Sara Tillinghart | A diligent farmer, known for her high-quality produce and unfailing work ethic. |\n| 10 | Regis Stonebeard | A grumpy and meticulous mason who shaped most of the town's stone structures. |\n| 11 | Harper Quickfoot | The town's well-regarded cobbler; his lack of joviality is perfectly balanced with his skilled craftsmanship. |\n| 12 | Amara Nightingale | A serious bard known for her beautifully mournful melodies and haunting whispers of lore. |\n| 13 | Ser Baldrick | A disciplined knight, his sure and uncompromising nature make him both revered and feared. |\n| 14 | Ingrid Coldwater | The town's stern fisherwoman, her prowess at sea only matched by her icy demeanor. |\n| 15 | Thane Ironfist | A smithy, known for his unwavering severity in matters of money and metallurgy. |\n| 16 | Verity Pigeonpost | The town's austere postmistress, taking every message's delivery with grave seriousness. |\n| 17 | Owen Trueflight | A stoic yet skilled fletcher whose arrows never miss their mark. |\n| 18 | Mirabelle Ivywood | A botanical alchemist who runs a tight and organized apothecary. |\n| 19 | Trysten Vell | The town's quiet and stern librarian with an encyclopedic knowledge of history. |\n| 20 | Dame Ceridwen | A dour knight respected for her precise strategic skill in keeping the town's threatening beasts at bay. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| Dice Value | Name          | Description                                                                         |\n|------------|---------------|-------------------------------------------------------------------------------------|\n| 1          | Sizzix        | A small green kobold. Warrior, strong and serious, with a chipped tooth.            |\n| 2          | Mizznag       | A hunched over, blue kobold. A crafty thief noted for his quick fingers.            |\n| 3          | Skraek        | A resilient and large red kobold fighter with an imposing presence.                 |\n| 4          | Zlick         | A knowledgeable yellow kobold, wise elder shaman of the tribe.                      |\n| 5          | Grax          | Daring purple kobold ranger, swift and silent, an expert at tracking.               |\n| 6          | Nartix        | Wiry and cunning. A kobold trap-master with a preference for poison darts.          |\n| 7          | Frik          | The brown kobold tribe leader. Vicious and ambitious, respected by his kin.         |\n| 8          | Pikk          | The runt of the litter, underestimated grey kobold with a heart for adventure.      |\n| 9          | Slig          | Quiet orange kobold. A shy but powerful sorcerer with a natural ability for magic.   |\n| 10         | Snek          | Unusually tall red-scaled kobold. An exceptional spearsman with a warrior's spirit. |\n| 11         | Nill          | A timid blue kobold sage with a deep understanding of the arcane.                   |\n| 12         | Rixt          | Crafty black kobold rogue, known for his ability to slither into tight spaces.       |\n| 13         | Krig          | Grey kobold, formidable warrior well-versed in the art of swordplay.                |\n| 14         | Grix          | White-scaled kobold. A disciplined monk and spiritual leader of the community.      |\n| 15         | Lenk          | Yellow kobold, the tribe's historian, known for its knowledge in ancient languages. |\n| 16         | Znik          | A surprisingly kind-hearted purple kobold, skilled healer of his tribe.              |\n| 17         | Snaggletooth  | A large, rugged green kobold, renowned blacksmith with a knack for weaponry.        |\n| 18         | Tikk          | A red-scaled kobold with a serious demeanor. Adept at illusionist magic.             |\n| 19         | Zakk          | Blue kobold, stoic and stone-faced. The tribe's best lookout.                       |\n| 20         | Krang         | A weathered, disciplined elder. Commanding white kobold chieftain.                  |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Saarn | A tall, muscular lizardfolk with emerald-green scales. He carries a spear and wears metal armor adorned with bones. |\n| 2 | Vask | A grizzled lizardfolk warrior with a missing tail and bearing old battle scars. His scales are faded and dulled. |\n| 3 | Yssriss | A female lizardfolk, unusually slender with jet-black scales and sharp features. She's a skilled healer among her tribe. |\n| 4 | Kraz | A bulky, indomitable lizardfolk with scales like polished bronze. His eyes gleam with a cruel intelligence. |\n| 5 | Sstha | A soft-spoken, contemplative lizardfolk who is an adept in archaic lore and ancient languages. His scales resemble old parchment. |\n| 6 | Eresk | A fast-talking lizardfolk merchant whose scales glint gold in the sun. There's a sparkle in his eye that hints at cunning and sharp intellect. |\n| 7 | Grysth | A seasoned lizardfolk ranger with an intimate knowledge of the swamp lands. His green and brown scales blend perfectly with the wilderness. |\n| 8 | Nisk | A young, spirited lizardfolk warrior eager to prove her value in battle. Her scales are vibrant and seem to reflect her fiery spirit. |\n| 9 | Othokent | A respected leader among his tribe, Othokent is a lizardfolk of wisdom and insight. His scales glimmer with an age-old hue. |\n| 10 | Xath | A cunning and crafty lizardfolk rogue, Xath's scales are a patchwork of various shades, allowing him to blend into shadows. |\n| 11 | Ssathra | An upcoming priestess in the tribe, Ssathra is wise beyond her years. Her light blue scales reflect her spiritual aura. |\n| 12 | Ilssn | Ilssn is a seasoned blacksmith among the lizardfolk. He is massive and covered in steel colored scales. |\n| 13 | Ressk | A stoic and quiet lizardfolk with scales like dark emeralds. He is a solitary hunter who prefers the company of marshland creatures to others. |\n| 14 | Thokka | Thokka is an elderly lizardfolk seer with scales that have faded to grey with time. Despite his age, he holds great influence within his tribe. |\n| 15 | Vranssisk | A skilled lizardfolk shaman with sun-yellow scales, Vranssisk is an incredible spiritual and mystical guide for his tribe. |\n| 16 | Lixa | A female lizardfolk with scales like fresh sprouts. She is a gifted potter, her hands shape clay as easily as water shapes riverbeds. |\n| 17 | Qaar | A green-scaled lizardfolk, Qaar has spent much of his life exploring the aquatic depths and is the tribe's prime fisherman. |\n| 18 | Yrrissk | He is a lizardfolk bard, bright red in color. His rhythms are as enchanting as they are rhythmic and his tales as thrilling as they are exciting. |\n| 19 | Bxaan | A lizardfolk with midnight-blue scales and a tranquil demeanor. Skilled in magic, he works as a protector and guide for his tribe. |\n| 20 | Zyrth | An ambitious young lizardfolk with crimson scales. Zyrth wishes to become a great leader within his tribe, studying under Othokent. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Garug Bonebreaker | This hulking orc warrior stands over 6 feet tall, with dull green skin covered in tribal tattoos and scars. He carries a massive warhammer etched with orcish runes. |\n| 2 | Kharz Grimtooth | Dressed in gnarled, spiked armor, Kharz carries twin battle axes on his belt. His tusks are dyed a menacing black, matching the unkind glint in his yellow eyes. |\n| 3 | Gruumsh the Eyeless | The half-blind chieftain of a powerful orc tribe, this ageing orc's remaining eye glows with untamed wild magic. He wields a staff of gnarled ebony wood. |\n| 4 | Uglak the Blooddrinker | The notorious orc shaman, Uglak has been marked with blood-red warpaint. He wields a ceremonial dagger and is known to practice blood magic. |\n| 5 | Murgol the Skullcrusher | Tall, brooding and relentless in battle, Murgol is feared for his great strength and his grim, war-scarred face lends an aura of intimidation. He carries a deadly mace adorned with enemy skulls. |\n| 6 | Zogar the Iron Fist | Covered head to toe in battle-hardened plate armour, Zogar is nearly impenetrable. He commands respect, using his iron fist both metaphorically and quite literally. |\n| 7 | Borug the Beastmaster | This orc ranger is always flanked by his savage wolf companions. Gruff and anti-social, Borug finds more kinship in beasts than his own kind. |\n| 8 | Sharg the Dead-Eye | Known for his uncanny accuracy as a marksman, Sharg wields a longbow carved from the bone of a giant. He cloaks himself in furs and hides to blend into the wilderness. |\n| 9 | Rognak the Fire-Eater | This orc's scorched face and singed beard are clear evidence of his affinity for fire magic. He carries a charred staff and smells perpetually of smoke. |\n| 10 | Vorgak the Silent | A muted orc rogue, Vorgak's silence is more terrifying than any battle roar. Quick and deadly, he's the tribe's preferred scout and assassin. |\n| 11 | Gorg the Mindripper | Regarded with fear and suspicion, Gorg is a master of psychological warfare. His piercing gaze is said to be able to shatter the bravest warrior's resolve. |\n| 12 | Throgar the Ironskin | Throgar's skin has been hardened with layers of rock dust and animal fat, making him seem more stone than flesh. His batters enemies with his stone-ridden knuckles. |\n| 13 | Zargoth the Spirit-Walker | Covered in ethereal blue tribal tattoos, Zargoth is the tribe's only known spiritual conduit. His eyes have been glazed over with a spectral white hue. |\n| 14 | Skorg the Mangler | The gnarled scars and deep claw marks that scar Skorg's body are testament to his savagery in battle. He fights fiercely with a pair of jagged bone knives. |\n| 15 | Brugoth the Scale-Tamer | Brugoth, the only one of his kind to tame a wyvern, stands tall with his scaled beast. Armour made from wyvern hide makes him a formidable foe. |\n| 16 | Uzgob the Cave-Dweller | Living in solitude, Uzgob's eyes have adapted to near total darkness in the deep caves. His hulking form is covered with glowing fungi and mushrooms. |\n| 17 | Maknok the Vile | The orc tribe's ruthless merchant, Maknok deals in poisons and illicit goods. His reptilian smirk hides a poisonous tongue and dangerous intent. |\n| 18 | Brogz the Sea-Breather | Born with the ability to breathe underwater, Brogz is the tribe's revered seer. His skin carries a peculiar bluish hue, akin to the sea he wades through. |\n| 19 | Grald the Frostborn | Grald's skin bears an icy complexion, a tribute to his birth in the heart of a winter storm. He easily manipulates ice and frost to his bidding. |\n| 20 | Krod the Berserker | The volcanic temperament of this orc matches his raw strength. Krod's berserker rage is a terrifying sight, a manifestation of brute force and pure fury. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Egenix Veilshade | Egenix is a stern, lean Tiefling with deep-set obsidian eyes. His tail twitches incessantly, and his purple skin is covered in tattoos of ancient, arcane symbols. |\n| 2 | Thathra Fiendline | Tall and skeletal, Thathra has dim, amber eyes that glow faintly in the dark. She possesses a multitude of scars, telling tales of numerous battles fought. |\n| 3 | Darastrix Nightbrand | A Tiefling bearing a reptilian tail, hair resembling red flames, and emerald eyes. Darastrix is a calculating strategist known for his frigid demeanor. |\n| 4 | Diabhal Hellgrin | Diabhal's jet black eyes and tattoo-marred skin hide a gift for manipulation. He has an unassuming appearance, save for his unusually wide, devilish grin. |\n| 5 | Vauspex Gloomshadow | Vauspex's chilling silver eyes and long, serpent-like tail create an imposing presence. She is a brooding, silent individual carrying a massive, rune-etched halberd. |\n| 6 | Baatezu Darkthrone | Wiry and quick, Baatezu's maroon skin greets strangers with a grave, unsettling presence. His charcoal eyes bear a seemingly unfathomable depth. |\n| 7 | Naeme Whispergloom | With ashen skin, dark eyes, and a hypnotic voice, Naeme is a singer of sorrowful dirges. Her mournful demeanor masks a cunning and sharp intellect. |\n| 8 | Gethzerian Embervein | Gethzerian's sapphire eyes are filled with a fiery defiance. His dermal horns have been filed down to nubs, depicting his rejection of his infernal heritage. |\n| 9 | Thaze Heartshroud | A small, unremarkable Tiefling in appearance, but behind her unblinking amber eyes lies a ruthless, strategic mind that takes pleasure in political machinations. |\n| 10 | Malachai Von Ruthven | Coarse, brutish, and hulking, Malachai's dread-filled gaze and marred features tell of a hard life. His past as a slave instilled in him an unquenchable thirst for freedom. |\n| 11 | Hellion Dhampir | An aloof, towering figure, Hellion is an infamous bounty hunter. His crimson eyes and arcane purple tattoos tell of a man both feared and respected. |\n| 12 | Vexia Viperbane | Vexia's inquisitive golden eyes glow ominously in the dark. Known for her venomous wit and viper's charm, she is as dangerous as she is intriguing. |\n| 13 | Sargon Rathma | Carrying a staff capped by a skull, Sargon’s presence is unsettling. He’s a necromancer with ruby eyes, and a long tail that never stops moving, like a restless spirit. |\n| 14 | Abyzou Moonguile | Abyzou's onyx eyes and the crescent moon symbol on her forehead depict her devotion to a moon goddess. Seemingly cold, her incandescent flame-colored hair denotes her passion. |\n| 15 | Kalypso Doomvein | With sapphire eyes and shimmering scales along her arms, Kalypso holds a disarming, yet harsh beauty. Her smooth voice ensnares unsuspecting victims, leading them to their doom. |\n| 16 | Geryon Scourgesworn | Marked by his bulging muscles and gnarled horns, Geryon is an intimidating mercenary. His sharp, silver eyes speak of a violent past but also a quest for redemption. |\n| 17 | Lorcan Shardfist | Calm and meticulous, Lorcan is a scholar draped in dark robes. His crimson eyes and icy demeanor strike an eerie balance between curiosity and intimidation. |\n| 18 | Kothar Demonkin | With his muscular build and eyes like molten lava, Kothar is a notorious gladiator. His stony demeanor and dark aura are intimidating to all who cross his path. |\n| 19 | Mabon Nightgloom | Unnaturally pale, Mabon has luminescent tattoos covering his skin. These glow faintly in the dark, augmenting his eerie aura. He is an enigmatic figure of local folklore. |\n| 20 | Eisheth Hellscourge | Eisheth’s tall and slender faèade is punctuated by horns that curve like a ram's. Her eyes, the color of fresh blood, reveal her insatiable thirst for knowledge. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}