{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "Dungeons and Dragons - Rolltables",
  "description": "A compendium of 5e compatible rolltables generated by ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n| d20 Roll | Melee Attack Critical Failure |\n|---|---|\n| 1 |  Your attack misses entirely, and your momentum causes you to spin out of control, becoming prone. |\n| 2 | Your weapon slips out of your hand and lands 10 feet away from you in a random direction. |\n| 3 | Your miss gives your opponent an opening. They can make a reaction attack against you. |\n| 4 | You lose your footing temporarily, your speed is reduced to 0 until your next turn. |\n| 5 | You inadvertently hit an innocent bystander or ally (DM's choice) if there is one within your weapon's reach. |\n| 6 | Your attack ricochets off an object and you take 1d4 bludgeoning damage. |\n| 7 | You break your weapon on a nearby object, rendering it useless until repaired. |\n| 8 | You knock yourself out with your own attack, you're stunned until the end of your next turn. |\n| 9 | You overextend your attack. Your AC is reduced by 2 until your next turn as you're off balance. |\n| 10 | Your attack throws you off balance. You cannot take reactions until your next turn. |\n| 11 | You drop your guard while trying to regain balance, granting advantage to the next attack against you. |\n| 12 | In your attack's follow through, you expose a weak point. Your opponent gets a bonus to damage on their next successful hit. |\n| 13 | You overexert yourself in the attack and suffer 1 level of exhaustion. |\n| 14 | Your weapon becomes lodged in a nearby object, requiring a strength check to free it. |\n| 15 | Your attack's powerful recoil causes you to suffer 1d6 strain damage. |\n| 16 | Your hand cramps from the misfire, you have disadvantage on your next attack roll. |\n| 17 | You leave yourself wide open. The next attack against you is made with advantage. |\n| 18 | Your weapon's weight shifts unexpectedly, damaging your wrist. You take 1d4 damage. |\n| 19 | Your failed swing puts you off balance. You can't take bonus actions until your next turn. |\n| 20 | Your weapon slips out of your grip and hits you, dealing its base damage to you. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Melee"
    },
    {
      "rawText": "## Ranged\r\n| D20 Roll | Ranged Attack Mishap |\n| -------- | --------------------- |\n| 1 | Your weapon snaps under the force of the draw, it is now useless |\n| 2 | You misjudge the pull and the projectile shoots straight up. Next round it could fall on your head unless you move |\n| 3 | Your weapon slips out of your hand on release, and is flung 15 feet in a random direction |\n| 4 | Your shot goes wide and hits an unseen object, ricocheting back in your direction. You must make a DC12 Dexterity save to avoid getting hit by your own attack | \n| 5 | You accidentally shoot a companion next to you. Roll attack roll against your ally's AC |\n| 6 | The string on your bow snaps in your face. You are blinded until the end of your next turn |\n| 7\t| The shot shakes you off balance. Your movement speed is halved next round |\n| 8\t| The shot goes wild and hits an unintended object causing a ruckus. Any stealth is now broken |\n| 9\t| The shot goes incredibly wide and wastes additional ammunition |\n| 10 | You pull a muscle in your hand, you have disadvantage on attacks with this weapon until you have a short rest |\n| 11 | You misjudge your stance, stumbling forward 5 feet |\n| 12 | The weapon backfires causing an ear splitting noise, you are deafened until the end of your next round |\n| 13 | The ammunition used is damaged and shatters on release, causing you to take 1d4 slashing damage |\n| 14 | Your ammunition is lodged in your weapon, it will take an action to remove and the weapon cannot be used until it is |\n| 15 | You underestimate the strength needed and the shot falls flat at your feet |\n| 16 | Your weapon becomes caught in your clothing and you are unable to move until you use an action to free yourself |\n| 17 | You pull too hard on the string and it wraps around your wrist. The weapon is stuck to your hand until you use an action to free it |\n| 18 | Your attack goes off at an awkward angle and you twist your wrist. You take 1d4 damage |\n| 19 | The shot is caught by the wind and veers wildly off course, possibly alerting unintended creatures to your presence |\n| 20 | You manage to nick your hand on the draw, causing you to lose concentration on any spells or abilities you were maintaining |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| D20 Roll | Mishap Due to a Critical Failure on an Arcane Attack |\n|----------|------------------------------------------------------|\n| 1 | Your spell backfires and you take the full damage instead of the intended target. |\n| 2 | A surge of wild magic throws you 10 feet in a random direction. Roll a d8 for direction (1 is north, and then clockwise). |\n| 3 | Your spell causes an unintended side effect. An extra dimensional entity is temporarily summoned and it is hostile. |\n| 4 | The magic within you is temporarily drained. You cannot cast spells until you complete a long rest. |\n| 5 | Your spell affects a random target within range (DM's choice). |\n| 6 | Your spell rebounds towards you, roll against your own spell resistance. |\n| 7 | A phantom effect mimics your spell but no damage is dealt to the target. |\n| 8 | The energy of your spell is too powerful and engulfs you, causing you to faint until the start of your next turn. |\n| 9 | You accidentally open a minor gate to another plane of existence. An unexpected creature or object drops out. |\n| 10 | You are cloaked in a shimmering light, becoming a target. All enemies now focus their attention on you. |\n| 11 | Your spellcasting component or focus explodes from the raw magic, rendering it useless. |\n| 12 | The spell fails to cast but you still lose the spell slot. |\n| 13 | A blinding flash strikes your eyes. You are blinded until the end of your next turn. |\n| 14 | Instead of the intended spell effect, adhesive substances spring from your hands. You are restrained for 1d4 rounds. |\n| 15 | Your spell words get mixed up, casting a random spell from your list on a random target within range. |\n| 16 | Instead of attacking, your spell heals the target for the same amount of HP the attack might have caused. |\n| 17 | You become the target of your own spell, experiencing its full effect. |\n| 18 | Your magic fizzles out in an embarrassing way, causing nearby allies to lose confidence in your abilities. |\n| 19 | You are momentarily frozen in shock from the feedback of magic. You skip your next turn. |\n| 20 | A miscalculation in your spell's power causes an explosion dealing 2d6 damage to everyone within 10 feet. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Arcane"
    },
    {
      "rawText": "## Melee\r\n| d20 Roll | Boon from a Critical Melee Attack |\n| -------- | ------------------------------- |\n| 1 | Your attack hits with such force it sends the enemy sprawling. They must spend their movement to stand next turn. |\n| 2 | Your attack hits a vital organ. The enemy suffers an additional 1d6 damage per turn until they are healed. |\n| 3 | A surge of adrenaline grants you advantage on your next attack. |\n| 4 | Your confident attack intimidates nearby enemies reducing their attack bonuses by 1 for their next turn. |\n| 5 | The force of your attack knocks the enemy's weapon from their grip. It lands 10 feet away. |\n| 6 | Your hit breaks through the enemy's defensive stance, giving your allies advantage on attacks against them until your next turn. |\n| 7 | Your critical hit scares the enemy, making them flee until they can make a successful Wisdom save against your attack roll. |\n| 8 | Your precise attack removes any damage resistances or immunities the enemy may have for the next round. |\n| 9 | Your attack creates an opening for an ally. They can immediately make one weapon attack as a reaction. |\n| 10 | Your exceptional hit increases the critical hit range of your next attack by 1. |\n| 11 | You sense a weakness in your enemy's defenses. Your next attack against them has advantage. |\n| 12 | The power behind your attack is so immense it knocks the enemy back 10 feet and they fall prone. |\n| 13 | Your attack is so fast it catches your enemy by surprise, leaving them stunned until the end of their next turn. |\n| 14 | The enemy drops any item they were holding due to the force of your hit. |\n| 15 | Your strike is so harrowing that the enemy becomes frightened of you until the end of their next turn. |\n| 16 | The enemy is marked by your powerful attack, making them a clear target. Your allies get +2 on attack rolls against them until your next turn. |\n| 17 | You strike a nerve cluster, paralyzing the enemy until the end of their next turn. |\n| 18 | You shatter your enemy's confidence, reducing their damage by half on their next successful attack. |\n| 19 | In a dazzling display of skill, you gain one extra attack on your next turn. |\n| 20 | Your attack releases a shockwave that knocks nearby enemies prone. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Melee"
    },
    {
      "rawText": "## Ranged\r\n**D20 Rolltable: Boons due to a Critical Success on a Ranged Attack**\n\n| D20 Roll | Result                           |\n|----------|----------------------------------|\n| 1        | Arrow hits a vital organ, doubling the damage. |\n| 2        | Arrow penetrates enemy weapon, disarming them. |\n| 3        | Shot disorients enemy, they lose their next turn. |\n| 4        | Arrow pins enemy's foot, reducing movement speed by half. |\n| 5        | Enemy loses sight from dust or debris, granting advantage on the next attack. |\n| 6        | Missile disturbs the enemy's belt, causing them to drop a random item. |\n| 7        | Bolt pierces through the enemy into a second target, dealing halved damage to both. |\n| 8        | Arrow struck the enemy's hand, imposing disadvantage on their next attack. |\n| 9        | Successful shot encourages your allies, granting them +1 to their next attack rolls. |\n| 10       | Skilled shot intimidates enemies, forcing a morale check. |\n| 11       | Arrow shatters upon impact causing enemy to take an additional 1d4 piercing damage. |\n| 12       | Wind gusts aid your shot, allowing a second attack on different target in range. |\n| 13       | Shot disrupts enemy's casting, forcing a concentration check on spells. |\n| 14       | Arrow hits enemy's magic focus, disabling magic use until retrieved. |\n| 15       | Skillful shot severs enemy's sentimental keepsake, instilling fear and doubt. |\n| 16       | Projectile bounces off enemy onto nearby environmental hazard, triggering it. |\n| 17       | Shot grazes enemy's forehead, blinding them for their next turn. |\n| 18       | The exceptional hit bolsters your confidence, granting advantage on next attack roll. |\n| 19       | Arrow pierces enemy's bag of gold, scattering coins and distracting enemies. |\n| 20       | Perfect shot lands in enemy's mouth, blocking all verbal spells. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| d20 Roll | Arcane Attack Boon |\n|---|---|\n| 1 | Your attack resonates with the weave of magic, causing your spellcasting ability modifier to double for your next spell. |\n| 2 | The power of your attack leaves an arcane mark on your enemy that gives you advantage on your next spell attack against them. |\n| 3 | The enemy blasted by your spell is pushed 10 feet away in a direction of your choice. |\n| 4 | You tap into the raw source of magic, enabling you to cast your next cantrip without expending a spell slot in the next minute. |\n| 5 | Your spell creates an array of mesmerizing lights, temporarily blinding the enemy until the end of their next turn. |\n| 6 | Your successful attack sends a ripple through the magical weave granting you +2 AC for the next round. |\n| 7 | For a moment, time seems to slow; you can immediately take a bonus action. |\n| 8 | Your spell vibrates in harmony with your arcane focus—causing it to recover one expended spell slot of up to 3rd level. |\n| 9 | Your sparkling display of magic attracts the attention of a nearby magical creature who is now friendly towards you. |\n| 10 | You feel a sudden surge of arcane energy and regain hit points equal to the spell's level. |\n| 11 | The enemy hit by your spell takes an extra 1d6 force damage from the lingering arcane spectral energy. |\n| 12 | You channel the excess power into your defenses, gaining resistance to a type of damage of your choice until your next turn. |\n| 13 | Your spell shines a vivid, mesmerizing color. Any enemy who sees it is frightened until the end of their next turn. |\n| 14 | Sheer arcane power courses through you. Your Spell Save DC increases by 2 for your next spell. |\n| 15 | The enemies affected by your spell have disadvantage on their next saving throw against your spells. |\n| 16 | The shock of your attack disrupts the magical energies around you. The next spell cast by a creature other than you within 30 feet fails. |\n| 17 | Arcane runes appear around your enemy. The next attack against them by any creature is made with advantage. |\n| 18 | A wall of force appears in front of you. It provides three-quarters cover until your next turn. |\n| 19 | A duplicate of your spell ripples into existence, targeting a second enemy within range. |\n| 20 | The raw power of your spellcasting transforms the battlefield. Choose one point of terrain within 30 feet. It becomes difficult terrain for your enemies until the end of your next turn. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Thalon | A scarred, no-nonsense Aarakocra warrior, always seen with his trusted spear. |\n| 2 | Krell | A high-flying Aarakocra scout. His feathers are charred, evidence of his close calls with danger. |\n| 3 | Orilam | A watchful sentinel, no detail escapes from his sharp, hawk-like eyes. |\n| 4 | Heilaka | A stern character, she is the tribe's lead healer and master of herbal knowledge. |\n| 5 | Poshku | A grim gatherer, known for his uncannily accurate foraging skills. |\n| 6 | Eleleth | Reputed scholar, spends her time studying ancient texts and ruins. |\n| 7 | Tulk | A meticulous blacksmith, his metalwork is as precise as it is durable. |\n| 8 | Ylka | A young, serious Aarakocra ranger. She tracks threats with relentless resolve. |\n| 9 | Nym | A deeply religious leader, known for his solemn rituals and stern leadership. |\n| 10 | Vylri | A cold-blooded assassin, her steely eyes and sharp talons spark fear in many hearts. |\n| 11 | Qen | A decorated war veteran, stern and staunch in his dedication to the tribe's protection. |\n| 12 | Rel | A devoted druid, he communicates with nature regularly, and treats his duties with utmost seriousness. |\n| 13 | Ienkil | An honest and hard-working trader, known for her intricate handcrafts. |\n| 14 | Serku | A stern scribe, meticulously documenting the history and knowledge of his tribe. |\n| 15 | Wyn | A mysterious seer, her cryptic prophecies direct the future of the tribe. |\n| 16 | Xylka | A doting caretaker, looking after the young with a serious yet tender touch. |\n| 17 | Zelik | An accomplished enchanter, his magic items are known for their astonishing precision. |\n| 18 | Olu | A no-frills cook, known for simple yet nourishing meals. |\n| 19 | Abi | A disciplined hunter, who trains his eagle companion with strict precision. |\n| 20 | Ura | A revered elder, her wisdom is a guiding beacon for the tribe. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Irael | A solemn Aasimar cleric dedicated to maintaining order and peace; her silver-grey eyes radiate calm and serenity. |\n| 2 | Thamior | A stoic Aasimar paladin whose unwavering sense of justice is evident in his golden armor and crimson cape. |\n| 3 | Elyon | A highly disciplined Aasimar monk with spiritual tattoos covering his arms. His gaze is intense, indicating a deep level of focus and determination. |\n| 4 | Maurel | This Aasimar ranger frequents the wilds, his glowing, blue-eyed gaze always scanning the horizon. He is quiet, seemingly more comfortable amongst animals than people. |\n| 5 | Vaella | A driven Aasimar wizard whose thirst for knowledge is insatiable. She wears complex spectacles, her golden hair tied back as she constantly pours over ancient tomes. |\n| 6 | Jophiel | A wise Aasimar fighter, his love for strategy and tactics is as evident as the scars criss-crossing beneath his soft celestial glow.|\n| 7 | Zaphkiel | Zaphkiel serves as a humble Aasimar cleric, her healing skills as renowned as her empathic nature. She has a patient and caring demeanor, with a soft halo illuminating her compassionate face. |\n| 8 | Uriel | An Aasimar bard who composes solemn songs and epic poems. His music echoes both his celestial heritage and his quest for truth and enlightenment. |\n| 9 | Lenael | Lenael guards nature’s sacred spaces as a stoic Aasimar druid. Her silvery hair and leafy garments mirror the tranquility of the forests she protects. |\n| 10 | Seraphiel | An Aasimar monk, Seraphiel has secluded himself in a mountaintop monastery, to better understand the celestial essence within him. His stillness radiates an ethereal calm. |\n| 11 | Hadriel | An insightful Aasimar warlock who made a pact with a celestial being. His presence is unsettling yet awe-inspiring, as though he vibrates at a different frequency. |\n| 12 | Raguel | A steadfast Aasimar paladin, rumored to have smitten down a hundred fiends single-handedly. His imposing armor shimmers with celestial energy. |\n| 13 | Ramiel | An enigmatic Aasimar wizard specializing in divination. Even when still, he seems to reach out into the weave of magic that envelops the universe. |\n| 14 | Raphael | A hardy Aasimar fighter who uses his celestial strength to protect the innocents. His gauntlets often glow with divine energy when he clenches them to intervene. |\n| 15 | Saraqael | A versatile Aasimar bard skilled at manipulating both social situations and the raw forces of the arcane. Her lilting songs resonate with a celestial harmony. |\n| 16 | Uriel | A protective Aasimar ranger who watches over borderlands and frontiers. His eyes hold the steady gaze of one used to long vigils in the wilderness. |\n| 17 | Selaphiel | A disciplined Aasimar monk who strives to balance her martial prowess with spiritual growth. She is usually cloaked in serene silence. |\n| 18 | Israfel | An independent Aasimar rogue who trusts in her celestial intuition as much as her deft hands. She moves like a shadow, her passage marked only by a soft, silver glow. |\n| 19 | Cassiel | A scholarly Aasimar cleric, known for his pursuit of ancient knowledge. His aura resonates with the divine energy that constantly swirls around him. |\n| 20 | Azrael | A forgone Aasimar paladin on a solitary quest for retribution. Dark feathers are woven into his graying hair, and his eyes harbor a determined remorse. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n| Dice Value | Name         | Description |\n|------------|--------------|--------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1          | Grulg        | An intimidating and skilful bugbear hunter, muscular and covered in battle scars. Fiercely loyal to his tribe. |\n| 2          | Tharg        | A bugbear shaman with coal-black fur. Though he has an imposing presence, he speaks rarely and softly.  |\n| 3          | Snort        | A burly bugbear with a broken tusk and a gruff demeanor. Known for his outstanding strength. |\n| 4          | Varg         | A bugbear chieftain with fur scarred by burn marks. A brutal and ruthless leader, respected and feared by his tribe. |\n| 5          | Blarg        | An elder bugbear whose fur has started to grey. Highly revered for his wisdom and storytelling. |\n| 6          | Srag         | A bugbear scout with deep-set eyes and a lithe figure. Notorious for his stealth and tracking skills. |\n| 7          | Phrug        | A bugbear warrior defined by a white streak in his fur. Known for his fearlessness in battle. |\n| 8          | Gort         | A veteran bugbear sergeant with matted fur and numerous battle scars. Commands respect due to his long years of service. |\n| 9          | Flask        | A bugbear brewmaster, stout from testing his own concoctions. Seen as eccentric within the community, but appreciated for his craft. |\n| 10         | Ulg          | A bugbear artist with delicate hands. His intricate cave paintings bring a semblance of culture and beauty to the tribe. |\n| 11         | Slog         | A bugbear brute who serves as the tribe's enforcer. He is feared for his explosive temper and unpredictable behavior. |\n| 12         | Frug         | A female bugbear shamaness. Her eyes emit an eerie glow, hinting at her potent magical prowess. |\n| 13         | Zorg         | A disfigured bugbear warrior. His physical prowess remains despite his prominent limp. |\n| 14         | Gurt         | A recluse bugbear herbalist. His understanding of the forest plants around him have made him an essential part of the tribe. |\n| 15         | Harg         | A bugbear thief. Nimble and stealthy, he is often accused of stealing food from the communal stores. |\n| 16         | Prug         | An old bugbear, the tribes' record keeper. His memory serves as the living history of his people. |\n| 17         | Drool        | A bugbear hunter known for his deadly accuracy with a spear. His targets rarely escape. |\n| 18         | Skrag        | A bugbear blacksmith with powerful arms. His craftsmanship is highly valued and sought after. |\n| 19         | Brug         | A bugbear fisher. His knowledge of the local rivers and lakes is key to the survival of his tribe. |\n| 20         | Klorth       | A bugbear elder and peacekeeper. His fair judgement and negotiation skills maintain harmony within the tribe. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Ephemera | A solemn changeling with pale shifting eyes. They often adopt the form of a renowned scholar, deepening their understanding of the world through continual study. |\n| 2 | Mirage | A determined changeling who prefers to assume the form of royals and nobles. Their goal is to spread prosperity and justice, though their means are highly unorthodox. |\n| 3 | Vestige | A reserved changeling, usually mimicking the appearance of skilled warriors. Although they never speak of their past, their scarred body tells a tale of countless battles. |\n| 4 | Phantasm | An introspective changeling who spends most of their time as a traveling bard. Despite being in the spotlight, they manage to keep their true identity hidden. |\n| 5 | Effigy | A vigilant changeling who prefers the guise of a ranger. They use their camouflaging skills to protect the wilderness and its creatures from harm. |\n| 6 | Lacuna | A mysterious changeling who often takes the form of elusive thieves. Their motivations are unknown, but they seem to be driven by some personal vendetta. |\n| 7 | Cadence | A disciplined changeling who mostly appears as a disciplined monk. They carry themselves with grace and seem devoted to a life of contemplation and peace. |\n| 8 | Riddle | A secretive changeling tending to adopt the appearances of wise oracles. They are poised and always seem to speak in enigmatic metaphors. |\n| 9 | Illusion | A stoic changeling typically assuming the form of a solemn cleric. They are always ready to lend a helping hand, seeking to heal both physical and mental wounds. |\n| 10 | Figment | A shrewd changeling favoring the form of cunning rogues. They are quick to use their shape-shifting ability for personal gain, always one step ahead of their pursuers. |\n| 11 | Mirage | A calm changeling who mostly appears as a serene druid. They have an innate bond with nature and the creatures that inhabit it. |\n| 12 | Chimera | An ambitious changeling who often takes the form of influential nobles. Their charm and charisma enable them to navigate the political landscape with ease. |\n| 13 | Echo | A melancholic changeling who frequently adopts the appearance of wandering minstrels. Their songs are bittersweet, always leaving listeners touched. |\n| 14 | Specter | A daring changeling, typically taking the form of brave knights. Their courage and commitment to justice have earned them respect among many circles. |\n| 15 | Veil | A compassionate changeling who prefers the guise of gentle healers. The care they provide seems to reach deeper than just physical wounds. |\n| 16 | Doppelganger | An unpredictable changeling assuming forms of various adventurers. They live for thrill, always ready to join any journey, no matter how dangerous. |\n| 17 | Fragment | A wise changeling who often takes the form of scholars and sages. They seek knowledge above all, often sharing their wisdom with eager listeners. |\n| 18 | Quicksilver | A nimble changeling who usually appears as agile acrobats. Their swift maneuvers and playful behavior can captivate any crowd. |\n| 19 | Mirage | A composed changeling typically seen as court jesters. Behind their playful acts and jests, something deeply thoughtful seems to dwell. |\n| 20 | Paradox | A resourceful changeling who often adopts the shape of diffident librarians. Hidden behind a façade of timidity, they harbor a depth of understanding and insight. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Pyrrhus, the Stoic | Pyrrhus is a fiercely effective brass dragon adorned with ancient war marks and scars, a testament to his solitary nature and propensity for defense over flight. |\n| 2 | Ezelynn the Sage | Ezelynn is a time-worn silver dragon with a vast trove of knowledge about the magic arts and immortal beings, her stoic manner conceals a heart that is kind but tragically lonely. |\n| 3 | Xorn the Last | Xorn is a bronze dragon and the last of his bloodline. With a majestic presence and a palpable aura of solitude, he is stoic, with a sense of duty that borders on martyrdom. |\n| 4 | Ghazan the Endbringer | A massive gold dragon, Ghazan emits an aura of dread and finality, his somber gaze reflective of all the lives he has ended in pursuit of what he concludes to be the greater good. |\n| 5 | Marsalok the Guardian | Marsalok is a steadfast green dragon known to act as a protector of wild lands from encroaching civilizations, his countenance is stern and unyielding to intruders. |\n| 6 | Zyr the Unseen | Zyr, a shadow dragon filled with a bitter, calculating intellect, and known for manipulating events behind the scenes, speaks in dark, enigmatic riddles. |\n| 7 | Orastrum the Timeless | Orastrum is an ageless copper dragon, known for her dispassionate observation of time's ebb and flow, and for wisdom gleaned from countless epochs experienced firsthand. |\n| 8 | Ignomoth the Stoic | Ignomoth is a large red dragon with hardened scales from countless battles, he's stern, seldom speaking unless it warrants, and emits an awe-inspiring aura. |\n| 9 | Setherix the Wise | Setherix is an old silver dragon, eternally meditative, and is reputed for his counsel, providing wisdom only if deemed worthy. |\n| 10 | Korgos the Ironscale | Dwarfing most dragons, Korgos the black dragon is stoic and fearsome. His stillness speaks volumes of his discipline and battle-ready mindset. |\n| 11 | Vorastrix the Silent | Vorastrix is a white Dragon of myth, known for fierce battles and stoic silence. He only converses with those he thinks are worthy. |\n| 12 | Fersyth the Sentinel | This impenetrable bronze dragon Fersyth guards valuable treasures and powerful artifacts with a stoic commitment that is both impressive and terrifying. |\n| 13 | Xirven the Immutable | Xirven, a blue dragon, watches over desert dominions with a stern gaze and a will that defies the shifting sands, a creature of determination and unyielding spirit. |\n| 14 | Olyndar the Holder of Secrets | Olyndar, a secretly admired green dragon, is a cryptic keeper of hidden truths and forbidden knowledge that he guards with a stringent and unwavering will. |\n| 15 | Morhyth the Inevitable  | A silver dragon, Morhyth’s presence symbolizes impending doom or vast change, standing as the stoic grim reaper of destinies and unchangeable fates. |\n| 16 | Vyserion the Watchful | Vyserion, a blue dragon holds a patient, vigilant watch over the mortal realm with a stern gaze and an unwavering sense of duty. |\n| 17 | Taishyl the Unyielding | A copper dragon, Taishyl stands boldly in the face of adversity, never breaking stance nor abandoning his steadfast principles. |\n| 18 | Skeltheraz the Grey Watcher | Skeltheraz, an ancient grey dragon is a lonesome guardian of forgotten civilizations and lost eras, a stoic preservationist of time’s passing.  |\n| 19 | Halethrix the Unmoved | This black dragon, Halethrix remains ever stoic and impassive, remaining undisturbed by the world's changing moods and whims. |\n| 20 | Hestruvius the Solitary | Hestruvius, a silver dragon, spends eons in solitude. Silent and ponderous, he stands as a testament to the endurance of the draconian spirit. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| Dice Value | Name              | Description                                                                                                                                                                                                                                 |\n|------------|-------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1          | Thava             | A female dragonborn with scales as black as obsidian. She has a stillness about her that betrays no emotion. Serves as a respected war strategist.                                                                                          |\n| 2          | Morgran           | A hulking male Dragonborn with brilliant blue scales and sharp, calculating eyes. An esteemed Guard Captain often seen patrolling the city streets.                                                                                        |\n| 3          | Heskan            | A male red-scaled dragonborn, known for his fiery demeanor and piercing look. A popular blacksmith who takes his craft very seriously.                                                                                                      |\n| 4          | Ghesh             | A large, stoic dragonborn with storm-grey scales. He is the town's seasoned cleric and upholds the dragonborn code of honor with unwavering commitment.                                                                                    |\n| 5          | Valmurg           | An aging dragonborn scholar with green dragon ancestry, reflected in his emerald-hued scales. Renowned for his dedication to preserving ancient dragonborn lore.                                                                           |\n| 6          | Enna              | A striking dragonborn with silver scales, often seen studying the night sky with a calm, serious expression. Serves the city as a highly revered astronomer.                                                                               |\n| 7          | Paxan             | Paxan is an older, stern male dragonborn with bronze scales showing signs of age. As the tavern owner, he is known for his no-nonsense attitude and insistence on following the law to the letter.                                         |\n| 8          | Azan              | A yellow-scaled, slippery-eyed male dragonborn. As a merchant dealing in exotic goods, he always maintains a straight face during transactions, able to bluff even the sharpest of customers.                                              |\n| 9          | Bharash           | A dragonborn of white hue, respected in his town for his contributions to safeguarding it from threats as a seasoned ranger. Known for his stoicism and unflappable demeanor.                                                             |\n| 10         | Yrindra           | A powerful, regal female dragonborn with gold scales. Highly respected as the city magistrate, she is renowned for her fairness and precision in all legal matters.                                                                         |\n| 11         | Darragon          | Male dragonborn with obsidian black scales. His calm yet imposing presence is known throughout, where he serves as the silent, solemn undertaker.                                                                                          |\n| 12         | Quarethon         | A dragonborn of Topaz scales. A watchful, sun-hued eyes vigilant city guard, who shows no mercy to those who disrupt the peace.                                                                                                            |\n| 13         | Verthisathurgiesh | An ancient dragonborn sage, with deep grey craggy scales. Known for his vast wisdom and critical approach, spends most of his time in his extensive home-library.                                                                           |\n| 14         | Faerlara          | A respected dragonborn healer with sapphire scales and serene demeanor. Despite her quiet, serious air, she is deeply compassionate, working tirelessly to tend to the sick and injured.                                                   |\n| 15         | Corrinn           | A silver-scaled dragonborn diplomat known for her eloquent speeches and impartial decision-making. Her stern and unbiased approach in settling disputes has earned her great respect.                                                     |\n| 16         | Jherremor         | An amber-scaled, brooding dragonborn baker. His attention to detail and the precision in each dough fold make him a renowned member of the community, despite his serious and introspective nature.                                        |\n| 17         | Harragos          | A red-scaled dragonborn with an imposing stature. As the local blacksmith, he immerses himself in the precision required of his work, making very little small talk with customers.                                                         |\n| 18         | Mehen             | A green-scaled dragonborn, known for his attention to detail and precision in horticulture. A serious, quiet soul who spends most of his days in solitude, tending to his meticulously manicured herbal garden.                            |\n| 19         | Torinn            | A fiercely intelligent, blue-scaled dragonborn, who serves as the town's wizard. His knowledge of the arcane is vast, and his approach to teaching is rigorous, allowing no room for whimsy in magic.                                     |\n| 20         | Surina            | A stern, no-nonsense military commander. Her crimson scales reflect her fiery spirit and strict discipline. Known for her strategic acumen and rigorous training regimens, she commands respect among her troops.                       |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Ilxendren | Serious drow, known for his tactical mind. Assigned leader of a patrol unit, always alert and focused. |\n| 2 | Nilonim | Calm and composed, considered the voice of reason among her peers. Divine practitioner in the service of Lolth. |\n| 3 | Bemril | Skilled enchanter, holds an influential position in the matriarchy. Cold and frequently silent. |\n| 4 | Zebeyana | Skilled assassin known for her swift manoeuvres and stealthy exploits. Silent as a whisper, deadly as venom. |\n| 5 | G'eldreth | Seasoned warrior turned mercenary. Wears battle scars with pride. Respected and feared among ranks. |\n| 6 | Lhaunold | Dedicated lorekeeper, has a nearly encyclopedic knowledge of history and arcane matters. Respected scholar in the society. |\n| 7 | Ilharess | The ruling matriarch. Cunning in politics, ruthless in battle. Known to instill fear and respect in equal measures. |\n| 8 | Xull'rae | A drow spy, skilled at blending into the shadows. Known for her cloak-and-dagger exploits. |\n| 9 | Phaori | Young, ambitious warrior. Brash and impulsive, but skilled with her twin blades. |\n| 10 | Ilrune | Noble drow, diplomatic and unyielding. Highly regarded in matters of statecraft. |\n| 11 | Zebaneth | Skilled arms trainer, notorious for his brutal training methods. |\n| 12 | Xalyssa | Silent observer, known for her exceptional tracking and survival skills. |\n| 13 | Thyrintar | Senior advisor to the matriarch. Known for his calculating and pragmatic approach. |\n| 14 | Olath | The city's primary beast trainer, known for her unique understanding and control over monstrous creatures. |\n| 15 | Quethya | A feared enforcer of the city's law. Many learn to steer clear of her silent gaze. |\n| 16 | Galanodel | A mysterious figure, considered a hermit. Known for his wisdom and odd, cryptic sayings. |\n| 17 | Sarkath | A drow wizard, known for his extensive research on shadow magic. Keeps a low profile. |\n| 18 | Nemesra | An echoing voice in the council. Known for her political acumen and brilliant speeches. |\n| 19 | Thara'kad | Renowned rogue, known for her crafty and daring heists in the upper city. |\n| 20 | Jhaelir | A savant in tactics and strategy. She heads the defense planning of the city. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Thorin Hammerforge | A blacksmith known for his sturdy armor and precision-forged weapons. Takes immense pride in his work. |\n| 2 | Skaldar Shadowvein | A rogue who's known for his secretive ways and deceitful tactics. Clients dealing with him should be particularly careful. |\n| 3 | Grotnar Stonebrow | An elder duergar who has survived many conflicts. Respected for his wisdom and stoicism. |\n| 4 | Thorgal Frostbeard | A mage specialized in ice magic. Known to be cold and calculated in his demeanor.\n| 5 | Brakker Ironhead | A seasoned warrior decorated for his countless victories in the depth wars. Not one for friendly chatter.\n| 6 | Mogrim Darkgrip | A misunderstood alchemist who's often shunned despite his helpful potions and cures.\n| 7 | Drak Deathwhisper | A feared necromancer who's known to reanimate the corpses of his fallen enemies to fight for him. \n| 8 | Kargul Grimaxe | A duergar leader well respected for his leadership skills in war and peace.\n| 9 | Nalgrin Bonecrusher | A cruel duergar warlord notorious for his brutality on and off the battlefield.\n| 10 | Omnur Shadowfoot | A thief with a reputation for silently infiltrating the most protected of places.\n| 11 | Varik Quickstrike | An agile duergar warrior, known for his quick reflexes and precise strikes.\n| 12 | Belgorn Thunderdelve | A cleric of Deep Duerra, widely revered for his profound commitment and potent healing skills.\n| 13 | Feldurn Forgeflame | Fire-manipulating wizard admired for his skill, feared for his unpredictability.\n| 14 | Rothak Blackstone | A veteran city guard well-versed in city laws and keeping order.\n| 15 | Xagrind Battlehammer | A revered blacksmith who forges weapons used to wage wars and protect cities.\n| 16 | Neghar Steelfist | A barbarian who fights with his steel-covered fists. His strikes are as hard as his resolve.\n| 17 | Ulgar Bloodbeard | A duergar ranger lurking in the Underdark, hunting monstrous creatures for their bounties.\n| 18 | Brundor Daggerfoot | An assassin who carries out contracts without question, his loyalty bought with gold.\n| 19 | Korag Ironhide | A heavily armored duergar warrior known for his almost impenetrable defense.\n| 20 | Torga Mudgut | A duergar cook known not only for delicious meals but also for poison-laced \"special servings\" on dire occasions.\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Thorgar Axebearer | A sturdy and gruff veteran warrior, with a braided beard clasped by iron. Not one for jests or games, he values honor and duty above all else. |\n| 2 | Dorna Stonefoot | This elderly matriarch is adorned in jewels and fine fabrics, evidence of her high status. Stern and traditional, she expects respect from others. |\n| 3 | Gromli Firebeard | A hardy blacksmith with a flaming red beard, sweat and soot permanently dye his skin and singe his hair. His work is his life, and he gives it his focused determination. |\n| 4 | Brinna Ironside | A strict cleric with a gaze as iron hard as her shield, her faith in Moradin is unwavering. She offers little in the way of comfort, but plenty in steadfast guidance. |\n| 5 | Brogar Frosthammer | Rugged with piercing ice-blue eyes, this ranger knows the harsh wilderness like the back of his hand. He values practicality and resourcefulness above all else. |\n| 6 | Hilda Goldvein | A skilled jeweler, precise and meticulous. Her calculating gaze misses little, and she runs her business with a firm hand and sharp mind. |\n| 7 | Thrain Thunderbrow | A reclusive sage, old and wise. His brows are as fierce as an oncoming storm, foretelling of his thunderous temper when disturbed from his studies. |\n| 8 | Argus Flintshield | A stoic and disciplined guard captain. His sharp gaze and stern demeanor command respect. He lives by a strict code of vigilance and duty. |\n| 9 | Greta Stonefist | A seasoned fighter, her hands as hard as the stone she’s named after. She commands respect, not through words but through her uncompromising strength. |\n| 10 | Balgor Granitebeard | An architect known for designs as steady and stubborn as his personality. His grey, stony beard is a testament to his years spent perfecting his craft. |\n| 11 | Morag Steelbraid | A black-haired, hard-eyed weapons dealer. She runs her trade with precision, and her seriousness can chill a room. |\n| 12 | Skolti Stormheart | A shaman of elemental forces. His eyes hold a quiet storm, his manner stern and unyielding as the mountain he calls home. |\n| 13 | Borgus Hardhelm | A miner of words as well as ores. His terse language and focused gaze warn others not to waste his time. |\n| 14 | Drina Diamondheart | A gem carver, her heart as unfaltering as the diamonds she shapes. She has an exacting eye for quality and no patience for flaws. |\n| 15 | Fregnir Frostforge | A master brewer with an icy stare, he brews ales as strong and unyielding as the winter chill. |\n| 16 | Ysra Hammerfell | A stonemason, broad-shouldered and earnest. She takes her work seriously, treating each stone with a methodical, steady hand. |\n| 17 | Nalur Coppergut | A no-nonsense chef who takes his food as seriously as any warrior takes their weapon. He can withstand a bellyful of his own heavily spiced cooking. |\n| 18 | Dargun Ironhand | A hardened veteran of many battles, his hand replaced by a prosthetic of iron. He carries a heavy weight of loss and duty. |\n| 19 | Eilin Silvervein | A peddler of ancient artifacts, her sharp gaze and even sharper mind leave no room for doubts about her competency. |\n| 20 | Raghnar Battlebeard | A warlord of great repute. His tactics are as bristly and intertwined as his massive beard, and his presence radiates command. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Thalion Arannis | A stoic high elf ranger with silver hair and sharp amber eyes. Expert in wilderness survival. |\n| 2 | Faelar Erendriel | A reserved high elf wizard with a scholar's air. Specializes in ancient magical artifacts. |\n| 3 | Seraphia Elrethil | A stern wood elf cleric. Practitioner of an ancient elven religious order. |\n| 4 | Erevan Quilanas | A disciplined high elf fighter. Known for his masterful swordsmanship. |\n| 5 | Loril Liadon | A wise high elf druid. Has strong ties to nature and forest animals. |\n| 6 | Iadriel Holimion | A solemn wood elf rogue. Expert of stealth and thievery. |\n| 7 | Aithlinn Galanodel | A taciturn high elf bard. Known for her melancholic music and poetry. |\n| 8 | Silmiel Amakiir | An aloof high elf sorcerer. Hides immense magical power behind a calm demeanor. |\n| 9 | Helluin Siannodel | A determined wood elf monk. Pursues the path of self-mastery and inner harmony. |\n| 10 | Ethiron Ophelion | A resolute high elf paladin. Strives to uphold justice and righteousness. |\n| 11 | Dariel Firahel | A composed high elf warlock. Made a pact with an ancient fey creature for power. |\n| 12 | Morwen Meliamne | An unflinching wood elf barbarian. Fierce protector of her tribe's woodland realm. |\n| 13 | Arannis Xyolarrin | An organized high elf artificer. Makes intricate magical devices and gadgets. |\n| 14 | Thamior Xiloscient | A stringent wood elf ranger. Excellent navigator and tracker. |\n| 15 | Isilme Liadon | A serious high elf cleric. Strict follower of the elven god of knowledge. |\n| 16 | Naiara Naiëlore | A stern wood elf druid. Practices ancient natural magic to protect her forest home. |\n| 17 | Aelar Xiloscient | A level-headed high elf monk. Seeks inner balance through meditation and martial arts. |\n| 18 | Galadhon Quilanas | A steadfast wood elf fighter. Wields his ancestral elven blade with unparalleled skill. |\n| 19 | Estelar Le'Quella | A firm high elf paladin. Committed to the protection and preservation of life. |\n| 20 | Aerin Xanaphia | A composed wood elf wizard. Devoted to the study and preservation of ancient elven magic. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Zephyr | Air Genasi with silver hair that seems to float as if caught in a perpetual breeze. Serious and contemplative. |\n| 2 | Ember | Flame-touched genasi with a warm copper complexion, glowing eyes and relentless determination. |\n| 3 | Terra | Earth genasi with jade-like eyes and skin resembling polished stone. Segregates themselves to focus on their duties. |\n| 4 | Ripple | Water Genasi with blue-green skin, her hair resembling flowing water. Calm and composed under pressure. |\n| 5 | Vortex | Air Genasi with a constant, slight whirlwind around them. They dedicate themselves to their work with a stern rigidity. |\n| 6 | Obsidian | Earth genasi, dark as night, with gems for eyes. They are notorious for their severe and cogent thinking style. |\n| 7 | Boreas | Air Genasi, their hair white as snow, appearing frozen in the wind. Solemn and contemplative. |\n| 8 | Caldera | Fire Genasi with a constant, small flame flickering at their fingertip. They handle tasks with ruthless precision. |\n| 9 | Torrent | Water Genasi, eyes as deep as the ocean, hair flowing like waves. They are known for their austere and earnest demeanor. |\n| 10 | Sienna | Earth Genasi with a terra cotta complexion, their hair resembling fine sand. Solitary and committed to the task at hand. |\n| 11 | Frost | Air Genasi, as pale as winter, frost perpetually encrusting their hair and eyebrows. Cold and formal, they keep a unique aloofness. |\n| 12 | Pyrrhus | This fire Genasi's hair seems to be made of smoldering embers. Their constant, intense gaze reflects a single-minded dedication. |\n| 13 | Shale | Earth Genasi with a gravelly voice, skin mottled like rough stone. Always tedious and meticulous in their approach. |\n| 14 | Marina | This water Genasi's skin shimmers like an opalescent coral. With a calm demeanor, they are diligent in all endeavours. |\n| 15 | Sirocco | Air Genasi, their appearance altered to resemble a fierce desert storm. Rigorous and determined, they inspire allies. |\n| 16 | Etna | This fire Genasi seems to emit a gentle heat, her red eyes reflecting a fiery will. They're characterized by their intensity and tenacity. |\n| 17 | Silt | Earth Genasi, brown as river clay. Sharp, analytical, always burdened by their overarching responsibilities. |\n| 18 | Kelpie | A water Genasi with an array of sea-green hair. Despite their serene exterior, they are persistently focused and sober in their duties. |\n| 19 | Squall | Air Genasi with a tempestuous appearance, hair dishevelled and fierce. Serious and resolute, they stand unfazed in the face of challenges. |\n| 20 | Scoria | Fire Genasi, resembling burnt coals, with an unwavering gaze. Passionate, driven, and relentless, ever ready to ignite action. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Tilbo Gearfuse | A gnome tinkerer known for his practical inventions. He has a constant oil stain on his apron, and goggles pushed up onto his balding head. |\n| 2 | Nym Goldfinder | A weary gnome miner with a knack for finding precious metals, she carries a heavy pickaxe and always has dirt under her nails. |\n| 3 | Fennel Featherwhistle | A meticulous gnome scribe, Fennel always demands silence in his library and has a sharp eye for detail. |\n| 4 | Virel Quickclock | A gnome clockmaker renowned for his reliability and precision. Always punctual, and never a cog out of place in his work. |\n| 5 | Muxie Spellbolt | A magical researcher, Muxie is always surrounded by piles of arcane tomes and huddled over complex diagrams. |\n| 6 | Quilby Hexcog | A renowned potion master, Quilby's gnome's brews are sought after by alchemists all around the land. |\n| 7 | Krixle Pinchgauge | Krixle is a master mason and blacksmith, known for crafting sturdy fortresses and exquisite weaponry. |\n| 8 | Truffle Longshanks | Truffle is a garden gnome who has cultivated the most fascinating fungi and flora in the kingdom. |\n| 9 | Glenthistle Goldgrasp | A gnomish jeweler, Glenthistle has a discerning eye for gems and precious stones, along with a reputation for honesty. |\n| 10 | Binni Brightspark | A gnome artificer, skilled in enchanting everyday items with a touch of magic. Her creations are filled with surprising utility. |\n| 11 | Nackle Geargleam | Nackle is a zealous tinkerer known for his automaton creations. His mechanical pets are a testament to his skill and ingenuity. |\n| 12 | Pixmap Quilltouch | An experienced gnome cartographer. He has a keen sense for detail and his maps are highly prized by adventurers. |\n| 13 | Dellbin Fizzlepot | A gnome herbalist, mainly dealing with rare plants. He can identify and uses them in his healing brews. |\n| 14 | Snaps Clockspring | Snaps is a gnome clockmaker who values accuracy above all else. His skill ensures that no two clocks are alike. |\n| 15 | Binx Quickcog | A gnome mechanic, known for rapid and efficient repairs. Her hands are usually covered in oil from the machines she services. |\n| 16 | Trixi Sparklebeam | An enchantress gnome, Trixi's magic wand is never far from her hand. She is known for her enchanting spells and charming personality. |\n| 17 | Zeddle Tinwhistle | A gnome linguist specializing in ancient texts. His ability to decipher even the most cryptic texts is second to none. |\n| 18 | Clinker Fidgetspin | A gnome locksmith, renowned for her ability to pick even the most complex lock. Her deft fingers are a testament to her incredible skill. |\n| 19 | Flitter Nimblefingers | A specialized gnome in creating intricate embroidery and delicate stitchwork. Her needlework is as beautiful as it is resilient. |\n| 20 | Spindle Greasegoggles | An engineer gnome with a fondness for chimera-like contraptions. His physical blueprints are almost as complex as his mental ones. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Grubsnag | Stoic and quiet, Grubsnag is often underestimated due to his subdued demeanor. He is noted for his precise use of his dagger. |\n| 2 | Zikkit | Zikkit is meticulous and reserved. His command over magic is known among the tribe, with his innate ability to manipulate small flames. |\n| 3 | Ruzgob | Having lost an eye in battle, Ruzgob has a hardened and grim demeanor. He wields a scarred shield with skill and precision. |\n| 4 | Girk | Girk is a composed goblin who prefers technology over magic, specializing in traps and machines. |\n| 5 | Nogg | Nogg displays a strong silent persona. Known for his arrow work, he is a respected member of the tribe's hunters. |\n| 6 | Skabrit | Skabrit observes and listens more than he speaks. His knowledge of poisonous plants is exceptional and his influence in the tribe does not go unnoticed. |\n| 7 | Zog | The stoic Zog is the tribe's blacksmith. His work is simple and practical, much like his personality. |\n| 8 | Feggit | Feggit is reserved and careful. He is the primary food gatherer for his tribe, known for his experience and accuracy in spearfishing. |\n| 9 | Vurt | Vurt rarely speaks, but when he does, most listen. His tactical ability on the battlefield is unrivaled in his tribe. |\n| 10 | Klug | Klug is a serious and quiet goblin. He is highly skilled in the tracking and hunting of beasts in the forests. |\n| 11 | Muzg | Muzg is often seen with a stern expression. He is a skilled potion maker, using his knowledge of various herbs and plants. |\n| 12 | Rikkit | In spite of being withdrawn and quiet, Rikkit's role as the tribe's primary guard is unquestioned due to his acute senses. |\n| 13 | Skritz | Skritz prefers the company of his books over others, and his extensive knowledge on ancient writings is unmatched in the tribe. |\n| 14 | Shogg | Shogg can always be seen with a stern expression. Though reliable and strong, he prefers to show his worth through action rather than words. |\n| 15 | Pogz | Pogz is a goblin with few words. His skill with the crossbow is unmatched in the tribe and his silent watchfulness lends credibility to his role as guard. |\n| 16 | Zabog | Zabog is sturdy and solemn, and he is the tribe's primary craftsgoblin, known for his intricate designs. |\n| 17 | Gikk | Gikk displays composure and a knack for detail. Known for his skill in forging tools, he plays a vital role in tribe's day to day life. |\n| 18 | Zrub | Zrub is often silent, meticulously refining his magic. His ability to cast a potent healing spell has saved many in his tribe. |\n| 19 | Nembruk | Though stern and silent, Nembruk is a competent leader of his tribe. His strategic thinking has often led his tribe to victory. |\n| 20 | Skrigg | A notable tinkerer among the tribe, Skrigg is serious about his passion for invention. His creations are often practical and precise. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Thogar Flintskin |A seasoned ranger with a stern gaze, whose massive muscles are covered in distinctive stone-grey patterns.|\n| 2 | Kavaki Mountainwatcher | A calm and introspective cleric who sports a single long braid, often seen watching over the tribe at high mountain peaks.|\n| 3 | Kutho Pebblesplitter | A young warrior, showing promising prowess with the warhammer and an inclination for dutiful service.|\n| 4 | Ovorth Boulderbreaker | A respected elder with a braided beard decorated with bones and small stones, known for his gruff but wise instructions.|\n| 5 | Pavan Snowcaller | A mystic who reveres the elemental power of cold and ice, seen with frost-touched braided hair.|\n| 6 | Gathak Thunderfist | A skilled blacksmith, known for his boisterous laugh that echoes louder than thunder.|\n| 7 | Vaunea Stoneseer | A wise woman gifted with prophetic dreams, her eyes having the depth of mountain caves.|\n| 8 | Loakan Earthshaker | A rowdy barbarian, whose strength in battle causes the very earth to tremble.|\n| 9 | Marak Rockborn | A stoic and toughened guardian, whose body bears the signs of many successful battles.|\n| 10 | Yalana Cloudhair | A gentle bard whose mesmerizing singing voice stirs the mountain winds and clouds.|\n| 11 | Obar Graniteheart | A resolute chieftain, known for his unwavering resolve and for leading with an iron hand and a stalwart heart.|\n| 12 | Mogar Cliffwalker | An intrepid explorer always in search of new paths, his skin adorned with tribal tatoos of significant places he discovered.|\n| 13 | Ivakor Stonetalon | A revered shaman of the tribe, who commands the respect of the mountain spirits.|\n| 14 | Vola Skydreamer | A shapeshifting druid in tune with the mountain birds, often seen lost in her daydreams.|\n| 15 | Balur Cragspine | A skilled hunter and tracker, his rugged exterior hides a soul deeply connected with the natural world.|\n| 16 | Thulark Frostbeard | An elderly sorcerer who wields ice magics, his beard always frosted over, even in warmth.|\n| 17 | Maugan Stoneblessed | A devoted paladin, his faith strong as a rock, defends his clan with unmatched ferocity.|\n| 18 | Tovah Highpeak | A respected warrior, her body is covered in tattoos marking her victories over foe and beast alike.|\n| 19 | Dalara Stormheart | An audacious rogue, her fearless heart guides her in challenging even the fiercest storm.|\n| 20 | Korgot Earthcaller | The revered tribal elder, his deep connection with earth elements is respected and feared by all. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name          | Description                                                                                         |\n|------------|---------------|-----------------------------------------------------------------------------------------------------|\n| 1          | Elodan        | A stern, regal half-elf with a sharp wit and a sharper blade, always dressed in formal attire.     |\n| 2          | Lyndis        | A calculating, reserved half-elf sorceress, her cold demeanor hiding a passionate pursuit of knowledge. |\n| 3          | Alaris        | A serious half-elf ranger. Tracks enemies with unerring accuracy, his pale eyes rarely blinking. |\n| 4          | Eolande       | A discreet half-elf rogue adept at deception. Her purpose is always unclear and her past, unspeakable. |\n| 5          | Morwen        | A half-elf cleric with pristinely arranged robe and disciplined mannerisms, serving in a local temple. |\n| 6          | Harkan        | A grizzled half-elf warrior with many scars, his stoic face revealing nothing of his turbulent past. |\n| 7          | Seraphina     | An upright, immaculately dressed half-elf paladin, unyielding in her commitment to justice. |\n| 8          | Thalion       | A half-elf bard with a steely gaze, his lute songs echo with tales of lost love and heroic deeds. |\n| 9          | Valeria       | A hardworking half-elf artisan renowned for the exquisite quality of her handicrafts.  |\n| 10         | Orin          | A half-elf sailor, uncannily adept at predicting weather conditions and navigating unchartered waters. |\n| 11         | Lúthien       | A powerful half-elf wizard, her bloodline dates back to ancient elven dynasties, and so does her wisdom. |\n| 12         | Arannis       | A stern half-elf scholar specializing in ancient arcane lore, his usual spot is in the musty corners of the library. |\n| 13         | Eldrion       | A half-elf ranger who has earned respect among woodland creatures, his stoic demeanor rarely breaking. |\n| 14         | Iolanthe      | A half-elf druid versed in nature's secrets, stoic and stern in her determination to preserve natural balance. |\n| 15         | Tharivol      | A half-elf monk who has severed ties with worldly affairs, dedicating his life for divine spirituality and practice. |\n| 16         | Elebrin       | A half-elf warlock, her pact with the mysterious entity has granted her formidable power at a hefty price. |\n| 17         | Raelis        | A veteran half-elf guard, his stern expression and precise movements indicative of years of discipline. |\n| 18         | Lindir        | A half-elf herbalist, his every action is measured and precise, a reflection of his vast knowledge of flora. |\n| 19         | Miriel        | A half-elf noblewoman possessing an icy elegance, her exacting standards making her a force to be reckoned with. |\n| 20         | Isolde        | An aloof half-elf archer, her arrow never missing the mark—an embodiment of her focused and serious demeanor. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Gruumsh Ironhand | A stern Half-Orc war cleric. Olive-green skinned, muscular and bald. Carries an emblem of Gruumsh. |\n| 2 | Krusk Bloodfang | A disciplined Half-Orc battlemaster, characterized by long, red hair and a scar over his left eye. |\n| 3 | Yagra Stonefist | A reserved Half-Orc monk. She is tall with a powerful build, featuring a prominent jaw and shaved head. |\n| 4 | Ugrek the Stout | A diligent Half-Orc artisan with a penchant for blacksmithing. Stocky for a Half-Orc, and usually covered in soot. |\n| 5 | Thragg Axe-bearer | A taciturn Half-Orc ranger, known for his effectiveness in wilderness survival. Bares multiple battle scars. |\n| 6 | Grunnhilda Bonecrusher | A fierce female Half-Orc barbarian, known for her ferocity in battle. She has a mane of coarse hair and tribal tattoos. |\n| 7 | Ghaz the Unyielding | A Half-Orc paladin of conquest, imposing in full plate armor. Unusually tall with a severe expression. |\n| 8 | Morga the Fair | A notable Half-Orc sorcerer, characterized by her calm demeanour. Tall and lithely built, with long flowing hair. |\n| 9 | Skarr One-eye | A roguish Half-Orc who lost an eye in a botched heist. Lean, with wiry strength, manages to blend despite his Half-Orc features. |\n| 10 | Morak Bladethirsty | A violent Half-Orc berserker. Huge build, with a wild mane of hair. Often seen covered in warpaint. |\n| 11 | Grommash the Wise | A knowledgeable Half-Orc scholar and wizard. Distinguished by his clean-shaven head and ink-stained fingers. |\n| 12 | Vasha Shadowstep | A stealthy Half-Orc rogue. Thin and stealthy, with a dark cloak and soft boots. Not much is known about her. |\n| 13 | Kragg the Truthful | A smooth-talking Half-Orc bard. Dark-skinned, finessed, often surrounded by onlookers. Wields a well-worn lute. |\n| 14 | Orna Battleheart | A brave Half-Orc fighter. Brawny and heavily scarred, but with a surprisingly gentle voice and manner. |\n| 15 | Ulfrik Fistcaller | A mystical Half-Orc druid. Taller than most, with long dreadlocks and adorned with nature charms. |\n| 16 | Salida Warcry | A tempestuous Half-Orc storm herald. Always seems to be sporting some minor battle damage, with a constant air of readiness. |\n| 17 | Taragen Ironflame | An impassive Half-Orc warlock. Hard-faced and silent, with hands seemingly perpetually warmed by unseen fire. |\n| 18 | Arnbjorn the Unbroken | A stoic Half-Orc oath of the ancients paladin. Tends to communicate through actions rather than words. |\n| 19 | Yevelda Pathwalker | A trailblazing Half-Orc scout. Agile, toughened by the wilderness, with hawk eyes and an ever-present longbow. |\n| 20 | Uhelda Spirtkindler | A mystic Half-Orc shaman. Old and weathered, with wisdom-filled eyes and a staff gnarled like ancient roots. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Belba Brandybuck | A reserved woman with a sharp intellect. She wears her dark hair tied back and has deep-set green eyes. |\n| 2 | Milo Hornblower | A middle-aged man with a rotund belly. He is a skilled baker and is always seen with flour on his face, clothes, or hands. |\n| 3 | Eglantine Whitfoot | An elderly halfling with a sweet smile and soft, wrinkled hands. Despite her frail appearance, she has a youthful energy. |\n| 4 | Fosco Took | A retired soldier. He's a stoic man, with a noticeable limp, scarred along his arms and face. |\n| 5 | Poppy Goodbody | A young, spirited girl with a great love for adventure. Her muddy feet and calloused hands tell tales of her active lifestyle. |\n| 6 | Paladin Bolger | A significant member of the community. Honest and practical, he's short and portly with a red face from decades of hard work. |\n| 7 | Perlina Proudfoot | A gossipy woman with an infectious laugh. She tends to dress flamboyantly, preferring bright colors and shiny trinkets. |\n| 8 | Lobelia Sackville-Baggins | A lady of high society. She's quite proper and takes pride in her luxuriously furnished abode. |\n| 9 | Hamfast Gamwich | A simple farmer. A quiet man of routine, happy to tend to his small plot of land. His face is tanned and his hands are rugged. |\n| 10 | Periwinkle Grubb | A traveler and collector of strange artifacts. Wears a broad-brimmed hat and carries a large backpack full of oddities. |\n| 11 | Lobelia Greenhand | A herbalist known for her extensive knowledge of plants. Always seen with a basket filled with different types of herbs. |\n| 12 | Drogo Underhill | An introverted librarian. He has thin grey hair and spectacles on the end of his nose. He prefers the company of his books. |\n| 13 | Prisca Boffin | A skilled blacksmith. Strong and stocky, with soot-stained cheeks and determined brown eyes. |\n| 14 | Mentha Burrows | A teacher. Plain-looking with a strong sense of duty. Her spectacles hang around her neck on a simple gold chain. |\n| 15 | Hildibrand Took | A young and naïve but well-loved member of the community. His shaggy hair and wide eyes hint at youthful foolishness. |\n| 16 | Sapphire Burrowes | A famed healer. Has a calming presence, with her soft, caring voice and gentle touch. She wears a shawl of crisp white linen. |\n| 17 | Rufus Chubb | A hardworking carpenter. Rugged and good-natured, he's always seen with upturned sleeves and a pencil behind his ear. |\n| 18 | Amethyst Roper | A tavern-keeper. Plump and rosy-cheeked, she keeps the patrons entertained with her ever-present jovial nature. |\n| 19 | Marmaduke Bramble | The local historian. Grey-haired and serious, Marmaduke always carries a scroll or two under his arm. |\n| 20 | Marigold Cotton | A dressmaker. Petite and delicate, her nimble fingers are always either knotting or cutting thread. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name        | Description |\n|------------|-------------|-------------|\n| 1          | Ruzak       | A tall, muscular hobgoblin with scarred skin and severe, piercing green eyes. Wears heavy armor and carries a large, two-handed axe. |\n| 2          | Zarg        | Stocky and strong, this hobgoblin has a collection of old battle wounds and a hooked nose. Skilled with a spear. |\n| 3          | Kognar      | A cunning, lean hobgoblin with a known reputation as a skilled scout. Has pointed ears and a wickedly sharp curved dagger. |\n| 4          | Grimmok     | Bears a mean-looking longsword and a shield, demonstrating skill and strength in battle. Bald head and significantly large tusks. |\n| 5          | Agrog       | Quiet and deadly, this hobgoblin carries a crossbow. His aim is infallible and his yellow eyes often speak more than his words. |\n| 6          | Breg        | Extraordinarily sneaky and skilled with traps. Wears a patch over one eye and always carries a short sword. |\n| 7          | Hazagg      | A broad-shouldered hobgoblin with a long, disheveled black hair. Wields a battle hammer with precision and strength. |\n| 8          | Snaglath    | Short for a hobgoblin, stands firm in armor and surprisingly agile. Expert at the use of maces. |\n| 9          | Karg        | A tall, wiry figure with an astounding proficiency in archery. Silent but deadly at long range. |\n| 10         | Jarkrog     | A burly hobgoblin with a no-nonsense attitude. Skilled horseman and impressive with a lance. |\n| 11         | Nog         | A charismatic leader of his warband, a natural strategist who commands with his club-sword. Noted for his deep red skin. |\n| 12         | Yog        | Old and greyed, but still strong. This hobgoblin shaman is respected for his wisdom and feared for his magic powers. |\n| 13         | Vagnak     | A formidable warrior with a cruel streak, icy blue eyes, and a greatsword. Always first into the fray. |\n| 14         | Grok       | Rugged and dour, this hobgoblin veteran has seen many battles. Wields a chain whip with deadly efficiency. |\n| 15         | Threg     | Heavyset and brawny, this hobgoblin is surprisingly light on his feet. Moves stealthily and strikes effectively with a pair of hand axes. |\n| 16         | Skanrak   | A master at martial arts. Prefers to fight with bare hands than weapons. Notable for his multiple piercings. |\n| 17         | Garg      | An imposing figure, this hobgoblin is the warband’s standard-bearer. Carries a massive battle standard and a glaive. |\n| 18         | Zograth   | With a masterful command of the flail, this hobgoblin is a force to be reckoned with. His wild red hair completes a fearsome presence. |\n| 19         | Fangrok   | This hobgoblin enjoys using a barbed net to entangle his enemies before moving in for the kill with his trident. |\n| 20         | Rhog      | The executioner of his warband, this hobgoblin takes grim satisfaction in his work. Wields a large, terrifying executioner's axe. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Sir Brom of Northhold | A tall, stern man with a touch of gray in his black hair. Frequently seen in shining plate armor, silently exuding authority |\n| 2 | Lady Beatrix Heartcraft | An accomplished healer of the Royal Court, her deep blue eyes are filled with wisdom and seriousness |\n| 3 | Aldara the Silent | A hooded figure, always shrouded in mystery. Known for her precise executions and unyielding loyalty to the king |\n| 4 | Egor Bendall | The sober town blacksmith, dedicated entirely to his craft. Favored by the local warriors for his consistent work |\n| 5 | Ireena Kolyanovna | The daughter of a prominent burgomaster, always seen in solemn garb, reflective of her serious nature |\n| 6 | Brother Mathas | A stern monastery mentor, his spartan lifestyle mirrors his rigorous teachings |\n| 7 | Sheriff Halberd | Stern enforcer of law in the town, his no-nonsense attitude is both respected and feared |\n| 8 | Captain Bael | Military strategist, renowned for his severe demeanor and successful campaigns |\n| 9 | Bishop Osric | A high-ranking church official, his stern gaze strikes fear into the hearts of sinners |\n| 10 | Master Aldwin | The meticulous guildmaster, his exacting nature has elevated his guild to new levels of prestige |\n| 11 | Athelard the Seer | A reclusive mage whose predictions, though serious in tone and content, have always proven to be true |\n| 12 | Dame Moira | A relentless pragmatist, Moira leads her knightly order with a cold but fair hand |\n| 13 | Mercenary Gorstag | A battle-hardened warrior, his stern countenance hides a depth of strategic insight |\n| 14 | Pascal the Sage | A much-respected scholar, known for his dry wit and precise learning |\n| 15 | Professor Edgworth | Respected magic teacher of the high academy, his stern lectures are dreaded by all students |\n| 16 | Admiral Pendragon | An uncompromising naval officer, his harsh discipline and unusual tactics deliver results |\n| 17 | Inquisitor Vorrel | Symbol of justice in the kingdom, feared and revered for his absolute adherence to the law |\n| 18 | Letholdus the Alchemist | An eccentric but serious minded alchemist, his potions are sought after for their precision and power |\n| 19 | Yrsa the Barmaid | Though typically cheerful, Yrsa is known to sternly deal with any troublemakers at her tavern |\n| 20 | Steward Godwin | The strict administrator of the castle, his exacting standards keep the kingdom in order |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| Dice Value | Name  | Description |\n|------------|-------|-------------|\n| 1      | Eek     | This kobold has a thin, wiry build. Its scales are dusky grey and its eyes are a bright, piercing yellow. It is taciturn, always assessing its surroundings cautiously. |\n| 2      | Skrix   | Skrix has a larger build compared to most kobolds, with scales of a rich chestnut color. He is aggressive and tends to respond to perceived threats with immediate violence. |\n| 3      | Geks    | Geks has a malformed jaw that forces her to speak with a lisp. Her green scales are always clean and polished. She avoids confrontation and prefers negotiation. |\n| 4      | Thakk   | This kobold is small and tends to hide in the shadows. Its black scales blend in with the darkness. It is quiet and stealthy, preferring to avoid direct engagement. |\n| 5      | Rattel  | He is missing one eye and most of his teeth. Rattel is quick, both in movement and in wit, always looking for an opportunity to gain an advantage. |\n| 6      | Mikk    | With scales the color of old brass, Mikk hardly fits the stereotype of a kobold. He is stubborn and tends to do things his own way, often ignoring the warnings of others. |\n| 7      | Brik    | His scales bear the scars of many battles. Brik is a seasoned warrior, experienced and not easily intimidated. He is a natural leader within his tribe. |\n| 8      | Slink   | Thin and wiry, Slink is an adept scout. Her scales are a dull brown. She is quiet and often seen observing from a distance, gathering information. |\n| 9      | Zik     | Zik is slight even for a kobold, with dull, dun-colored scales. He is an incredible tinkerer, able to manipulate and repair complex mechanisms with ease. |\n| 10     | Nix     | Nix is a kobold with scales that glimmers like polished jet in the light. She is a spellcaster, inherently curious and constantly studying arcane symbols. |\n| 11     | Kikk    | Kikk is smaller than an average kobold, with a thin tail and scales that shine dark green. He is often seen making traps and is known for his craftiness. |\n| 12     | Grikk   | With scales of dirty white and pale eyes, Grikk is an albino. He is a natural survivor, having adapted to his lack of natural coloration by being incredibly stealthy. |\n| 13     | Flick   | Flick has scales that shimmer with silvery-blue tones. She is resourceful and driven, with a tendency to take charge when situations seem dire. |\n| 14     | Pikk    | This hefty kobold has scales that have an intense, fiery orange cast. He seems oddly jolly for a kobold and has a love for good food and drink. |\n| 15     | Skrill  | Light green scales cover Skrill's compact body. He is considered wise among his kin, often being sought out for advice or to settle disputes. |\n| 16     | Tikk    | Tikk has scales with a reddish-purple cast and a hunched posture. He has a natural aptitude for herbalism and potion-making. |\n| 17     | Drakk   | Drakk has a lean, muscular frame with ash-colored scales. He is somewhat reclusive, preferring the company of the cave's shadows to that of his kin. |\n| 18     | Rukk    | This kobold is sturdy with shiny golden scales. Rukk is known for his stubbornness and his impressive ability to endure in the face of adversity. |\n| 19     | Zikk    | Zikk's scales are a bright, startling yellow. He is a boisterous, loud individual who seems to thrive in the midst of chaos and commotion. |\n| 20     | Jikk    | This kobold is long and thin, almost snake-like, with variegated blue and green scales. Jikk is observant and has an uncanny knack for spotting hidden dangers. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n| Dice Value | Name | Description |\n| --- | --- | --- | \n| 1 | Skesh | An intensely focused lizardfolk hunter, his scales are a dark gren. He has a scar running down one eye, a prize from a monster hunt that went wrong. |\n| 2 | Hezz | A slender, soft-spoken lizardfolk gatherer. Her green-blue scales shimmer in the sunlight, and she always seems to be carrying an assortment of herbs and plants. |\n| 3 | Zranka | A powerful lizardfolk warrior, his red scales scarred from numerous battles. His gaze is piercing, and he carries a well-worn battleaxe. |\n| 4 | Grush | A seasoned lizardfolk ranger, known for stealthily moving through the wild. His scales are a blend of brown and green, providing excellent camouflage. |\n| 5 | T'vliss | An elderly lizardfolk shaman, his scales are faded with age and his eyes hold a deep wisdom. He is known for his ability to converse directly with the spirit world. |\n| 6 | Bish | A young lizardfolk, her light green scales are kept impeccably clean. She has gained respect through her impressive diplomatic skills. |\n| 7 | Yss | A steel-gray scaled lizardfolk, stoic and solitary. He shirks away from the societal norms of his people, preferring the quiet of his own solitude. |\n| 8 | Vraska | Vraska is a stern-looking lizardfolk with dark green scales. She is holds a respected position as a cleric in her tribe, proficient in the healing arts. |\n| 9 | H'ssith | A lizardfolk druid. His scales have an unusually vibrant color, and his connection to nature is undeniably profound. |\n| 10 | Ikriss | A black-scaled lizardfolk rogue. With her piercing eyes and swift movements, she's an expert in stealth and subterfuge. |\n| 11 | Kress | A lizardfolk artificer, copper-scaled and always seen tinkering with an array of odd contraptions. |\n| 12 | Grix | A lizardfolk elder with pale white scales that tell of his age. Known for his deep wisdom and diplomatic ways. |\n| 13 | Z'Tul | A lizardfolk warlock, his silver scales often shimmer under the moonlight. He emanates an aura of power and shadowy knowledge. |\n| 14 | Trask | A grizzled lizardfolk veteran. His deep mahogany scales bear the marks of a life spent in battle. |\n| 15 | N'rezz | A proud lizardfolk chieftain. His onyx black scales and imposing presence contribute to his aura of authority. |\n| 16 | Xhakar | A harsh lizardfolk scout with brown and green scales. He roams the wilderness, keeping his tribe informed of potential threats. |\n| 17 | Arras | A lizardfolk with elegant silver-blue scales and a soft-spoken manner. She is a well-regarded figure in lizardfolk culture due to her extensive knowledge of their history. |\n| 18 | Isra | An amber-scaled lizardfolk bard, her stories and songs captivate her tribesfolk. |\n| 19 | Nurth | A fierce lizardfolk gladiator, scarred but unbowed. His emerald scales shine brightly during battles in the arena. |\n| 20 | Sess'sa | A strong lizardfolk monk, her light silver scales are a symbol of her spiritual purity. Her disciplined regimen and meditation skills are admired by all. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name | Description |\n| ---------- | ---- | ----------- |\n| 1 | Gurthak | A menacing orc warrior, towering over most with a multitude of scars marking his battles. |\n| 2 | Snaga | An orc shaman bearing ritualistic tattoos, his gaze eerily quiet but intensely focused. |\n| 3 | Urgok | A wretchedly hunchbacked orc, surprisingly agile and a master of shadows. |\n| 4 | Kargath | An orc clan leader with a missing eye, exuding an air of uncompromising authority. |\n| 5 | Lurg | A grizzled old orc, showing signs of wisdom and resilience hardened by time. |\n| 6 | Grakkar | A massive orc blacksmith with burnt, calloused hands, an expert in crafting war tools. |\n| 7 | Glorg | A one-armed orc who's nonetheless lethal with his greataxe, his face locked in a perpetual scowl. |\n| 8 | Skarg | Clad in patchwork armor, this orc raider rides atop a large warg, commanding a pack of similar creatures. |\n| 9 | Zarnak | Adorned with various trophies from slain enemies, displaying the vicious essence of this orc hunter. |\n| 10 | Urghal | Deceptively frail looking, an orc mystic capable of communicating with the spirit world. |\n| 11 | Gorr | A hulking orc brute with rippling muscles who serves as the clan's personal bodyguard. |\n| 12 | Varak | Well-respected orc chieftain known for both his strategic mind and his punishing war hammer. |\n| 13 | Mork | Masked in war paint, this orc berserker enters every battle with a frenzied bloodlust. |\n| 14 | Dakkath | An orc war drummer, towering and lean, imposing fear through his ominous beats. |\n| 15 | Nargug | Covered in arcane symbols, this orc spell-caster manipulates the raw natural energies. |\n| 16 | Ragnok | An orc with an eyepatch, seasoned tactician and a highly skilled stalker of men. |\n| 17 | Barguul | Elderly orc hermit, often underestimated but revered for his uncanny divination abilities. |\n| 18 | Hrud | Cruel orc torturer, his gaunt face wears a deceptively placid expression. |\n| 19 | Throkk | A stoic orc beastmaster, commanding respect from both his clan and his monstrous pets. |\n| 20 | Ghog | With hands stained from herbs and mixtures, this orc alchemist is a keeper of ancient recipes. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n| D20 | Name | Description |\n|-----|------|-------------|\n| 1 | Asmodeus | A solemn black-eyed Tiefling with horns jutting neatly from his forehead. He wears an array of polished armor seated atop a phantom steed. |\n| 2 | Bael | A muscular, crimson-skinned Tiefling with keen eyes and sharp horns. He's a trusted advisor to a local lord and known for his sharp intellect. |\n| 3 | Dispater | A finely-dressed, bipedal tiefling with ebony skin and curly horn. She's a reputable merchant known for her quick wit and brilliant negotiation tactics. |\n| 4 | Fierna | A mysterious, slender Tiefling with unusually sky-blue eyes and asymmetrical horns. She's an accomplished sorcerer with a reputation of having ties with numerous secret societies. |\n| 5 | Glasya | A tall, dignified Tiefling with lavender skin, intricate horn carvings, and trailing ribbons attached to her tail. She's a stern librarian with an incredible collection of arcane textbooks. |\n| 6 | Levistus | A lithe and agile Tiefling with icy blue eyes and a network of tribal tattoos that run from his horns to his tail. He's a skilled huntsman, known for tracking creatures through the thickest of forests. |\n| 7 | Mammon | A sturdy Tiefling blacksmith with deep red skin, curly horns, and a jovial laugh. He's renowned for crafting the finest weapons within the kingdom. |\n| 8 | Mephistopheles | An agile Tiefling rogue with bronze skin, nubby horns, and deep, calculating eyes. Has a reputation for slipping past the most secured places unnoticed. |\n| 9 | Zariel | A taut, lean Tiefling with green eyes, well-polished horns, and rough patchwork clothes. He's a master ranger with profound knowledge about various terrains and creatures. |\n| 10 | Baalzebul | A brawny Tiefling with sand-colored skin, thick, curling horns, and intimidating muscles. He's a revered gladiator that holds a high stature in the underground fight clubs. |\n| 11 | Barbatos | A large Tiefling with obsidian skin, small clean horns, and a silver ring on her tail. She's a seasoned sailor known for navigating through the most treacherous seas. |\n| 12 | Belial | A well-groomed Tiefling with eye-catching lilac skin, delicate horns, and smooth, flowing gowns. A controversial politician with a reputation for swaying political climates. |\n| 13 | Geryon | A dusty-skinned, lean Tiefling with startling yellow eyes and straight horns. He's a sought-after storyteller known for spinning the most fascinating tales. |\n| 14 | Moloch | An elderly Tiefling with greying skin, cracked horns, and profound wisdom in his eyes. A former king advisor with an imposing influence in several city councils due to his vast experience. |\n| 15 | Beleth | A blond-haired, blue-eyed Tiefling with small pointed horns. Famous bard known for weaving magical melodies that evoke intense emotions. |\n| 16 | Raum | A nimble, gaunt Tiefling with ebon skin and shallow large horns. He's a renowned cat burglar known for his craftiness and stealth. |\n| 17 | Focalor | A bulky tiefling with smoky skin, sharp spiraling horns, and sturdy armour. A local guard captain respected for his unwavering loyalty and skill in arms. |\n| 18 | Vepar | A willowy Tiefling with sea-green skin, coral-like horns, and draped in seaweed garments. A revered sea-witch with command over fierce sea beasts and weather. |\n| 19 | Paimon | A svelte, captivating Tiefling with ice-blue skin, elongated horns, and garbed in flowing azure robes. A highly regarded oracle revered for her prophetic glimpses into the future. |\n| 20 | Andrealphus | A slender, jubilant Tiefling with pastel pink skin, curved horns, and adorned in colorful attire. A celebrated festival director known for orchestrating the most extravagant events in the region. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}