{
  "version": 2,
  "type": "campaign",
  "original": null,
  "title": "Dungeons & Dragons Rolltables",
  "description": "A compendium of 5e compatible rolltables generated by ChatGPT.",
  "imageUrl": "",
  "campaignEntries": [
    {
      "rawText": "## Melee\r\n| d20 Roll | Mishap |\n| --- | --- |\n| 1 | Your weapon slips from your hand and flies 15 ft. in a random direction. Anyone in the weapon's path must make a Dexterity saving throw or take damage as if hit by the weapon. |\n| 2 | You overextend and drop your guard, granting advantage on the next attack against you in this round. |\n| 3 | Your attack ricochets back at you. Make another attack roll against your own Armor Class. If it hits, you take your normal damage. |\n| 4 | You lose your balance, knocking yourself prone. |\n| 5 | Your melee weapon is lodged into the ground or nearby environment, requiring a Strength check to free it. |\n| 6 | Your attack goes wide and hits an ally within 5 ft. Make a new attack roll against their Armor Class. |\n| 7 | You overexert yourself in the attack, suffering 1 level of exhaustion. |\n| 8 | Your attack results in hitting yourself. Roll for damage as if you were hit by your own attack. |\n| 9 | Your weapon breaks on impact, rendering it useless until repaired. |\n| 10 | You suffer a minor injury, reducing your speed by 10 feet until you receive healing or complete a short or long rest. |\n| 11 | You whirl around uncontrollably after your miss, facing away from your opponent and becoming disoriented until the end of the next turn. |\n| 12 | You are so focused on the attack that you fail to notice a hazard in your environment. The DM chooses an appropriate hazard. |\n| 13 | You miscalculate your strike and it hits a wall, causing a shower of debris. Any creature within a 5-foot radius, including you, must make a Dexterity saving throw or be blinded until the end of your next turn. |\n| 14 | Your weapon cord (if any) wraps around your hand, making your weapon effectively stuck to your hand until you spend an action to untangle it. |\n| 15 | You overexert your swing and pull a muscle. You suffer disadvantage on Strength checks and Strength saving throws until you complete a short or long rest. |\n| 16 | Your miss exposes a weak point in your defense. The next attack against you before the beginning of your next turn has advantage. |\n| 17 | You stumble and fall prone after the missed attack. Your movement speed is reduced by half until the end of your next turn. |\n| 18 | Your opponent may make one opportunity attack against you as a reaction. |\n| 19 | Your failed attack leaves you wide open, your opponent can immediately make a free melee attack against you. |\n| 20 | You sprain your wrist, causing any future attacks to impose disadvantage until you receive healing. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Melee"
    },
    {
      "rawText": "## Ranged\r\n| **d20 roll** | **Ranged Attack Critical Failure Effect** |\n| --- | --- |\n| 1 | Your weapon slips from your hand as you make your attack, landing 10 feet in the direction of your target.|\n| 2 | Your bowstring snaps, making your weapon useless until repaired. |\n| 3 | A miscalculated release sends your projectile high in the air, the miss completely obvious and potentially warning enemies of your location. |\n| 4 | A ricochet sends your projectile flying back at you. Make a Dexterity saving throw or take damage as if you hit yourself. |\n| 5 | The wind picks up just as you release your attack, causing it to veer wildly off course. |\n| 6 | Your projectile snags on your clothing as you release it, sending it wildly off course and dealing damage as if you hit yourself. |\n| 7 | A string, wire, or other essential part of your ranged weapon breaks during the attack. The weapon is unusable until repaired. |\n| 8 | You misjudge the weight of your weapon or projectile, causing your attack to fall short and reveal your position. |\n| 9 | You drop your ammunition while drawing your weapon. You must use an action to pick it up. |\n| 10 | A sudden cramp in your arm or shaking in your hand causes your aim to veer widely off the mark. |\n| 11 | Your weapon jams or your bowstring snags, squandering the attack. |\n| 12 | You strain a muscle during the attack. Until you take a short rest, you make attack rolls with disadvantage. |\n| 13 | The distraction of an aiming misfire causes you to lose focus on your surroundings, giving enemies a chance to sneak up unnoticed. |\n| 14 | Your weapon breaks from the force of your attack. It is unusable until repaired. |\n| 15 | You accidentally aim too low and shoot the ground in front of you, causing ricochet stones or debris. Take 1d6 bludgeoning damage. |\n| 16 | Your projectile veers off and hits an unintended target, potentially a teammate or innocent bystander. |\n| 17 | You trip over your own feet and fall prone in your current location. |\n| 18 | The force of your attack leads to a wild swing, moving you 5 feet in the opposite direction. |\n| 19 | Your grip slips at the crucial moment, sending the weapon itself flying from your hand and landing 10 feet in the direction of your target. |\n| 20 | A string, wire, or other essential part of your weapon breaks, dealing 1d6 slashing damage to you. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| Roll (d20) | Mishap |\n| --- | --- |\n| 1 | The attacking spell rebounds in unpredictable ways and you suffer the full effect of your own spell. |\n| 2 | You become temporarily blinded by the flash of a misfired spell. You are blinded until the end of your next turn. |\n| 3 | A portal to a random plane is momentarily opened in front of you. A small, harmless extraplanar creature appears and is disoriented. |\n| 4 | Your spell and all other light sources within 30ft of you are suddenly extinguished, plunging the area into darkness. |\n| 5 | There is an explosion of arcane energy, everyone (including yourself) within a 10ft radius takes 1d4 force damage. |\n| 6 | You unintentionally amplify your spell outputs. You and all creatures within 20ft of you become Deafened until the end of your next turn. |\n| 7 | All of your hair stands on end due to the static of a foul magic and remains so until removed of the condition. |\n| 8 | A loud, thunderous boom accompanies your spell, causing all creatures within 100ft to become aware of your location. |\n| 9 | The arcane energy of your spell causes a vibration harm to yourself. You gain one level of Exhaustion. |\n| 10 | You seem to become a magnet for magic. For the next hour, all spell attacks against creatures other than you have disadvantage, but spell attacks against you have advantage. |\n| 11 | Your spell is unexpectedly converted into a shower of harmless flower petals, the area within 10ft of you is mildly obscured. |\n| 12 | Arcane feedback causes you to forget the spell you just cast. You can't cast it again until after you complete a long rest. |\n| 13 | Your spell targets randomly select one creature within range. If there are no other creatures, it selects you. |\n| 14 | A puff of smoke rises from your hands, your hands are magically dyed a bright color for a day. |\n| 15 | Your voice amplifies unnaturally, anything you say for the next minute can be heard up to 300ft away. |\n| 16 | An arcane shockwave is released, and all creatures within 10ft of you are pushed 5ft away from you. |\n| 17 | You lose your sense of direction for 1d4 rounds, drastically affecting your navigation skills. |\n| 18 | You overchannel your spell. The burnout renders you unable to cast any more spells until after a short rest. |\n| 19 | Your spell misfires and attacks an object within range, chosen by the GM. |\n| 20 | A random magic effect occurs, according to the spell mishap table determined by your GM. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Fumble",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Fumble - Arcane"
    },
    {
      "rawText": "## Melee\r\n| Roll (1d20) | Boon |\n|-------------|------|\n| 1 | Your attack leaves the enemy stunned, giving you advantage on your next attack against them. |\n| 2 | Your weapon rends a piece of gear on your opponent, impairing their defense. Reduce their AC by 1. |\n| 3 | You exploit a gap in the enemy's stance. Your attack reduces their speed by half until their next turn. |\n| 4 | Your attack knocks the enemy off-balance. Your next attack against them has advantage. |\n| 5 | You aim your attack to disable. The enemy has disadvantage on their next attack roll. |\n| 6 | Your attack leaves a deep wound. The enemy takes 1d4 bleed damage at the start of their next turn. |\n| 7 | You disarm your opponent. Their weapon flies 10 feet in a random direction. |\n| 8 | Your strike is so powerful it pushes your enemy 5 feet backwards. They must succeed on a Strength saving throw or lay prone. |\n| 9 | The force of your blow makes your enemy drop something they're holding (GM's choice). |\n| 10 | Your attack inspires your allies. They gain a +1 morale bonus on their next attack roll. |\n| 11 | Your attack weakens your enemy. They have disadvantage on Strength checks and Strength saving throws until their next turn. |\n| 12 | Your strike is blinding fast, the enemy is unable to react to your next attack. |\n| 13 | Your attack unbalances your enemy, giving them disadvantage on their next Dexterity saving throw. |\n| 14 | Your thunderous attack can be heard by all nearby creatures, potentially scaring off weaker ones. |\n| 15 | Your attack shorts out any magic item your opponent was wielding or wearing for one turn. |\n| 16 | The confidence from your attack bolsters up your next saving throw giving you advantage. |\n| 17 | Your attack severs your enemy's supply pouch, causing them to lose one of their healing potions or similar item. |\n| 18 | Your attack detonates any explosive or high volatile item your enemy has in their possession. |\n| 19 | Your attack scares the enemy, giving them disadvantage on attacks against you for the rest of the combat. |\n| 20 | Your attack breaks your enemy's morale, forcing them to make a Wisdom saving throw or flee. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Melee"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Melee"
    },
    {
      "rawText": "## Ranged\r\n| d20 Roll | Boon |\n|---|---|\n| 1 | Your arrow finds a gap in the enemy's armour, causing an additional die of damage. |\n| 2 | An incredible shot ruptures the enemy's weapon, disarming them. |\n| 3 | Your projectile ricochets off a surface, hitting a second target. |\n| 4 | The force of your shot pushes your target 5 ft back. |\n| 5 | Your arrow integrates a vital organ, causing the target to be stunned on their next turn. |\n| 6 | Your shots terrify the enemy. They must make a Wisdom saving throw or be frightened of you until the end of your next turn. |\n| 7 | The velocity of your shot breaks through an environmental obstacle, opening new paths or cover. |\n| 8 | Your shot distracts the enemy, leaving them unable to use reactions until their next turn. |\n| 9 | Through an impressive display of skill, you fire two shots at once. Roll another attack against a secondary target. |\n| 10 | Your critical hit causes the target to bleed. They take additional damage at the start of each turn equal to your Dexterity Modifier. |\n| 11 | Your shot knocks the wind out of the enemy, halving their speed until they use a full action to recover. |\n| 12 | The ambient forces enhance the momentum of your arrow, causing the attack to deal force damage instead. |\n| 13 | Your shot reveals a weak point in your enemy's defence. The next attack on them from an ally has advantage. |\n| 14 | Your shot pins the enemy to a nearby surface, they are restrained until they successfully make a Strength check to free themselves. |\n| 15 | Your sheer mastery with the weapon allows the next attack on the same turn to have a bonus equal to your proficiency bonus. |\n| 16 | The enemy's equipment is shattered by your projectile, handicapping them in their next action. |\n| 17 | Your shot strikes true, ignoring any damage resistance the target may have. |\n| 18 | Your amazing aim allows for a homing shot. Your next ranged attack automatically hits the same target unless line of sight is completely broken. |\n| 19 | Your shot lifts enemy's feet off the ground, toppling them. The target is knocked prone. |\n| 20 | A true display of mastery. Roll damage for the attack twice, adding both results together. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Ranged"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Ranged"
    },
    {
      "rawText": "## Arcane\r\n| d20 Roll | Boon Description |\n| -------- | ---------------- |\n| 1    | Your arcane attack becomes especially potent. The target takes an additional 2d10 arcane damage.|\n| 2    | Your control over arcane forces strengthens. Gain advantage on spell attack rolls until the end of your next turn.|\n| 3    | An arcane beacon pulses from the target struck, reducing its resistance to all damage types until the end of your next round.|\n| 4    | Arcane energy overflows from your successful attack. All foes within 10 feet of your target take 2d6 magic damage.|\n| 5    | An arc of energy leaps from your target to hit another, dealing half the original damage to the secondary target.|\n| 6    | The arcane energy used in your attack rejuvenates you, restoring 1d8 hit points.|\n| 7    | Your hit resonates with arcane power, staggering the target. It loses its next action.|\n| 8    | Your arcane attack holds residual energy. You gain +1 to your AC until the end of your next turn.|\n| 9    | You tap into the very essence of magic itself. For your next spell cast, you don't spend a spell slot.|\n| 10   | Your arcane attack creates a shield around you, providing half-cover until your next turn.|\n| 11   | An echo of your arcane attack bounces back to buff you, increasing your spell save DC by 1 for the next round.|\n| 12   | Your magical attack unbalances the surrounding mana. All magic users in a 10ft radius of the target have disadvantage on their next spell attack roll.|\n| 13   | Pure arcane energy manifests as a duplicate of your spell, landing another attack on your original target.|\n| 14   | Your arcane prowess intimidates nearby enemies. Foes within sight must make a Wisdom saving throw or be frightened of you until the end of their next turn.|\n| 15   | Your accurate arcane attack siphons some of the target's vitality, healing you for a quarter of the damage inflicted.|\n| 16   | Your arcane attack creates a burst of force throwing your target back 10 feet.|\n| 17   | The sheer power of your arcane attack leaves the target dazed, giving it disadvantage on its next attack roll.|\n| 18   | Your arcane attack radiates an aura of dread around the target. Enemies within 5 feet of the target must make a Wisdom save or be frightened until the end of their next turn.|\n| 19   | The critical power of your attack unlocks a chain of magic within you granting an extra spell slot of the highest level you can cast.|\n| 20   | The ultimate boon: Your arcane attack shifts reality itself. Instantly restore all expended spell slots.|\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Critical",
        "D&D 5E",
        "Arcane"
      ],
      "tagSymbol": "~",
      "tagValue": "Critical - Arcane"
    },
    {
      "rawText": "## Aarakocra\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Xara | A veteran warrior with feathered wings the color of steel, solemn and disciplined. |\n| 2 | Tultac | A legendary sage and historian with light grey feathers, known for his vast knowledge and serene demeanor. |\n| 3 | Quara | A scout with swift wings and an eye for detail, living up to her role with serious commitment. |\n| 4 | Jrakk | An elder with pure white feathers, revered for her wisdom and thoughtfulness. |\n| 5 | Ounrae | A healer with gentle blue plumage, her calm composure inspires trust in those she mends. |\n| 6 | Raam | A black feathered trader, always serious and unyielding when it comes to dealings. |\n| 7 | Corvus | An aarakocra fighter with feathers as black as night, as serious as they come. |\n| 8 | Stryx | Skilled hunter with rust-colored feathers, known for precise strikes and silent maneuvers. |\n| 9 | Wolara | An orange-feathered diplomat, known for her calm demeanour during tense negotiations. |\n| 10 | Zephyra | Albino ritualist known for a stoic personality and precise chanting during religious ceremonies. |\n| 11 | Yarak | A dark green sentinel standing tall, focused solely on the protection of his people. |\n| 12 | Skerra | Sky-blue messenger, capable of swift and precise deliveries, maintaining a focused demeanor. |\n| 13 | Kriv | Bronze-feathered artisan, meticulous in his craft and strict in maintaining quality. |\n| 14 | Lorara | An elder sage with silver feathers, her seriousness and wisdom unfathomable. |\n| 15 | Nemon | Brown-feathered courier, his dedication to timely and safe delivery unwavering. |\n| 16 | Ura | A white-feathered priestess, solemn and entirely devoted to her spiritual duties. |\n| 17 | Kesarak | A quiet and stern teacher with navy blue plumage, dedicated in imparting knowledge. |\n| 18 | Vokk | A serious and efficient cook, his bright red feathers as fiery as his determination. |\n| 19 | Omarr | The solemn guardian of the forest with dark green feathers, committed to its protection. |\n| 20 | Pyrra | A patient and methodical cartographer with violet feathers, recognised for her precise workmanship. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aarakocra"
      ],
      "tagSymbol": "~",
      "tagValue": "Aarakocra Names"
    },
    {
      "rawText": "## Aasimar\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Sarathiel | A stoic warrior with silver hair and violet eyes. She has two feathered wings that shimmer with an ethereal light. Always armored and ready for battle. |\n| 2 | Tamriel | An elder sage with wisdom beyond his age. He has radiant topaz eyes and shiny, metallic golden hair. His wings are large, white, and always seems to gently flutter. |\n| 3 | Caladrius | A healer with a serene presence. He has long, curly blond hair and sapphire eyes that glimmer with kindness. His wings are an iridescent white. |\n| 4 | Eleutheria | A serene maiden with a warhammer. Green-eyed with cascading waves of chestnut hair, she has two large, feathered wings that shine brightly, regardless of the ambient light. |\n| 5 | Eosphoros | A scholar of arcane knowledge with long silver hair and eyes that sparkle like stars. His wings radiate a feeling of tranquility. |\n| 6 | Seraphina | A young Aasimar with gold-flecked teal eyes and long, flowing white hair. Her wings emit a soft light and she has a tranquil aura. |\n| 7 | Zophiel | A guardian with vibrant red hair and golden eyes. His strong wings carry an aura of authority. Always vigilant. |\n| 8 | Ophiel | A bald, muscular Aasimar with piercing blue eyes. His wings are a radiant silver, and he carries with him an aura of peace. |\n| 9 | Xaphan | A silver-haired Aasimar with eyes that glow like embers. His wings are a smoky grey, and he wields a flaming sword. |\n| 10 | Eloa | A fair maid with golden locks and eyes that radiate with an inner light. Her wings are comparable to the evening sun – warm and welcoming. |\n| 11 | Nathaniel | A strong yet somber soldier with dark green eyes and hair like black obsidian. His wings mirror his demeanor – serious and watchful. |\n| 12 | Simiel | An agile scout with eyes the color of clear skies and dashing white hair. His wings move silently as the morning breeze at dawn. |\n| 13 | Eremiel | A slender, silver-eyed figure with golden strands for hair. His wings shimmer with celestial luminosity. |\n| 14 | Merisiel | A broad-shouldered Aasimar with sable hair and melancholy aquamarine eyes. His wings are grand, their aura somber. |\n| 15 | Jophiel | A soldier with fiery eyes and crisp, white hair. His wings flutter intensely, radiating a fierce sense of duty. |\n| 16 | Penemue | An Aasimar with chestnut hair and focused brown eyes. Her wings are an iridescent white. She is committed to preserving and sharing wisdom. |\n| 17 | Remiel | Features softened by age, Remiel possesses lavender eyes and long silver hair. His wings radiate a soothing light. |\n| 18 | Sahaqiel | A figure with shadows in his sapphire eyes and ivory hair streaked with silver. His wings carry the chill of a moonlit night. |\n| 19 | Suriel | A seer with pearl white hair and keen emerald eyes. His wings seem to shimmer with the colors of the auroras. |\n| 20 | Zerachiel | A warrior with sturdy silver wings, icy blue eyes, and hair as white as snow. Her presence is calming, despite her warrior's mien. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Aasimar"
      ],
      "tagSymbol": "~",
      "tagValue": "Aasimar Names"
    },
    {
      "rawText": "## Bugbear\r\n| Dice Value | Name                | Description                                                                                                        |\n|------------|---------------------|--------------------------------------------------------------------------------------------------------------------|\n| 1          | Grarrk the Silent   | Grarrk is an unusually soft-spoken and stealthy bugbear. He prefers to keep to himself and avoids conflict when he can. |\n| 2          | Krukk Blood-Claws   | Krukk is a grizzled, scar-covered bugbear with mean, blood-red eyes. He's known for his brutal fighting style.                     |\n| 3          | Rorthoc the Sturdy  | Burly and reliable, Rorthoc stands out among the bugbears for his undying loyalty towards his tribe.                                  |\n| 4          | Zagg the Quick      | Zagg is freakishly fast for a bugbear, giving him an edge in both hunting and battle.                                                      |\n| 5          | Yvgor the Wise      | Yvgor is an elder bugbear shaman known for his vast knowledge and arcane powers.                                                          |\n| 6          | Thokk Broken-Tooth  | Formerly a fearsome warrior, Thokk now serves as a cautionary tale about the hazards of hubris, due to an injury that never healed properly.                  |\n| 7          | Gurrn Three-Scars   | Gurrn is a ruthless bugbear chieftain that rules over his tribe with an iron fist.                                                         |\n| 8          | Nok Bonecrusher     | Known for his strength, Nok is a rightly feared bugbear that crushes foes without mercy.                                                   |\n| 9          | Ulgabrust the Grim  | Ulgabrust is a seasoned warrior, hardened by many battles and skirmishes. His presence is intimidating to even the bravest.               |\n| 10         | Grothok the Fierce  | Grothok is a fierce and combative bugbear, known for his reckless bravery and true warrior spirit.                                        |\n| 11         | Zarug the Feared    | Zarug has a dangerous reputation for his cunning and ruthlessness, making him a feared name among the enemies of bugbears.              |\n| 12         | Hurknog One-Eye     | Hurknog is a grizzled veteran missing an eye, a loss that appears to have done nothing to dampen his fighting spirit.                    |\n| 13         | Bragol Bone-Breaker | Bragol is a terrifying bugbear executioner known for his sadistic laughter. He serves the chieftain as enforcer and torturer.                                      |\n| 14         | Skith Night-Prowler | Skith is a shadowy figure, an expert scout and spy. He spends most of his time skulking in the dark.                                      |\n| 15         | Mong the Slaughterer| Mong's reputation as a bloodthirsty killer precedes him. Few opponents live long enough to regret underestimating him.                   |\n| 16         | Urgnar the Vicious  | Urgnar is mean and vile, even by bugbear standards. Cross him at your own peril.                                                           |\n| 17         | Wrukk the Ruthless  | Wrukk is a cruel and merciless bugbear who terrorizes his opponents with brute force and terror.                                         |\n| 18         | Yargol the Daemon   | Yargol is a bugbear said to be possessed by a hellish spirit. His actions and appearance are terrifying to behold.                        |\n| 19         | Grash the Phantom   | Grash is an outcast bugbear who lives in the wilderness. His existence is the stuff of ghost stories among his kin.                      |\n| 20         | Hrothgar the Mad    | Terrifying and unpredictable, Hrothgar's sanity is questionable. He's known to howl at the moon and fights with startling ferocity.      |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Bugbear"
      ],
      "tagSymbol": "~",
      "tagValue": "Bugbear Names"
    },
    {
      "rawText": "## Changeling\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Eldin | A solemn looking changeling whose eyes hold an unending well of sadness. Eldin tends to keep their shapeshifting to a minimum, generally appearing as a gaunt and grey-skinned individual. |\n| 2 | Syl | This changeling maintains a facade of a short, pragmatic halfling woman, Syl's true form only comes into play during dire situations. |\n| 3 | Renn | Preferring the guise of a sophisticated elf with an air of nobility, Renn is a changeling known for their charm and intelligence. |\n| 4 | Verin | Mostly assumes the form of a robust human blacksmith, but the telltale white hair slips through sometimes, leaving Verin's real identity a secret to few. |\n| 5 | Nysa | Nysa uses her shapeshifting abilities to present herself as a young gnomish girl, enabling her to infiltrate and gather information unnoticed. |\n| 6 | Dontan | Always seen in the guise of a grizzled dwarf warrior. Dontan rarely reveals his changeling form, taking pride in the persona he maintains. |\n| 7 | Rael | Rael is a changeling that has taken the form of a wise old man, preferring to live out his days in peace rather than partaking in covert actions. |\n| 8 | Elara | Prefers to appear as an ethereal half-elf with silver hair. Elara is a changeling who thrives on deception and plays many roles seamlessly. |\n| 9 | Irys | Often seen in the form of a beautiful maiden. Irys is a changeling who uses her powers of transformation to gather information and manipulate others. |\n| 10 | Drystan | The robust figure of a half-orc is Drystan's preferred form. Not keen on subtlety, he uses his talents to initiate brute force or intimidation when required. |\n| 11 | Orys | Orys very rarely shifts form, preferring to stick to his neutral and ambiguous changeling look, which helps him blend in with various races. |\n| 12 | Belis | Preferring the form of a bookish gnome, Belis is a changeling with a passion for knowledge and arcane lore. |\n| 13 | Yara | Often seen in the deceptive guise of a beggar or a harmless old lady, Yara uses her shape-shifting skills to their utmost for various purposes. |\n| 14 | Soren | Soren prefers the powerful image of a dragonborn warrior to mask his changeling nature, playing upon fear and respect in equal measure. |\n| 15 | Faelen | A talented bard who frequently changes between various forms to entertain his audience, Faelen prefers to live his life in the spotlight. |\n| 16 | Eirene | Always seen in the guise of a mysterious, aloof high-elf. Eirene has mastered the art of blending in while gathering obscure details. |\n| 17 | Valen | Valen has chosen the form of a stoic, battle-scarred human mercenary, allowing him to walk freely among both commoners and soldiers. |\n| 18 | Morwen | Preferring to appear as a charming noblewoman, Morwen navigates high society as easily as she does her own changeling nature. |\n| 19 | Toren | A changeling who typically assumes the appearance of an intimidating teifling rogue, Toren finds power and freedom in fear and obscurity. |\n| 20 | Zephyr | Takes the form of a wild and mischievous fey creature, but Zephyr's ethereal and faintly glowing form gives away his changeling nature. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Changeling"
      ],
      "tagSymbol": "~",
      "tagValue": "Changeling Names"
    },
    {
      "rawText": "## Dragon\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Sarthastrasz | A venerable red dragon, known for his brutal tactics and a deep sense of honor. His scales bear the scarification of countless battles. |\n| 2 | Tiastramagk | A hypnotic green dragon, her cunning and manipulation are to be feared as much as her poisonous breath. |\n| 3 | Berinath | An ancient silver dragon, as sage as he is just. Known to help mortals in their time of need. |\n| 4 | Cindaryx | A young brass dragon, his keen curiosity often leads to unpredictable outcomes. His scales shimmer in the desert sun. |\n| 5 | Yastildix | An imposing black dragon, residing in the swamp lands, feared for her cruelty and corrosive acidic breath. |\n| 6 | Feryndastrasz | A bronze dragon of noble lineage, guarding the coasts with diligence and valor. |\n| 7 | Hryskarix | An elusive white dragon known for his icy breath and solitary nature. Prefers cold, desolate lands for his dwelling. |\n| 8 | Quiverscale | A copper dragon whose boundless love for riddles and pranks has caused trouble on numerous instances. |\n| 9 | Yarjhan | A gargantuan red dragon, his tyrannical reign has kept many kingdoms in fear for centuries. |\n| 10 | Pernastrasz | An elder gold dragon known for his wisdom, charisma and magic abilities. Regarded as a deity by a few mortal civilizations. |\n| 11 | Xethrinda | A keen-eyed blue dragon with a dangerous sense of cunning. Her lightning breath is the least of willful intruders’ worries. |\n| 12 | Athalsar | An gold dragon, known for his diplomacy and ability to broker peace between warring factions. |\n| 13 | Ythian | A black dragon, whose residence in the murky depths has steeped him in an aura of dread and decay. |\n| 14 | Kuranaz | A blue dragon, his fierce intellect and knowledge of arcana make him a formidable opponent. |\n| 15 | Thaurumbras | A bronze dragon, his affinity for the sea and tempestuous nature make him unpredictable yet indispensable in naval warfare. |\n| 16 | Ulkair | A green dragon, notorious for his love for manipulation and expectation of absolute obedience from subordinates. |\n| 17 | Glaysa | A silver dragon, she is known for her healing abilities and benevolence. Her majestic presence beckons hope and tranquility. |\n| 18 | Dralliosastra | A white dragon, feared for her icy breath and her skill in camouflage against snowy terrains. |\n| 19 | Vyralsathrax | A copper dragon, his love for storytelling is matched only by his constant search for treasure and relics. |\n| 20 | Zurigath | An ancient brass dragon known for his omniscience and vast repository of lore spanning millennia. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragon"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragon Names"
    },
    {
      "rawText": "## Dragonborn\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Draal | Draal is a stoic, heavily-scarred Dragonborn warrior. His bronze scales have faded with age. Known for his unwavering loyalty and commitment to justice. |\n| 2 | Nazgrix | A sapphire-scaled dragonborn sorcerer who speaks in a calm yet commanding voice. Holds a deep reverence for ancient dragon lore and magic. |\n| 3 | Thava | Tall and statuesque, Thava is a silver-scaled Dragonborn cleric. She holds a strong sense of responsibility towards the well-being of her people. |\n| 4 | Khorvash  | Brass-scaled Khorvash is a renowned, level-headed Dragonborn chieftain, respected for his strategic mind and wartime leadership. |\n| 5 | Kongir  | Kongir, a scholarly Dragonborn with faded green scales, is often found pouring over books, in search of old wisdom and forgotten tales. |\n| 6 | Morgath | Onyx-scaled Morgath, a silent and stoic Dragonborn ranger, knows every crag and crevice in his mountain home like the back of his claw. |\n| 7 | Erazix  | Erazix the black is a Dragonborn rogue with a dubious reputation. Not one for conversation, his profound skills are often shrouded in mystery. |\n| 8 | Tharagar | Gold-scaled Tharagar is a broad-shouldered Dragonborn warrior. Known for his brute strength and unwavering commitment to his clan. |\n| 9 | Yevelda | Yevelda, a silver dragonborn, stands out for her unusual curiosity about realms beyond her homeland and her passion for change. |\n| 10 | Vervoth | Vervoth, a gold Dragonborn paladin, projects an aura of quiet authority. His steadfast faith and firm belief in order has earned him many followers. |\n| 11 | Gheshanna | A leader in her own right, Gheshanna bears emerald dragonborn scales and carries a soft, understanding voice that commands respect. |\n| 12 | Salrox | Salrox the Copper, while unassuming at first glance, is a Dragonborn bard whose tales of legendary heroes can inspire even the most disheartened of hearts. |\n| 13 | Arjhan | Bearing burnished bronze scales, Arjhan the Dragonborn monk follows a path of discipline and self-improvement, striving to achieve perfect harmony. |\n| 14 | Zofia | Zofia, a white Dragonborn druid, has an innate connection with nature that surpasses that of most, her stories from the wild hold many in rapture. |\n| 15 | Shruikan | Shruikan, a red dragonborn, is often misunderstood due to his introverted nature, but his arcane knowledge is second to none. |\n| 16 | Vargach | Vargach, a stoic, scarlet Dragonborn, is a blacksmith by trade. His precision and dedication to his craft is legendary in his hometown. |\n| 17 | Heskan | Heskan, known for his steely gaze and azure scales, is a Dragonborn cleric who uses his divine powers to heal and support his clan. |\n| 18 | Balasar | With cobalt-scaled elegance, Balasar, a Dragonborn knight, possesses an unwavering sense of loyalty, chivalry, and duty towards his liege. |\n| 19 | Galaxakas | Galaxakas, a sage with amethyst Dragonborn scales, is known for his profound knowledge of arcane mysteries and celestial lore. |\n| 20 | Vhir  | Vhir, with blackened Dragonborn scales, is a mysterious figure whose quiet demeanor masks a lethal skill as a rogue and an assassin. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dragonborn"
      ],
      "tagSymbol": "~",
      "tagValue": "Dragonborn Names"
    },
    {
      "rawText": "## Drow\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Nalfein Do'Urden | An old, experienced Drow warrior with glowing red eyes and a brooding demeanor. Covered in battle scars and usually found sharpening his dual scimitars. |\n| 2 | Xullrae Zauviir | Young and cunning Drow female, striking with gleaming violet eyes. Often seen in the company of a large spider pet. |\n| 3 | Jhaelryn Baenre | Fierce Drow Cleric of Lolth, bald and unusually tall with a deep voice that echoes devotion and fear. |\n| 4 | G'eldreth Tlabbar | A dark and mysterious male rogue, always hidden beneath a hooded dark cloak. His eerily calm demeanor and the constant whispering to his snake companion perplex the bystanders. |\n| 5 | Ysolde Vrinn | A Drow matriarch, she is revered and feared for her age, wisdom, and the stern look in her eyes that has seen centuries passing by. |\n| 6 | Irae T'sarran | Dedicated spell caster and high priestess, Irae is recognized by her staff embedded with a massive spider figure, a symbol of her devotion to Lolth. |\n| 7 | Sorcere Mizzrym | Sullen and withdrawn Drow, Sorcere is always found experimenting with new spells, with an insatiable hunger for knowledge and power. |\n| 8 | Sorn Lissor | An unassuming Drow brewer with an affable smile. Has a multitude of potions and remedies for every situation. |\n| 9 | Taleisin Rilyn | A bitter Drow ranger, exiled by his family, wandering and surviving in the wild with only his panther pet for company. |\n| 10 | Ulviirrin Despana | A famed Drow bard captivating audiences with his haunting lute music and tales of the Underdark. |\n| 11 | Vexia Noquar | Insane Drow inventor tangled in a mess of gears and blueprints. Expect an explosion around every corner. |\n| 12 | Yvonnel Baenre II | The relatively young and ambitious ruler of Menzoberranzan, often surrounded by her numerous guards and advisers. |\n| 13 | Chaszmyr Xyd'mordvyt | A feared Drow enforcer, covered in dark steel armour from head to toe, silent and looming. |\n| 14 | Iymarra Auvryndar | Tortured Drow artist obsessed with capturing the horrors and beauty of the Underdark on her macabre canvases. |\n| 15 | Pharaun M'agrym | Silver tongued Drow diplomat and spy who can kindle a war or mend a fragile peace with his words. |\n| 16 | Rizzen Vandree | A decorated Drow soldier with a stern and no-nonsense demeanor, disciplined to the point of being robotic. |\n| 17 | G'eldreth Agrachdyrr | An enigmatic Drow druid who lives among the dangerous fauna of the Underdark, his heart pulsing with its rhythms. |\n| 18 | Briza Do'Urden | Dispassionate Drow matron mother, holding her house and her city in an iron grip with her cold, decisive command. |\n| 19 | Kelnozz Kenafin | A mysterious Drow sorcerer, completely mute, communicating only through telepathy and his powerful, often destructive, magic. |\n| 20 | Liriel D'Vir | A renowned Drow scholar, her brilliance unmarred by her life in exile. Her disarming politeness can often make others ignore the danger lurking beneath her smile. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Drow"
      ],
      "tagSymbol": "~",
      "tagValue": "Drow Names"
    },
    {
      "rawText": "## Duergar\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | Drakar Forgemoth | The resilient leader of a Duergar miner group, known for his stern demeanor and powerful grip. |\n| 2 | Ovark Twinaxe | So named for the pair of axes he wields in battle. His stoic personality hides a tactical genius. |\n| 3 | Ulgar Ironbeard | An accomplished Duergar blacksmith with a beard woven into iron rings showing his meticulous nature. |\n| 4 | Zarnak the Unseen | A sneaky scout and secretly a spellcaster, she obscures her face under a hood. Known for her quiet but commanding presence. |\n| 5 | Gurnak Stonehammer | The most skilled mason in the stronghold with an unyielding personality and remarkable strength. |\n| 6 | Skirna Deepdelver | A Duergar archaeologist prized for her knowledge of the underdark tunnels. She is serious, dedicated, and highly disciplined. |\n| 7 | Vorag Flamebeard | A radical and uncompromising pyromancer whose facial hair is perpetually smouldering. He is gruff and fearsome. |\n| 8 | Harnok Boltforger | A skilled engineer known for his grim determination and the intricate crossbows he crafts. |\n| 9 | Brurna Fettershaper | A chainmaker with a fierce reputation for both her brutal efficiency in combat and her superior craftsmanship. |\n| 10 | Thorgoll The Quiet | A hunter known for his stealth and rarely speaks, his swift actions speak louder than any words. |\n| 11 | Surnek the Burrower | A master digger and earth manipulator. He is stern yet patient, waiting for the right time to strike. |\n| 12 | Finor Hammerfist | A skilled duelist with a temper as solid as the hammers he fists. He lives by a strict code of honor. |\n| 13 | Gernak Doomcaster | A somber cleric who sees omens in every event, his seriousness only seems to deepen his connection to his deity. |\n| 14 | Delgath Peakshadow | A top-notch spy, his grim demeanor and expert information gathering skills have made him indispensable to the Duergar. |\n| 15 | Egorn Blackdepth | A fisher who sculpts lifelike statues from Underdark stones, he is a model of stoic perseverance. |\n| 16 | Murnog Graspgrit | A mason known for dealing with the hardest rocks and minerals, his grip strength and resolve are legendary. |\n| 17 | Tornak Earthsplitter | The best demolition expert around, his serious nature ensures that all his explosions are precise and controlled. |\n| 18 | Gelgret Emberborn | A powerful evoker known for using fire in her spells, she is treated with a mix of fear and respect. |\n| 19 | Vornar Farvision | An elderly loremaster, respected for his profound wisdom and the vast amount of historical knowledge he possesses. |\n| 20 | Immok Stonelung | As a miner who's spent most of his life in dusty tunnels. He's earned his name, and a reputation for unflappable persistence. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Duergar"
      ],
      "tagSymbol": "~",
      "tagValue": "Duergar Names"
    },
    {
      "rawText": "## Dwarves\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Gorim Frostbeard | An aging war veteran with a frost-encrusted beard, known for his strategic acumen and stoic nature |\n| 2 | Thuldrin Shatterstone | A miner with a reputation for unearthing rare gems, Thuldrin bears the scars of several cave-in accidents |\n| 3 | Astra Fireheart | A blacksmith renowned for her temper and her exceptional weapons, Astra possesses an aura of hard-earned respect |\n| 4 | Duragar Ironhand | A grim and tight-lipped guard captain who is missing two fingers from his left hand—a result of a skirmish with a goblin raid |\n| 5 | Ygnar Heavyfoot | A rotund and cheerful brewmaster with an infectious laugh that belies his hard exterior; known for his legendary ale |\n| 6 | Kildor Hammerfall | A cleric of the Forge with a devout, somber disposition. His holy symbol is an ancient relic passed down through generations |\n| 7 | Neldra Snowmantle | A serious-minded ranger who knows the mountain trails better than anyone; patrols the outskirts of town with her hawk companion |\n| 8 | Sorin Stoneshield | An elder loremaster clad in traditional runic armor; his severe expression hides a wealth of knowledge |\n| 9 | Ericka Flintbraid | A savvy trader known for her sharp eye and sharper wit; has a network of informants in every trading hub |\n| 10 | Brundar Deepdelve | A taciturn prospector with a stubborn streak; often breaks into promising new tunnels on his own |\n| 11 | Falgar Steelforge | A master metalsmith always seen working at his forge; there’s a stern intensity about him |\n| 12 | Haelga Axebearer | A no-nonsense warrior woman with a fiery red mane; carries a ancestral axe with notable battle marks |\n| 13 | Balgor Earthshaker | An explosive expert with missing eyebrows; his guarded, thoughtful demeanor is at odds with his profession |\n| 14 | Ranok Brightbarrel | A brewer experimenting with exotic infusions; his innovative elixirs fetch a hefty price among the higher society folk |\n| 15 | Morga Strongarm | A scarred hauler renowned for her physique; she can carry more loads of stone in a day than most dwarves can in two |\n| 16 | Thorgal Mithrilbeard | A wealthy merchant who became affluent from his mithril trade; he wears a constant, calculating frown |\n| 17 | Nystra Rockheart | An adept stonemason admired for her detailed sculptures; a stalwart keep of dwarven traditions and artistry |\n| 18 | Fargus Blackhammer | A stony-eyed weaponmaster who respects only strength; a valued combat trainer |\n| 19 | Rurik Goldvein | An aging prospector who found and lost a fortune. His stoic exterior hides a tale of triumph and regrets |\n| 20 | Ulgar Stormheart | A tempestuous battle cleric with a loud booming voice; the heart of his people in times of trouble |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Dwarves"
      ],
      "tagSymbol": "~",
      "tagValue": "Dwarves Names"
    },
    {
      "rawText": "## Elves\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Elandrial | An elf with striking silver hair and serious dark eyes. Outwardly calm, she is a skilled mage researching dangerous magic. |\n| 2 | Lotharion | A tall, elegant elf warrior with scars on his face. He radiates a composed aura, his eyes tell a story of countless battles.|\n| 3 | Illmora | This female elf is an accomplished diplomat, her discourse is both soft yet firm, adorned by her jet-black hair. |\n| 4 | Thal'din | A elven rogue with sleek golden hair, sharp blue eyes, always seen analyzing the surroundings. |\n| 5 | Aevaris | An aged elf druid, the colors of autumn reflected in his eyes. He respects nature and possesses deep wisdom. |\n| 6 | Leriel | This elven cleric of Corellon has a mystical aura about her, her hair shines like the night sky, eyes as pure as the moon. |\n| 7 | Boromal | A burly elf fighter with a few missing teeth, which doesn't mar his regal appearance. Skin like polished oak, he is an epitome of valor.|\n| 8 | Yllara | An elven bard with captivating emerald eyes and a heartwarming smile. Always has a tale on her lips, ready to enthrall any audience. |\n| 9 | Haldoril | A scholarly elf with spectacles perched on his nose, always seen pouring over old scrolls and books in search of ancient knowledge. |\n| 10 | Aeriel | An elven ranger, seemingly aloof, her icy-blue eyes have seen much in the wilderness. Known for her hawk-like tracking skills. |\n| 11 | Tellion | A taciturn elf blacksmith, his steel-grey hair mirrors the metal he expertly shapes, known for his master craftsmanship. |\n| 12 | Lithelwaen | A forester elf, her hair the color of autumn leaves. A guardian of the woods, her bow never misses its mark. |\n| 13 | Arannis | This elf watchman is as reliable as they come. His vigilance keeps the city safe as day turns to night. |\n| 14 | Lianodel | This elf's eerie fair-white skin hints at her necromantic practices, yet she remains respected due to her unwavering loyalty to the community. |\n| 15 | Elrohir | An unassuming elf cobbler by day, by night he morphs into a shadowy figure, a well-known figure in the underbelly of the city. |\n| 16 | Ruandil | An elven beastmaster, his presence is rarely seen, but often felt through the myriad animals that seem to aid his city. |\n| 17 | Caelir | This elven herbalist has an intimate knowledge of plants, her potions and remedies are sought by the ailing from far and wide. |\n| 18 | Daelis | An elf moon priest, he reveres the lunar cycle. Known to perform sacred dances to the moonlight casting an ethereal glow on his silver hair.|\n| 19 | Sariela | An elf jeweler, her work reflects the exquisite beauty and delicate detail of nature. Her craft is as legendary as her own turquoise-eyed beauty. |\n| 20 | Romyar | A venerable elven sage, his chronicles of history and lore are invaluable. His sharp gaze, a window to the wealth of knowledge he possesses. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Elves Names"
    },
    {
      "rawText": "## Genasi\r\n| Dice Value | Name | Description |\n|----|--------|-------------|\n| 1 | Eolande Stormwhisper | A Water Genasi rogue with deep blue skin and hair resembling a flowing river, looking for vengeance against those who destroyed her village. |\n| 2 | Vallus Emberstride | An Earth Genasi fighter with rock-like skin and ruby eyes, possessing a stern demeanor and a strong sense of duty. |\n| 3 | Kaida Frostgaze | An Air Genasi wizard, her pale blue skin seems to shimmer in the wind while her icy blue eyes hide centuries of wisdom. |\n| 4 | Erevan Firemantle | A Fire Genasi warlock whose red flaming hair tinder around his deep, obsidian black skin, maintains a suspicious demeanor, almost as if he's hiding something. |\n| 5 | Lirael Earthshadow | A stoic Earth Genasi ranger, with emerald green eyes and a coat of tough, mud-brown skin, always alert and ready for danger. |\n| 6 | Garus Waveheart | A muscular Water Genasi bard with deep turquoise skin and hair that flows like the ocean tide, seeks lost maritime melodies. |\n| 7 | Nemera Gustsong | An Air Genasi cleric, ethereal and otherworldly with a voice that rivals the sweetest bird's tunes, but hides a steel core under her gentleness. |\n| 8 | Azibo Magmafist | A giant Fire Genasi monk with molten skin and burning fists, who is sworn to an ancient and forgotten order. |\n| 9 | Reeva Stonerose | A proud Earth Genasi paladin with eyes of sparkling quartz and strong, rigid features, protrector of the oppressed. |\n| 10 | Kaelis Cloudstalker | An elusive Air Genasi thief, has silver skin and white cloudlike hair, known for his uncanny ability to disappear. |\n| 11 | Faelar Flamesoul | A charismatic Fire Genasi sorcerer with hair like a blazing fire and eyes complex as an inferno, constantly in search of arcane knowledge. |\n| 12 | Maia Moistdew | A homely Water Genasi druid with skin that slightly glimmers from perpetual moisture, caring for wounded creatures with a supernatural calm. |\n| 13 | Balder Granitehew | A towering Earth Genasi barbarian, with stone hard skin and determined steel-grey eyes, carries an ancestral gemstone-embedded axe. |\n| 14 | Ysrayl Galepoint | A daring Air Genasi ranger with gleaming sapphire eyes and hair that flows like a refreshing breeze, eagle-eyed and agile. |\n| 15 | Zephyr Blazebrow | A Fire Genasi artisan with hair dancing like the warm crackle of a hearth, crafting fine smithy work that is always in demand. |\n| 16 | Caelum Waveborn | A stern Water Genasi cleric, skin a dark, stormy gray and eyes the color of sea-foam, fully devoted to his ocean-storm deity. |\n| 17 | Geode Splitstone | A wise Earth Genasi scholar, brown rough skin with gemstone piercing eyes, always seeking ancient lore. |\n| 18 | Nubia Galeflight| An adventurous Air Genasi fighter with hair that billows like a wild tempest, driven to protect her family's honor. |\n| 19 | Ignis Sparkbeard | A seasoned Fire Genasi captain, ablaze with the fire of confidence and the glow of tattoos etched into his skin. |\n| 20 | Mira Ebbtide | A Water Genasi diplomat with skin the color of a clear blue lagoon, tirelessly working to maintain alliances and resolve disputes. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Genasi"
      ],
      "tagSymbol": "~",
      "tagValue": "Genasi Names"
    },
    {
      "rawText": "## Gnomes\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Filiwick Tinwhistle | A bald gnome alchemist notorious for creating highly dangerous and unstable mixtures. |\n| 2 | Thistle Jinglecrank | An elderly gnome scholar, who possesses an expansive library of arcane knowledge. |\n| 3 | Nimbledigit Geargrinder | A gnome inventor tinkering with clockworks and intricate machinery. Serious-faced and obsessed with precision. |\n| 4 | Millicent Sparkleshade | A gnome bard whose somber melodies evoke the deepest emotions from her audience. |\n| 5 | Glyph Anvilbend | A gnome blacksmith. Strong and quiet, whose work reflects meticulous craftsmanship. |\n| 6 | Bede Tritewind | A gnome sailor, navigating the vast oceans with unwavering dedication and concentration. |\n| 7 | Muddle Puddlefoot | A cleric gnome, a spiritual and serious gnome who tirelessly serves the gnomish deity. |\n| 8 | Bilber Tangleknot | A gnome ranger, a silent and adept tracker, one with the wilderness. |\n| 9 | Grub Sandgrain | A reclusive gnome hermit dwelling in the undisturbed nooks and caves of the mountains. |\n| 10 | Poppy Trillbleeper | An extraordinary rogue gnome, notorious in the underworld for her swift moves and serious demeanor. |\n| 11 | Gristle Stonegrinder | An armor-clad gnome warrior, stern and battle-hardened from years of service. |\n| 12 | Zephyr Cogtwister | A gnome artificer, zealous in creating enchanted artifacts. |\n| 13 | Kettle Bumblelore | A wise old gnome wizard studying the mysteries of the arcane in deep solitude. |\n| 14 | Rubble Thimblegrip | In the realm of gnomish politics, this gnome diplomat is renowned for his serious and straightforward manners. |\n| 15 | Snippit Quickfingers | Agile gnome thief known for her deftness, agility and a seemingly permanent stoic expression. |\n| 16 | Brisk Dapplegrunt | Stern and calculating gnome merchant, famous for his sharp business acumen and shrewd bargaining skills. |\n| 17 | Garble Spindleshanks | A lonesome gnome explorer mapping uncharted territories with taciturn determination. |\n| 18 | Clogstable Whirrzip | A gnome scribe whose serious countenance hides beneath a mountain of scrolls and books. |\n| 19 | Humpfry Scuttleblot | A gnome acrobat whose prowess and gracefulness belie his serious training regimen. |\n| 20 | Wobble Sneaksnitch | A gnome detective, adept at unraveling mysteries and serious in his pursuit of truth. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Gnomes"
      ],
      "tagSymbol": "~",
      "tagValue": "Gnomes Names"
    },
    {
      "rawText": "## Goblin\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Gruk Spidersnack | Battle-scarred goblin with a piercing glare. Known for his taste in spider delicacies. |\n| 2 | Snagglick Rustblade | Goblin rogue wielding a corroded short sword. Has an uncanny ability to find unguarded valuables. |\n| 3 | Kreech Shadowcloak | Stealthy goblin with dark, thread-bare cloak. Famed sneak-thief and rumor-monger. |\n| 4 | Slink Sootfoot | Goblin uncannily quiet while moving. Noted for his charcoal-blackened feet. |\n| 5 | Muck Toothgrin | Goblin with an always-grinning, teeth-riddled smile. His sickly laugh is often the last sound his victims hear. |\n| 6 | Griz the Snakecharmer | Goblin witchdoctor with a pet viper. Holds significant influence among the local tribes. |\n| 7 | Blekrit Sharpeye | Goblin hunter with almost unnerving precision. Often employed as a scout or tracker. |\n| 8 | Xiblix Crackedhelm | Goblin warrior who enjoys bashing things with his head. Has a broken helmet to show for it. |\n| 9 | Urk Spitroast | Goblin cook famous for her roasted meats. Known to experiment with a variety of exotic beasts. |\n| 10 | Skraas Redstreak | Fleet-footed goblin messenger. Covered in ritualistic red streaks for protection while on errands. |\n| 11 | Gnik the Breaker | Goblin infamous for his strength. Known to shatter weapons, shields and the occassional skull. |\n| 12 | Klurk Stinkhat | Goblin trapper, specializes in foul-smelling bait and traps. Wears a pungently-scented hat as a good luck charm. |\n| 13 | Glabag Ironchewer | Goblin with an unusual diet of metal scrap. Has exceptionally strong jaw muscles and a mouth full of chipped teeth. |\n| 14 | Flink Whisperthane | Goblin leader renowned for his silent commands. His tribe move like a swift and quiet wind over the battlefield. |\n| 15 | Bleegit Twice-Cursed | Unlucky goblin shaman. Has an uncanny tendency to attract mishaps and troubless spirits. |\n| 16 | Skaag Bonepicker | Goblin scavenger. Scours the battlefield for spoils of war, and isn't above stripping a fallen comrade. |\n| 17 | Krabuk Spiderbait | Goblin known for luring out giant spiders with himself as bait. He's covered in venom resistant warts. |\n| 18 | Nubnub Beastfriend | Short goblin who somehow tames wild beasts. Often seen with a growling warg or chattering goblin bat. |\n| 19 | Klut Shriekling | Goblin with a piercing scream. Useful as an alarm or distraction, dampens the morale of most foes. |\n| 20 | Gronk the Scuttler | Goblin survivor, extremely resourceful and slippery. Escaped from innumerable traps and custody. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goblin"
      ],
      "tagSymbol": "~",
      "tagValue": "Goblin Names"
    },
    {
      "rawText": "## Goliath\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Balgath | A stern goliath with deep-set eyes and ritual tattoos depicting his clan's achievements. Very observant. |\n| 2 | Thogret | This muscular goliath has a sun-bleached scalp and arms laced with old scars from countless battles. |\n| 3 | Vurnor | Thin for a goliath, he is tenacious and crafty, putting his intelligence to good use. |\n| 4 | Grolag | An aging goliath, his once powerful form now slightly weathered, but he remains a canny leader. |\n| 5 | Mogdul | Possessed of striking blue eyes, this female goliath is a prominent spiritual guide. |\n| 6 | Yalgeta | A strong and determined huntress, she has hair woven with feathers and beads. Quiet, and always watching. |\n| 7 | Kragunh | This sizable goliath radiates power, his tattoos reflecting countless personal achievements. |\n| 8 | Thunukalathi | A mute goliath with a deep understanding of the land. Communicates through hand signals. |\n| 9 | Dalura | This goliath is known for her piercing green eyes and adaptability to extreme conditions. |\n| 10 | Uthal | A skilled tracker with a keen eye and rugged scar across his face. |\n| 11 | Eglath | A reserved yet reliable goliath with deep wisdom. Sports a heavy white stone necklace. |\n| 12 | Thokra | Thokra's distinctive tattoo is a story of survival against the odds. He carries a scar-laden staff. |\n| 13 | Balban | Covered in intricate tattoos, Balban is stoic and speaks only when necessary. |\n| 14 | Noanuk | Noanuk is a seasoned warrior, showed by his many battle scars and solid stance. |\n| 15 | Ilikan | This goliath enjoys music and carries his joy everywhere. Always seen with his stone flute. |\n| 16 | Vaunea | Vaunea's physique is incredibly impressive, even for a goliath, and she uses her strength wisely. |\n| 17 | Ogolai | Singularly dedicated to his tribe, quiet and watchful. Has a gentle touch with animals. |\n| 18 | Kaladun | He is a goliath of exceptional size, noted for his patience and composure. |\n| 19 | Gundir | Her imposing presence is accentuated by a harsh voice. Her tattoos show her to be a high-ranking warrior. |\n| 20 | Torgal | A learned goliath, Torgal has a quiet intensity and penchant for strategy games. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Goliath"
      ],
      "tagSymbol": "~",
      "tagValue": "Goliath Names"
    },
    {
      "rawText": "## Half-Elves\r\n| Dice Value | Name          | Description |\n|------------|---------------|-------------|\n| 1          | Erevan        | A solemn half-elf cleric with a disciplined demeanor. Carries an adorned holy symbol of his deity around his neck. |\n| 2          | Thamior       | A skilled ranger with a quiet and introspective personality. Wears a cloak made from the hide of a beast he slew himself. |\n| 3          | Miri          | A stoic rogue with an icy expression. Always alert and watches others closely, her knives always ready at her belt. |\n| 4          | Balinor       | A steadfast half-elf fighter who carries a large greatsword strapped to his back. Rarely smiles, but is loyal to his comrades. |\n| 5          | Illydia       | A stern wizard, equipped with a well-worn spellbook. She has a serious countenance and a reputation for being strict but fair. |\n| 6          | Aerin         | A reserved and pensive druid, with a deep connection to nature. Carries a gnarled wooden staff and always has leaves in his hair. |\n| 7          | Levliann      | A reserved bard with a harmonious voice. Devoted to his art, Levliann only displays emotion when he's performing. |\n| 8          | Quirinus      | A half-elf paladin with hardened eyes. His weathered armor bears the symbol of a righteous cause. |\n| 9          | Amakiir       | A warlock who exudes a disquieting aura. Constantly speaks in cryptic phrases, leaving others guessing his motives. |\n| 10         | Kaelis        | A methodical half-elf alchemist, always seen with his potion vials and tools. His meticulous nature borders on obsessive. |\n| 11         | Valenae       | A solemn sorcerer with arcane tattoos etched on her skin. Always seems lost in thought, as though ensnared by some inner turmoil. |\n| 12         | Olorin        | A serious monk, Olorin is always meditating or training, striving to keep his body and mind in harmony. |\n| 13         | Belisar       | A half-elf ranger, stoically silent and constantly alert to his surroundings. Armed with a longbow and arrows. |\n| 14         | Naeryndam     | A stoic and reserved barbarian with a scarred face. His brute strength is as unyielding as his resolute character. |\n| 15         | Cylyria       | A disciplined half-elf fighter, Cylyria maintains her armor and weapons with a level of respect and dedication that borders on reverence. |\n| 16         | Quaranir      | A wizard with stern eyes, Quaranir spends most of his time studying ancient texts and perfecting his spells. |\n| 17         | Nienna        | A rogue draped in dark cloaks, her face mostly obscured by a hood. Nienna is laconic and prefers solitude. |\n| 18         | Arannis       | A serious cleric, Arannis is a devout follower of his god. Carries a holy symbol as a sign of faith. |\n| 19         | Elenath       | A half-elf druid with a somber demeanor, Elenath's connection to nature is palpable. Always surrounded by small critters. |\n| 20         | Elindra       | A bard who uses her enchanting voice with caution. Dry wit and somber tone, her performances are deeply moving. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Elves"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Elves Names"
    },
    {
      "rawText": "## Half-Orcs\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Gromash the Stern | A stout and grim half-orc, Gromash is known for his iron discipline and harsh code of honor. |\n| 2 | Shargul Stoneface | A formidable and silent blacksmith, Shargul has a reputation for producing unmatched weapons. |\n| 3 | Hrogar Bloodrage | Hrogar is a solitary berserker, focused only on harnessing the rage within him for the battlefield. |\n| 4 | Yagra Ironfist | A respected warrior and leader of her tribe, Yagra stands out with her unique iron gauntlet. |\n| 5 | Krusk Bonebreaker | A powerful enforcer for a thieves' guild, Krusk is known for his brute strength and aggression. |\n| 6 | Durzug the Stubborn | Durzug is an unyielding protector, known for his stubbornness in safeguarding his village from any threat. |\n| 7 | Garnak of the Broken Tusk | Garnak is an experienced hunter, his broken tusk a reminder of a hard-fought battle against a dire bear. |\n| 8 | Muroka the Silent | A mysterious and intimidating figure, Muroka is known for her silence and unmatched archery skills. |\n| 9 | Oloth the Vengeful | Oloth is a half-orc on a relentless quest for revenge after witnessing the slaughter of his family. |\n| 10 | Borak the Relentless | Borak is a merciless warrior, feared by many for his relentless drive in battle. |\n| 11 | Skarr Bladebender | A notorious mercenary, Skarr is known for his unique ability to bend blades with his physical strength. |\n| 12 | Thruk the Brawler | Thruk is a seasoned gladiator who revels in the thrill and honor of combat. |\n| 13 | Varguk the Unmovable | Varguk is a steadfast guard who earned his name by single-handedly holding a crucial gate against an invading army. |\n| 14 | Zagrak the Intimidator | Zagrak is a mob boss, using his imposing size and strength to intimidate others into submission. |\n| 15 | Urgork the Outcast | A lone ranger dwelling in the wilds, Urgork was cast out from his clan due to his refusal to partake in their blood-thirsty customs. |\n| 16 | Brakka the Thunderous | Brakka, a battle cleric with a booming voice, inspires and leads her comrades into battles with unrivaled ferocity. |\n| 17 | Ragnor Mudmask | A healing shaman of a forgotten tribe, Ragnor is respected for his communion with the nature spirits. |\n| 18 | Korag the Loner | Korag is a wizard living in solitude. Despite his gruff exterior, he is known to aid those who truly need his magical prowess. |\n| 19 | Krodash the Wise | Shunned for his scholarly pursuits, Krodash is a sage who seeks to reconcile the half-orc's violent history with a more peaceful future. |\n| 20 | Bargol the Harmonious | A half-orc bard of unexpected sophistication, Bargol challenges stereotypes with his eloquent poetry and epic ballads. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Half-Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "Half-Orcs Names"
    },
    {
      "rawText": "## Halflings\r\n| Dice Value | Name          | Description                                                                 |\n|------------|--------------|---------------------------------------------------------------------------|\n| 1          | Samsa Stout  | A somber halfling woman with sharp blue eyes and a well-kept tobacco pipe. |\n| 2          | Gongo Deepfoot| A serious halfling merchant always seen wearing his worn leather armor.   |\n| 3          | Tomo Rumble  | A quiet, subdued halfling with muddy brown hair and a crooked smile.      |\n| 4          | Berylla Goodbody | An attentive halfling herbalist known for her steely gaze.              |\n| 5          | Harlo Quickhand | A halfling thief with swift hands and a serious disposition.            |\n| 6          | Mina Greenbottle | A halfling maid with mousy hair and a profound love for silence.        |\n| 7          | Perdo Underhill | A stern halfling elder with a striking white beard.                      |\n| 8          | Jeri Overhill | A precise halfling cartographer, always found with a map and compass.    |\n| 9          | Tilda Brushgather | An observant halfling scout with keen eyes and a solemn demeanor.      |\n| 10         | Rollo Leafcutter | A grim halfling woodsman with an axe never far from his side.           |\n| 11         | Nora Marish | A quiet halfling librarian with a penchant for ancient texts.             |\n| 12         | Brom Haysend | A careful halfling farmer with a passion for his crop.                    |\n| 13         | Lila Shortwick | A serious halfling mason with a hard exterior.                          |\n| 14         | Podo Proudfoot | A stern halfling guardsman who values discipline and order.             |\n| 15         | Sera Bellhill | A meticulous halfling baker with a fondness for precision.               |\n| 16         | Lotho Smallburrow | A solemn halfling ferryman who keeps his thoughts to himself.         |\n| 17         | Hedda Millstone | A serious halfling blacksmith always seen with soot-covered clothing.  |\n| 18         | Doffer Barleyrug | A stern halfling brewer dedicated to crafting the finest ales.         |\n| 19         | Eberk Barefoot | A quiet halfling cleric who prefers to keep his faith private.           |\n| 20         | Merla Toadstool | An observant halfling herbalist with a clinical eye for details.        |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Halflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Hobgoblin\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Varn Ironclaw | A stern, battle-hardened warlord, stoic and disciplined, with a reputation for his strategic acumen. |\n| 2 | Mogg Thundertooth | A resourceful weaponsmith, mistrustful of outsiders and well respected within his clan for his craftsmanship. |\n| 3 | Karg Bonebreaker | A fervent warrior, pledging his loyalty to his battalion. Wields his fearsome Morningstar flawlessly. |\n| 4 | Zog the Cautious | A traditionally trained scout, known for his stealth, sharp eyes and even sharper instincts. |\n| 5 | Dregg Firebrand | A simmering shaman adept in Fire Magics, feared among neighbouring clans for his devastating spells. |\n| 6 | Xarr Bloodfist | A relentless brawler with a track record of countless victories in clan's pit fights. |\n| 7 | Tog Elfslayer | A decorated soldier, notorious for his deep-seated enmity for elves. |\n| 8 | Krek Onyxeye | A seasoned tracker with an uncanny ability to find what's hidden or lost. |\n| 9 | Skorg Beastreaver | A fearless beastmaster who commands formidable beasts to do his bidding. |\n| 10 | Ragg Two-Blades | A quick and agile rogue, hard to predict and harder to catch. |\n| 11 | Gurr Wolfheart | A clan patriarch, widely respected for his wisdom and ability to negotiate between rival clans. |\n| 12 | Bokk the Taciturn | A grizzled veteran of many wars, speaking more with actions than words. |\n| 13 | Snogg Bloodaxe | A defined marksman, known for his ruthless precision with a crossbow. |\n| 14 | Khurg the Oathbearer | A devoted zealot, chasing the glory of their gods with blind faith and unyielding determination. |\n| 15 | Krogg Ironskin | A stocky hobgoblin, known for his iron will and stubborn resilience in the heat of battle. |\n| 16 | Zarr Fangsnatcher | Always in search of treasures and shiny trinkets, with the capacity to swipe them without being seen. |\n| 17 | Thog Beastbane | A skilled hunter, more at home in the wilderness than anywhere else. |\n| 18 | Rukk the Undaunted | Unflinchingly brave, never backs down from a fight no matter the odds. |\n| 19 | Oggo Spiritcaller | A death whisperer, who speaks to the spirits of the deceased and can command them to his will. |\n| 20 | Kholl Dreadmaul | A towering war master, immensely strong, and wields his massive hammer with ease. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Hobgoblin"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Human\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Sir Alistair Bentley | A stern, grey-haired knight with a grim face and a noble air who is intensely loyal to his liege. |\n| 2 | Brother Eldric | A serious, understated monk driven by a sense of duty and deeply devoted to his faith. |\n| 3 | Lady Eveline Mosswood | A graceful noblewoman with sharp eyes, known for her shrewd political manoeuvring. |\n| 4 | Elara Blackwater | A mysterious enchantress with jet black hair and an aura of unapproachable intensity. |\n| 5 | Bertrand of Cresthill | A stern, rugged veteran soldier known for his unwavering commitment to duty. |\n| 6 | Master Alden | The gruff, expressionless master blacksmith in town, known for his exceptional crafts. |\n| 7 | Ser Percival Moray | A stern, disciplined knight renowned for his deep sense of honor and chivalry. |\n| 8 | Sister Margaret | A serious, reserved nun who dedicates her life to the faith, she is known for her charity works. |\n| 9 | Lord Oswin Drakewind | A strategic, imposing noble with a reputation for cold efficiency in political dealings. |\n| 10 | Lady Gwendolyn Brightmoor | A stoic, ice-eyed noblewoman, feared for her ruthless control over her lands. |\n| 11 | Captain Yorick Thomason | A serious, unyielding town guard captain with a strict adherence to law and order. |\n| 12 | Nasrin Stormreader | A long-faced, solemn diviner, renowned for her accuracy and stone-cold demeanor. |\n| 13 | Brother Hugo | A stern, older cleric with a commanding presence known for his unshakeable faith. |\n| 14 | Dame Seraphina Hawksley | A fair, strict lady knight known for her unwavering sense of duty and command over her troops. |\n| 15 | Professor Morwen Thistle | A severe, elderly scholar known for her extensive knowledge and rigorous teaching methods. |\n| 16 | Sir Reginald Dunhaven | A formidable, hawk-gazed knight notorious for his uncompromising justice. |\n| 17 | Doctor Theobald Crane | A serious, soft-spoken physician with a reputation for his meticulous dedication to healing. |\n| 18 | Dame Althea Ravenshield | A stolid, silver-haired dame, universally respected for her valor and strategic brilliance. |\n| 19 | Master Luthor | The austere master librarian, known for his encyclopedic grasp of knowledge and learning. |\n| 20 | Lady Isobel Frostveil | An aloof, cold-eyed noblewoman known for her unyielding control over her icy realm. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Human"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Kobold\r\n| Dice Value | Name | Description |\n|--------------|-------|--------------|\n| 1 | Sizzix | A wily kobold rogue, covered in dark, matted scales. He carries a wicked-looking dagger in his belt. |\n| 2 | Gix | A studious kobold wizard, his eyes glitter with intelligence and his scales are a faded blue. He carries a staff adorned with glowing runes. |\n| 3 | Jark | A stern faced kobold warrior, his scales are a deep red, and his weapon of choice is a spiked club. |\n| 4 | Deek | A plump kobold, gleaming scales of bright green. He is known for his talent in forging weapons. |\n| 5 | Zrzix | This kobold is thin and wiry, with dark black scales. He is an adept apothecary, known for concocting potent potions. |\n| 6 | Skritch | A skittish kobold, constantly alert and tentative. His scaly skin is a dark brown, and he is a skilled scout in his tribe. |\n| 7 | Tix | This kobold is sturdy and practical, with dull grey scales. He is a builder, responsible for designing traps and defensive contraptions. |\n| 8 | Stik | A bold kobold hunter, his scales are a vibrant orange. He is proficient with a bow and known for his excellent aim. |\n| 9 | Grik | This towering kobold warrior has stony grey scales and wears a suit of scale mail. He is a respected and feared defender of his tribe. |\n| 10 | Zzrit | A roguish kobold with an oily tongue, his scales are silver, and is known as a dealmaker and negotiator. |\n| 11 | Vizix | A resourceful kobold, she has bright white scales and is a gatherer, skilled in the collection and preparation of food. |\n| 12 | Rixzik | An oddity among his tribe, this kobold's scales are a deep purple, and he claims to be a prophet who can commune with dragon spirits. |\n| 13 | Kik | This kobold shaman is ancient and fragile, her scales pale and worn. She wields ancient magics and serves as spiritual guide for her tribe. |\n| 14 | Fink | This sharp-eyed kobold is an excellent trapmaker. His scales are a sandy yellow color and he is responsible for the protection of the tribe. |\n| 15 | Blizk | A high-energy and agile kobold, with electric blue scales, known for his talent in acrobatics and athletics. |\n| 16 | Nib | A tiny and unassuming kobold, her scales are a faded rusty color. She is an expert in stealth and reconnaissance. |\n| 17 | Griz | This burly kobold is known for his physical strength. His scales are a solid earthy brown and he serves as a laborer and hauler. |\n| 18 | Zik | A hunched over kobold, his scales are a deep blue and he serves as a scribe and keeper of the tribe's stories and knowledge. |\n| 19 | Klizk | Scaly eyed and elusive, this dark green kobold is known for his skills as a thief and spy. |\n| 20 | Triz | This kobold chieftess is a charismatic leader, her scales are a shimmering red-gold, and she commands her tribe with confidence and authority. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Kobold"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Lizardfolk\r\n| Dice Value | Name | Description |\n| --- | --- | --- |\n| 1 | K'lech | A hardened war veteran. His scaled skin is marred with scars, and one of his eyes is dull and sightless. He's considered wise among his tribe members. |\n| 2 | Ssaa'ris | A crafty lizardfolk shaman known for his understanding of herbs and potions. His green scales carry a distinctive pattern, signifying his potent magical capabilities. |\n| 3 | M'rehs | The chirurgeon of the tribe, equiped with the knowledge of numerous healing techniques. He carries himself with a somber air and holds a potent connection with the swamp around him. |\n| 4 | Vaak | A fearsome hunter, known for his swift and deadly strikes with a spear. His darker scales help him blend in the murky waters of his swampy home. |\n| 5 | S'nil | A scribe with a peculiar interest in man-creature culture. Her scales are slightly pale, a sign of spent countless hours within her shelter, studying texts and runes. |\n| 6 | Gekh | An exile, known for his brutal savagery and immunity to pain. His blood-red scales instill fear in the hearts of those who dare cross his path. |\n| 7 | R'skt | The tribe's caregiver and nurturer. Her soothing demeanor and yellowish scales make her a comforting figure amid the tribe. |\n| 8 | Xhaz | A warrior marked with blue stripes across his face. He fights with relentless ferocity and incredible dedication to his tribe. |\n| 9 | Ume | An elder who is revered for his deep wisdom and spiritual connection to the swamp. His age-worn scales carry countless stories of his tribe's history. |\n| 10 | Vil | A promising young warrior with an insatiable thirst for glory. His vibrant green scales reflect his youth and unstoppable vigor. |\n| 11 | N'thrack | The tribe's mouthpiece, proficient in multiple languages. His multicolored scales signify his varied skills and commitment to diplomacy. |\n| 12 | Orz | A skilled blacksmith, capable of crafting unique weapons from rudimentary materials. His metallic-hued scales embody his lifelong dedication to his craft. |\n| 13 | Kursk | The tribe's sentinel, ever vigilant for potential threats. His cold blue scales mirror the unforgiving nature of his watch. |\n| 14 | Ral | An accomplished tracker and trapper. His mottled green and brown scales allow him to blend in well with the foliage of his swampy domain. |\n| 15 | Korol | An apex hunter, boasting yellow stripes that sing of numerous successful hunts. His tribal artistry is laced with symbols of his prey. |\n| 16 | Ssthara | A brilliant intelligence gatherer, known for her silver scales that shimmer in the moonlight. Her grasp on subterfuge is unmatched within the tribe. |\n| 17 | Volth | An imposing figure responsible for enforcing law within the tribe. His dark scales and brutal scars speak of his compliance with justice. |\n| 18 | Ax'ik | A spirit-talker who communicates with the ghosts of the swamp. His ethereal white scales reflect his spiritual affluence. |\n| 19 | Bress | A gifted cook, renowned for concocting flavors from seemingly mundane swamp fauna. His vibrant orange scales exudes warmth similar to his preparations. |\n| 20 | L'skrath | The proud chieftain, known for his indomitable spirit and commanding presence. His golden scales are a testament of his leadership and respect within the tribe. |\n\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Lizardfolk"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Orcs\r\n| Dice Value | Name | Description |\n|---|---|---|\n| 1 | Gruk Blooddrinker | A hulking brute with scars layered upon scars, Gruk is the leader of his orc warband. An intelligent tactician despite his appearance. |\n| 2 | Brogar the One-Eyed | An orc shaman that lost an eye in a conflict with another tribe. Skilled in dark magics and beloved by his tribe. |\n| 3 | Rotnose | This orc earned his name due to a large, festering scar on his nose. A swift and ruthless raider. |\n| 4 | Throsh the Crusher | A massive orc with strength that rivals a hill giant. His cruel smile can strike fear into the heart of the bravest warriors. |\n| 5 | Grunilda the Fierce | A female orc warrior, infamous for her bloodthirsty lust for battle. A true nightmare on the field of war. |\n| 6 | Chud Grimethumb | A filthy orc with a malicious glint in his eyes. Speculated to be a spy or an envoy for another, larger tribe. |\n| 7 | Tork Splitaxe | An orc with a reputation for shattering the weapons of his foes. Tork oversees the tribe's weapon and armor production. |\n| 8 | Slog Bonebiter | A low-ranking orc who is nonetheless fiercely loyal to his tribe. Dreaming of one day leading his own raiding party. |\n| 9 | Krinko the Squint | A crafty orc that is skilled in detecting and disarming traps. His notable squint is caused by a botched trap in the past. |\n| 10 | Gorvar the Hungry | An exceptionally large orc known for his insatiable hunger. Rumored to have eaten an entire horse in one sitting. |\n| 11 | Nogg the Quiet | An orc who speaks little but hears much. Serves as the tribe's scout and silent assassin. |\n| 12 | Lugratz the Spear-Maiden | An orc female who has earned her place among the warriors with her deadly spear skills. A force to be reckoned with. |\n| 13 | Sarn Gravetalker | A necromancer orc who seeks forbidden knowledge from the spirits of the dead. Shrouded in an aura of dread and silence. |\n| 14 | Ragak the Plunderer | Renowned for his love of loot, Ragak leads the raids into human territory. He’s exceptionally cruel and known to leave no survivors. |\n| 15 | Grom Hellscream | A fearless leader with a powerful voice that can rouse his warriors into a frenzied charge. A seasoned veteran with countless victories. |\n| 16 | Zarg the Deceiver | A cunning orc with a silver tongue, possessing an unexpected knack for diplomacy and intrigue. |\n| 17 | Rend the Defiler | Once a chieftain’s son, now an outcast. Rend seeks to regain his lost standing through any means necessary. |\n| 18 | Muroka the Chainbreaker | A former slave who rose against her masters and led her fellow captives to freedom. Now she fights to liberate her fellow orcs. |\n| 19 | Narog the Slaughterer | Known for his violent tendencies, Narog relishes in the heat of battle and the spilling of enemy blood. |\n| 20 | Kargath Bladefist | Leader of the most brutal orcish tribe, Kargath had his own hand severed to replace it with a weapon. A true symbol of orcish violence and savagery. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Orcs"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    },
    {
      "rawText": "## Tieflings\r\n| Dice Value | Name | Description |\n|------------|------|-------------|\n| 1 | Althaea | A contemplative Tiefling sage dressed in blues. Their tail often flicks when deep in thought. |\n| 2 | Bael | An aloof Tiefling hunter with sharp features and red eyes that observe their environment with an almost predatory gaze. |\n| 3 | Chax | A Tiefling blacksmith of few words. His muscular build and charcoal-covered scales attest to his long hours at the forge. |\n| 4 | Drakon | A hunched goblin alchemist with bright, curious eyes and a seemingly permanent chalk-dusty appearance. |\n| 5 | Eligos | A mysterious Tiefling bard who never seems to play the same song twice. Their lute is as black as midnight. |\n| 6 | Furfur | An agile Tiefling rogue, always ready with a smirk and a quick exit. He bears scars from many close calls. |\n| 7 | Graz'zt | A Tiefling cleric of a god of redemption. His prayers seem deeply personal, as if seeking something long lost. |\n| 8 | Haagenti | A Tiefling soldier who stands firm in the face of danger. Badge of his rank is worn with pride. |\n| 9 | Ipos | A Tiefling who trains eagles for hunting. Her bond with these wild creatures is a marvel. |\n| 10 | Jezebeth | A Tiefling herbalist whose quiet resentments seem to filter into her potions. Beware her bitter brews. |\n| 11 | Kairon | A Tiefling fisherman with a special lure for catching magical fish. His tail moves in sync with the tide. |\n| 12 | Leraje | A stern Tiefling monk, his discipline shaped by harsh training. He carries the stillness of a calm sea. |\n| 13 | Mephasm | An introspective Tiefling watchman, constantly on edge as he watches for threats. His sharp eyes miss nothing. |\n| 14 | Ningal | A Tiefling scholar, whose knowledge of the arcane is vast and deep. He always has a book within reach. |\n| 15 | Orobas | A Tiefling weaver whose exquisite tapestries narrate ancient histories. Her delicate fingers are dexterous and deft. |\n| 16 | Picollus | A stern yet fair Tiefling lawkeeper, whose duty has shaped him more than he may realize. He wears his badge with solemnity. |\n| 17 | Quimbanda | An intricate Tiefling jeweler. He can tell a gem's worth with a single glance. His collection is impressive. |\n| 18 | Raum | Tiefling necromancer conducting his eerie research in secret. His pale skin is colder than grave dirt. |\n| 19 | Sitri | A Tiefling seamstress of incredible skill. Each thread she sews holds a piece of her heart and determination. |\n| 20 | Thalassa | A Tiefling furytamer, who tames and rides magical beasts. Not one to be trifled with. Her partner: a chimera named Fury. |\r\n",
      "rawPublic": "",
      "labels": [
        "Rolltable",
        "Names",
        "D&D 5E",
        "NPCs",
        "Tieflings"
      ],
      "tagSymbol": "~",
      "tagValue": "NPC Names"
    }
  ],
  "logs": []
}